Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/usbhs.h
/*
 * Component description for USBHS
 *
 * Copyright (c) 2024 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description file (ATDF) version 2023-09-08T03:06:20Z */
#ifndef _PIC32CZCA70_USBHS_COMPONENT_H_
#define _PIC32CZCA70_USBHS_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR USBHS                                        */
/* ************************************************************************** */

/* -------- USBHS_DEVDMANXTDSC : (USBHS Offset: 0x00) (R/W 32) Device DMA Channel Next Descriptor Address Register -------- */
#define USBHS_DEVDMANXTDSC_NXT_DSC_ADD_Pos    _UINT32_(0)                                          /* (USBHS_DEVDMANXTDSC) Next Descriptor Address Position */
#define USBHS_DEVDMANXTDSC_NXT_DSC_ADD_Msk    (_UINT32_(0xFFFFFFFF) << USBHS_DEVDMANXTDSC_NXT_DSC_ADD_Pos) /* (USBHS_DEVDMANXTDSC) Next Descriptor Address Mask */
#define USBHS_DEVDMANXTDSC_NXT_DSC_ADD(value) (USBHS_DEVDMANXTDSC_NXT_DSC_ADD_Msk & (_UINT32_(value) << USBHS_DEVDMANXTDSC_NXT_DSC_ADD_Pos)) /* Assigment of value for NXT_DSC_ADD in the USBHS_DEVDMANXTDSC register */
#define USBHS_DEVDMANXTDSC_Msk                _UINT32_(0xFFFFFFFF)                                 /* (USBHS_DEVDMANXTDSC) Register Mask  */


/* -------- USBHS_DEVDMAADDRESS : (USBHS Offset: 0x04) (R/W 32) Device DMA Channel Address Register -------- */
#define USBHS_DEVDMAADDRESS_BUFF_ADD_Pos      _UINT32_(0)                                          /* (USBHS_DEVDMAADDRESS) Buffer Address Position */
#define USBHS_DEVDMAADDRESS_BUFF_ADD_Msk      (_UINT32_(0xFFFFFFFF) << USBHS_DEVDMAADDRESS_BUFF_ADD_Pos) /* (USBHS_DEVDMAADDRESS) Buffer Address Mask */
#define USBHS_DEVDMAADDRESS_BUFF_ADD(value)   (USBHS_DEVDMAADDRESS_BUFF_ADD_Msk & (_UINT32_(value) << USBHS_DEVDMAADDRESS_BUFF_ADD_Pos)) /* Assigment of value for BUFF_ADD in the USBHS_DEVDMAADDRESS register */
#define USBHS_DEVDMAADDRESS_Msk               _UINT32_(0xFFFFFFFF)                                 /* (USBHS_DEVDMAADDRESS) Register Mask  */


/* -------- USBHS_DEVDMACONTROL : (USBHS Offset: 0x08) (R/W 32) Device DMA Channel Control Register -------- */
#define USBHS_DEVDMACONTROL_CHANN_ENB_Pos     _UINT32_(0)                                          /* (USBHS_DEVDMACONTROL) Channel Enable Command Position */
#define USBHS_DEVDMACONTROL_CHANN_ENB_Msk     (_UINT32_(0x1) << USBHS_DEVDMACONTROL_CHANN_ENB_Pos) /* (USBHS_DEVDMACONTROL) Channel Enable Command Mask */
#define USBHS_DEVDMACONTROL_CHANN_ENB(value)  (USBHS_DEVDMACONTROL_CHANN_ENB_Msk & (_UINT32_(value) << USBHS_DEVDMACONTROL_CHANN_ENB_Pos)) /* Assigment of value for CHANN_ENB in the USBHS_DEVDMACONTROL register */
#define USBHS_DEVDMACONTROL_LDNXT_DSC_Pos     _UINT32_(1)                                          /* (USBHS_DEVDMACONTROL) Load Next Channel Transfer Descriptor Enable Command Position */
#define USBHS_DEVDMACONTROL_LDNXT_DSC_Msk     (_UINT32_(0x1) << USBHS_DEVDMACONTROL_LDNXT_DSC_Pos) /* (USBHS_DEVDMACONTROL) Load Next Channel Transfer Descriptor Enable Command Mask */
#define USBHS_DEVDMACONTROL_LDNXT_DSC(value)  (USBHS_DEVDMACONTROL_LDNXT_DSC_Msk & (_UINT32_(value) << USBHS_DEVDMACONTROL_LDNXT_DSC_Pos)) /* Assigment of value for LDNXT_DSC in the USBHS_DEVDMACONTROL register */
#define USBHS_DEVDMACONTROL_END_TR_EN_Pos     _UINT32_(2)                                          /* (USBHS_DEVDMACONTROL) End of Transfer Enable Control (OUT transfers only) Position */
#define USBHS_DEVDMACONTROL_END_TR_EN_Msk     (_UINT32_(0x1) << USBHS_DEVDMACONTROL_END_TR_EN_Pos) /* (USBHS_DEVDMACONTROL) End of Transfer Enable Control (OUT transfers only) Mask */
#define USBHS_DEVDMACONTROL_END_TR_EN(value)  (USBHS_DEVDMACONTROL_END_TR_EN_Msk & (_UINT32_(value) << USBHS_DEVDMACONTROL_END_TR_EN_Pos)) /* Assigment of value for END_TR_EN in the USBHS_DEVDMACONTROL register */
#define USBHS_DEVDMACONTROL_END_B_EN_Pos      _UINT32_(3)                                          /* (USBHS_DEVDMACONTROL) End of Buffer Enable Control Position */
#define USBHS_DEVDMACONTROL_END_B_EN_Msk      (_UINT32_(0x1) << USBHS_DEVDMACONTROL_END_B_EN_Pos)  /* (USBHS_DEVDMACONTROL) End of Buffer Enable Control Mask */
#define USBHS_DEVDMACONTROL_END_B_EN(value)   (USBHS_DEVDMACONTROL_END_B_EN_Msk & (_UINT32_(value) << USBHS_DEVDMACONTROL_END_B_EN_Pos)) /* Assigment of value for END_B_EN in the USBHS_DEVDMACONTROL register */
#define USBHS_DEVDMACONTROL_END_TR_IT_Pos     _UINT32_(4)                                          /* (USBHS_DEVDMACONTROL) End of Transfer Interrupt Enable Position */
#define USBHS_DEVDMACONTROL_END_TR_IT_Msk     (_UINT32_(0x1) << USBHS_DEVDMACONTROL_END_TR_IT_Pos) /* (USBHS_DEVDMACONTROL) End of Transfer Interrupt Enable Mask */
#define USBHS_DEVDMACONTROL_END_TR_IT(value)  (USBHS_DEVDMACONTROL_END_TR_IT_Msk & (_UINT32_(value) << USBHS_DEVDMACONTROL_END_TR_IT_Pos)) /* Assigment of value for END_TR_IT in the USBHS_DEVDMACONTROL register */
#define USBHS_DEVDMACONTROL_END_BUFFIT_Pos    _UINT32_(5)                                          /* (USBHS_DEVDMACONTROL) End of Buffer Interrupt Enable Position */
#define USBHS_DEVDMACONTROL_END_BUFFIT_Msk    (_UINT32_(0x1) << USBHS_DEVDMACONTROL_END_BUFFIT_Pos) /* (USBHS_DEVDMACONTROL) End of Buffer Interrupt Enable Mask */
#define USBHS_DEVDMACONTROL_END_BUFFIT(value) (USBHS_DEVDMACONTROL_END_BUFFIT_Msk & (_UINT32_(value) << USBHS_DEVDMACONTROL_END_BUFFIT_Pos)) /* Assigment of value for END_BUFFIT in the USBHS_DEVDMACONTROL register */
#define USBHS_DEVDMACONTROL_DESC_LD_IT_Pos    _UINT32_(6)                                          /* (USBHS_DEVDMACONTROL) Descriptor Loaded Interrupt Enable Position */
#define USBHS_DEVDMACONTROL_DESC_LD_IT_Msk    (_UINT32_(0x1) << USBHS_DEVDMACONTROL_DESC_LD_IT_Pos) /* (USBHS_DEVDMACONTROL) Descriptor Loaded Interrupt Enable Mask */
#define USBHS_DEVDMACONTROL_DESC_LD_IT(value) (USBHS_DEVDMACONTROL_DESC_LD_IT_Msk & (_UINT32_(value) << USBHS_DEVDMACONTROL_DESC_LD_IT_Pos)) /* Assigment of value for DESC_LD_IT in the USBHS_DEVDMACONTROL register */
#define USBHS_DEVDMACONTROL_BURST_LCK_Pos     _UINT32_(7)                                          /* (USBHS_DEVDMACONTROL) Burst Lock Enable Position */
#define USBHS_DEVDMACONTROL_BURST_LCK_Msk     (_UINT32_(0x1) << USBHS_DEVDMACONTROL_BURST_LCK_Pos) /* (USBHS_DEVDMACONTROL) Burst Lock Enable Mask */
#define USBHS_DEVDMACONTROL_BURST_LCK(value)  (USBHS_DEVDMACONTROL_BURST_LCK_Msk & (_UINT32_(value) << USBHS_DEVDMACONTROL_BURST_LCK_Pos)) /* Assigment of value for BURST_LCK in the USBHS_DEVDMACONTROL register */
#define USBHS_DEVDMACONTROL_BUFF_LENGTH_Pos   _UINT32_(16)                                         /* (USBHS_DEVDMACONTROL) Buffer Byte Length (Write-only) Position */
#define USBHS_DEVDMACONTROL_BUFF_LENGTH_Msk   (_UINT32_(0xFFFF) << USBHS_DEVDMACONTROL_BUFF_LENGTH_Pos) /* (USBHS_DEVDMACONTROL) Buffer Byte Length (Write-only) Mask */
#define USBHS_DEVDMACONTROL_BUFF_LENGTH(value) (USBHS_DEVDMACONTROL_BUFF_LENGTH_Msk & (_UINT32_(value) << USBHS_DEVDMACONTROL_BUFF_LENGTH_Pos)) /* Assigment of value for BUFF_LENGTH in the USBHS_DEVDMACONTROL register */
#define USBHS_DEVDMACONTROL_Msk               _UINT32_(0xFFFF00FF)                                 /* (USBHS_DEVDMACONTROL) Register Mask  */


/* -------- USBHS_DEVDMASTATUS : (USBHS Offset: 0x0C) (R/W 32) Device DMA Channel Status Register -------- */
#define USBHS_DEVDMASTATUS_CHANN_ENB_Pos      _UINT32_(0)                                          /* (USBHS_DEVDMASTATUS) Channel Enable Status Position */
#define USBHS_DEVDMASTATUS_CHANN_ENB_Msk      (_UINT32_(0x1) << USBHS_DEVDMASTATUS_CHANN_ENB_Pos)  /* (USBHS_DEVDMASTATUS) Channel Enable Status Mask */
#define USBHS_DEVDMASTATUS_CHANN_ENB(value)   (USBHS_DEVDMASTATUS_CHANN_ENB_Msk & (_UINT32_(value) << USBHS_DEVDMASTATUS_CHANN_ENB_Pos)) /* Assigment of value for CHANN_ENB in the USBHS_DEVDMASTATUS register */
#define USBHS_DEVDMASTATUS_CHANN_ACT_Pos      _UINT32_(1)                                          /* (USBHS_DEVDMASTATUS) Channel Active Status Position */
#define USBHS_DEVDMASTATUS_CHANN_ACT_Msk      (_UINT32_(0x1) << USBHS_DEVDMASTATUS_CHANN_ACT_Pos)  /* (USBHS_DEVDMASTATUS) Channel Active Status Mask */
#define USBHS_DEVDMASTATUS_CHANN_ACT(value)   (USBHS_DEVDMASTATUS_CHANN_ACT_Msk & (_UINT32_(value) << USBHS_DEVDMASTATUS_CHANN_ACT_Pos)) /* Assigment of value for CHANN_ACT in the USBHS_DEVDMASTATUS register */
#define USBHS_DEVDMASTATUS_END_TR_ST_Pos      _UINT32_(4)                                          /* (USBHS_DEVDMASTATUS) End of Channel Transfer Status Position */
#define USBHS_DEVDMASTATUS_END_TR_ST_Msk      (_UINT32_(0x1) << USBHS_DEVDMASTATUS_END_TR_ST_Pos)  /* (USBHS_DEVDMASTATUS) End of Channel Transfer Status Mask */
#define USBHS_DEVDMASTATUS_END_TR_ST(value)   (USBHS_DEVDMASTATUS_END_TR_ST_Msk & (_UINT32_(value) << USBHS_DEVDMASTATUS_END_TR_ST_Pos)) /* Assigment of value for END_TR_ST in the USBHS_DEVDMASTATUS register */
#define USBHS_DEVDMASTATUS_END_BF_ST_Pos      _UINT32_(5)                                          /* (USBHS_DEVDMASTATUS) End of Channel Buffer Status Position */
#define USBHS_DEVDMASTATUS_END_BF_ST_Msk      (_UINT32_(0x1) << USBHS_DEVDMASTATUS_END_BF_ST_Pos)  /* (USBHS_DEVDMASTATUS) End of Channel Buffer Status Mask */
#define USBHS_DEVDMASTATUS_END_BF_ST(value)   (USBHS_DEVDMASTATUS_END_BF_ST_Msk & (_UINT32_(value) << USBHS_DEVDMASTATUS_END_BF_ST_Pos)) /* Assigment of value for END_BF_ST in the USBHS_DEVDMASTATUS register */
#define USBHS_DEVDMASTATUS_DESC_LDST_Pos      _UINT32_(6)                                          /* (USBHS_DEVDMASTATUS) Descriptor Loaded Status Position */
#define USBHS_DEVDMASTATUS_DESC_LDST_Msk      (_UINT32_(0x1) << USBHS_DEVDMASTATUS_DESC_LDST_Pos)  /* (USBHS_DEVDMASTATUS) Descriptor Loaded Status Mask */
#define USBHS_DEVDMASTATUS_DESC_LDST(value)   (USBHS_DEVDMASTATUS_DESC_LDST_Msk & (_UINT32_(value) << USBHS_DEVDMASTATUS_DESC_LDST_Pos)) /* Assigment of value for DESC_LDST in the USBHS_DEVDMASTATUS register */
#define USBHS_DEVDMASTATUS_BUFF_COUNT_Pos     _UINT32_(16)                                         /* (USBHS_DEVDMASTATUS) Buffer Byte Count Position */
#define USBHS_DEVDMASTATUS_BUFF_COUNT_Msk     (_UINT32_(0xFFFF) << USBHS_DEVDMASTATUS_BUFF_COUNT_Pos) /* (USBHS_DEVDMASTATUS) Buffer Byte Count Mask */
#define USBHS_DEVDMASTATUS_BUFF_COUNT(value)  (USBHS_DEVDMASTATUS_BUFF_COUNT_Msk & (_UINT32_(value) << USBHS_DEVDMASTATUS_BUFF_COUNT_Pos)) /* Assigment of value for BUFF_COUNT in the USBHS_DEVDMASTATUS register */
#define USBHS_DEVDMASTATUS_Msk                _UINT32_(0xFFFF0073)                                 /* (USBHS_DEVDMASTATUS) Register Mask  */


/* -------- USBHS_HSTDMANXTDSC : (USBHS Offset: 0x00) (R/W 32) Host DMA Channel Next Descriptor Address Register -------- */
#define USBHS_HSTDMANXTDSC_NXT_DSC_ADD_Pos    _UINT32_(0)                                          /* (USBHS_HSTDMANXTDSC) Next Descriptor Address Position */
#define USBHS_HSTDMANXTDSC_NXT_DSC_ADD_Msk    (_UINT32_(0xFFFFFFFF) << USBHS_HSTDMANXTDSC_NXT_DSC_ADD_Pos) /* (USBHS_HSTDMANXTDSC) Next Descriptor Address Mask */
#define USBHS_HSTDMANXTDSC_NXT_DSC_ADD(value) (USBHS_HSTDMANXTDSC_NXT_DSC_ADD_Msk & (_UINT32_(value) << USBHS_HSTDMANXTDSC_NXT_DSC_ADD_Pos)) /* Assigment of value for NXT_DSC_ADD in the USBHS_HSTDMANXTDSC register */
#define USBHS_HSTDMANXTDSC_Msk                _UINT32_(0xFFFFFFFF)                                 /* (USBHS_HSTDMANXTDSC) Register Mask  */


/* -------- USBHS_HSTDMAADDRESS : (USBHS Offset: 0x04) (R/W 32) Host DMA Channel Address Register -------- */
#define USBHS_HSTDMAADDRESS_BUFF_ADD_Pos      _UINT32_(0)                                          /* (USBHS_HSTDMAADDRESS) Buffer Address Position */
#define USBHS_HSTDMAADDRESS_BUFF_ADD_Msk      (_UINT32_(0xFFFFFFFF) << USBHS_HSTDMAADDRESS_BUFF_ADD_Pos) /* (USBHS_HSTDMAADDRESS) Buffer Address Mask */
#define USBHS_HSTDMAADDRESS_BUFF_ADD(value)   (USBHS_HSTDMAADDRESS_BUFF_ADD_Msk & (_UINT32_(value) << USBHS_HSTDMAADDRESS_BUFF_ADD_Pos)) /* Assigment of value for BUFF_ADD in the USBHS_HSTDMAADDRESS register */
#define USBHS_HSTDMAADDRESS_Msk               _UINT32_(0xFFFFFFFF)                                 /* (USBHS_HSTDMAADDRESS) Register Mask  */


