Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/usbhs.h
/* -------- USBHS_HSTDMACONTROL : (USBHS Offset: 0x08) (R/W 32) Host DMA Channel Control Register -------- */
#define USBHS_HSTDMACONTROL_CHANN_ENB_Pos     _UINT32_(0)                                          /* (USBHS_HSTDMACONTROL) Channel Enable Command Position */
#define USBHS_HSTDMACONTROL_CHANN_ENB_Msk     (_UINT32_(0x1) << USBHS_HSTDMACONTROL_CHANN_ENB_Pos) /* (USBHS_HSTDMACONTROL) Channel Enable Command Mask */
#define USBHS_HSTDMACONTROL_CHANN_ENB(value)  (USBHS_HSTDMACONTROL_CHANN_ENB_Msk & (_UINT32_(value) << USBHS_HSTDMACONTROL_CHANN_ENB_Pos)) /* Assigment of value for CHANN_ENB in the USBHS_HSTDMACONTROL register */
#define USBHS_HSTDMACONTROL_LDNXT_DSC_Pos     _UINT32_(1)                                          /* (USBHS_HSTDMACONTROL) Load Next Channel Transfer Descriptor Enable Command Position */
#define USBHS_HSTDMACONTROL_LDNXT_DSC_Msk     (_UINT32_(0x1) << USBHS_HSTDMACONTROL_LDNXT_DSC_Pos) /* (USBHS_HSTDMACONTROL) Load Next Channel Transfer Descriptor Enable Command Mask */
#define USBHS_HSTDMACONTROL_LDNXT_DSC(value)  (USBHS_HSTDMACONTROL_LDNXT_DSC_Msk & (_UINT32_(value) << USBHS_HSTDMACONTROL_LDNXT_DSC_Pos)) /* Assigment of value for LDNXT_DSC in the USBHS_HSTDMACONTROL register */
#define USBHS_HSTDMACONTROL_END_TR_EN_Pos     _UINT32_(2)                                          /* (USBHS_HSTDMACONTROL) End of Transfer Enable Control (OUT transfers only) Position */
#define USBHS_HSTDMACONTROL_END_TR_EN_Msk     (_UINT32_(0x1) << USBHS_HSTDMACONTROL_END_TR_EN_Pos) /* (USBHS_HSTDMACONTROL) End of Transfer Enable Control (OUT transfers only) Mask */
#define USBHS_HSTDMACONTROL_END_TR_EN(value)  (USBHS_HSTDMACONTROL_END_TR_EN_Msk & (_UINT32_(value) << USBHS_HSTDMACONTROL_END_TR_EN_Pos)) /* Assigment of value for END_TR_EN in the USBHS_HSTDMACONTROL register */
#define USBHS_HSTDMACONTROL_END_B_EN_Pos      _UINT32_(3)                                          /* (USBHS_HSTDMACONTROL) End of Buffer Enable Control Position */
#define USBHS_HSTDMACONTROL_END_B_EN_Msk      (_UINT32_(0x1) << USBHS_HSTDMACONTROL_END_B_EN_Pos)  /* (USBHS_HSTDMACONTROL) End of Buffer Enable Control Mask */
#define USBHS_HSTDMACONTROL_END_B_EN(value)   (USBHS_HSTDMACONTROL_END_B_EN_Msk & (_UINT32_(value) << USBHS_HSTDMACONTROL_END_B_EN_Pos)) /* Assigment of value for END_B_EN in the USBHS_HSTDMACONTROL register */
#define USBHS_HSTDMACONTROL_END_TR_IT_Pos     _UINT32_(4)                                          /* (USBHS_HSTDMACONTROL) End of Transfer Interrupt Enable Position */
#define USBHS_HSTDMACONTROL_END_TR_IT_Msk     (_UINT32_(0x1) << USBHS_HSTDMACONTROL_END_TR_IT_Pos) /* (USBHS_HSTDMACONTROL) End of Transfer Interrupt Enable Mask */
#define USBHS_HSTDMACONTROL_END_TR_IT(value)  (USBHS_HSTDMACONTROL_END_TR_IT_Msk & (_UINT32_(value) << USBHS_HSTDMACONTROL_END_TR_IT_Pos)) /* Assigment of value for END_TR_IT in the USBHS_HSTDMACONTROL register */
#define USBHS_HSTDMACONTROL_END_BUFFIT_Pos    _UINT32_(5)                                          /* (USBHS_HSTDMACONTROL) End of Buffer Interrupt Enable Position */
#define USBHS_HSTDMACONTROL_END_BUFFIT_Msk    (_UINT32_(0x1) << USBHS_HSTDMACONTROL_END_BUFFIT_Pos) /* (USBHS_HSTDMACONTROL) End of Buffer Interrupt Enable Mask */
#define USBHS_HSTDMACONTROL_END_BUFFIT(value) (USBHS_HSTDMACONTROL_END_BUFFIT_Msk & (_UINT32_(value) << USBHS_HSTDMACONTROL_END_BUFFIT_Pos)) /* Assigment of value for END_BUFFIT in the USBHS_HSTDMACONTROL register */
#define USBHS_HSTDMACONTROL_DESC_LD_IT_Pos    _UINT32_(6)                                          /* (USBHS_HSTDMACONTROL) Descriptor Loaded Interrupt Enable Position */
#define USBHS_HSTDMACONTROL_DESC_LD_IT_Msk    (_UINT32_(0x1) << USBHS_HSTDMACONTROL_DESC_LD_IT_Pos) /* (USBHS_HSTDMACONTROL) Descriptor Loaded Interrupt Enable Mask */
#define USBHS_HSTDMACONTROL_DESC_LD_IT(value) (USBHS_HSTDMACONTROL_DESC_LD_IT_Msk & (_UINT32_(value) << USBHS_HSTDMACONTROL_DESC_LD_IT_Pos)) /* Assigment of value for DESC_LD_IT in the USBHS_HSTDMACONTROL register */
#define USBHS_HSTDMACONTROL_BURST_LCK_Pos     _UINT32_(7)                                          /* (USBHS_HSTDMACONTROL) Burst Lock Enable Position */
#define USBHS_HSTDMACONTROL_BURST_LCK_Msk     (_UINT32_(0x1) << USBHS_HSTDMACONTROL_BURST_LCK_Pos) /* (USBHS_HSTDMACONTROL) Burst Lock Enable Mask */
#define USBHS_HSTDMACONTROL_BURST_LCK(value)  (USBHS_HSTDMACONTROL_BURST_LCK_Msk & (_UINT32_(value) << USBHS_HSTDMACONTROL_BURST_LCK_Pos)) /* Assigment of value for BURST_LCK in the USBHS_HSTDMACONTROL register */
#define USBHS_HSTDMACONTROL_BUFF_LENGTH_Pos   _UINT32_(16)                                         /* (USBHS_HSTDMACONTROL) Buffer Byte Length (Write-only) Position */
#define USBHS_HSTDMACONTROL_BUFF_LENGTH_Msk   (_UINT32_(0xFFFF) << USBHS_HSTDMACONTROL_BUFF_LENGTH_Pos) /* (USBHS_HSTDMACONTROL) Buffer Byte Length (Write-only) Mask */
#define USBHS_HSTDMACONTROL_BUFF_LENGTH(value) (USBHS_HSTDMACONTROL_BUFF_LENGTH_Msk & (_UINT32_(value) << USBHS_HSTDMACONTROL_BUFF_LENGTH_Pos)) /* Assigment of value for BUFF_LENGTH in the USBHS_HSTDMACONTROL register */
#define USBHS_HSTDMACONTROL_Msk               _UINT32_(0xFFFF00FF)                                 /* (USBHS_HSTDMACONTROL) Register Mask  */


/* -------- USBHS_HSTDMASTATUS : (USBHS Offset: 0x0C) (R/W 32) Host DMA Channel Status Register -------- */
#define USBHS_HSTDMASTATUS_CHANN_ENB_Pos      _UINT32_(0)                                          /* (USBHS_HSTDMASTATUS) Channel Enable Status Position */
#define USBHS_HSTDMASTATUS_CHANN_ENB_Msk      (_UINT32_(0x1) << USBHS_HSTDMASTATUS_CHANN_ENB_Pos)  /* (USBHS_HSTDMASTATUS) Channel Enable Status Mask */
#define USBHS_HSTDMASTATUS_CHANN_ENB(value)   (USBHS_HSTDMASTATUS_CHANN_ENB_Msk & (_UINT32_(value) << USBHS_HSTDMASTATUS_CHANN_ENB_Pos)) /* Assigment of value for CHANN_ENB in the USBHS_HSTDMASTATUS register */
#define USBHS_HSTDMASTATUS_CHANN_ACT_Pos      _UINT32_(1)                                          /* (USBHS_HSTDMASTATUS) Channel Active Status Position */
#define USBHS_HSTDMASTATUS_CHANN_ACT_Msk      (_UINT32_(0x1) << USBHS_HSTDMASTATUS_CHANN_ACT_Pos)  /* (USBHS_HSTDMASTATUS) Channel Active Status Mask */
#define USBHS_HSTDMASTATUS_CHANN_ACT(value)   (USBHS_HSTDMASTATUS_CHANN_ACT_Msk & (_UINT32_(value) << USBHS_HSTDMASTATUS_CHANN_ACT_Pos)) /* Assigment of value for CHANN_ACT in the USBHS_HSTDMASTATUS register */
#define USBHS_HSTDMASTATUS_END_TR_ST_Pos      _UINT32_(4)                                          /* (USBHS_HSTDMASTATUS) End of Channel Transfer Status Position */
#define USBHS_HSTDMASTATUS_END_TR_ST_Msk      (_UINT32_(0x1) << USBHS_HSTDMASTATUS_END_TR_ST_Pos)  /* (USBHS_HSTDMASTATUS) End of Channel Transfer Status Mask */
#define USBHS_HSTDMASTATUS_END_TR_ST(value)   (USBHS_HSTDMASTATUS_END_TR_ST_Msk & (_UINT32_(value) << USBHS_HSTDMASTATUS_END_TR_ST_Pos)) /* Assigment of value for END_TR_ST in the USBHS_HSTDMASTATUS register */
#define USBHS_HSTDMASTATUS_END_BF_ST_Pos      _UINT32_(5)                                          /* (USBHS_HSTDMASTATUS) End of Channel Buffer Status Position */
#define USBHS_HSTDMASTATUS_END_BF_ST_Msk      (_UINT32_(0x1) << USBHS_HSTDMASTATUS_END_BF_ST_Pos)  /* (USBHS_HSTDMASTATUS) End of Channel Buffer Status Mask */
#define USBHS_HSTDMASTATUS_END_BF_ST(value)   (USBHS_HSTDMASTATUS_END_BF_ST_Msk & (_UINT32_(value) << USBHS_HSTDMASTATUS_END_BF_ST_Pos)) /* Assigment of value for END_BF_ST in the USBHS_HSTDMASTATUS register */
#define USBHS_HSTDMASTATUS_DESC_LDST_Pos      _UINT32_(6)                                          /* (USBHS_HSTDMASTATUS) Descriptor Loaded Status Position */
#define USBHS_HSTDMASTATUS_DESC_LDST_Msk      (_UINT32_(0x1) << USBHS_HSTDMASTATUS_DESC_LDST_Pos)  /* (USBHS_HSTDMASTATUS) Descriptor Loaded Status Mask */
#define USBHS_HSTDMASTATUS_DESC_LDST(value)   (USBHS_HSTDMASTATUS_DESC_LDST_Msk & (_UINT32_(value) << USBHS_HSTDMASTATUS_DESC_LDST_Pos)) /* Assigment of value for DESC_LDST in the USBHS_HSTDMASTATUS register */
#define USBHS_HSTDMASTATUS_BUFF_COUNT_Pos     _UINT32_(16)                                         /* (USBHS_HSTDMASTATUS) Buffer Byte Count Position */
#define USBHS_HSTDMASTATUS_BUFF_COUNT_Msk     (_UINT32_(0xFFFF) << USBHS_HSTDMASTATUS_BUFF_COUNT_Pos) /* (USBHS_HSTDMASTATUS) Buffer Byte Count Mask */
#define USBHS_HSTDMASTATUS_BUFF_COUNT(value)  (USBHS_HSTDMASTATUS_BUFF_COUNT_Msk & (_UINT32_(value) << USBHS_HSTDMASTATUS_BUFF_COUNT_Pos)) /* Assigment of value for BUFF_COUNT in the USBHS_HSTDMASTATUS register */
#define USBHS_HSTDMASTATUS_Msk                _UINT32_(0xFFFF0073)                                 /* (USBHS_HSTDMASTATUS) Register Mask  */


/* -------- USBHS_DEVCTRL : (USBHS Offset: 0x00) (R/W 32) Device General Control Register -------- */
#define USBHS_DEVCTRL_UADD_Pos                _UINT32_(0)                                          /* (USBHS_DEVCTRL) USB Address Position */
#define USBHS_DEVCTRL_UADD_Msk                (_UINT32_(0x7F) << USBHS_DEVCTRL_UADD_Pos)           /* (USBHS_DEVCTRL) USB Address Mask */
#define USBHS_DEVCTRL_UADD(value)             (USBHS_DEVCTRL_UADD_Msk & (_UINT32_(value) << USBHS_DEVCTRL_UADD_Pos)) /* Assigment of value for UADD in the USBHS_DEVCTRL register */
#define USBHS_DEVCTRL_ADDEN_Pos               _UINT32_(7)                                          /* (USBHS_DEVCTRL) Address Enable Position */
#define USBHS_DEVCTRL_ADDEN_Msk               (_UINT32_(0x1) << USBHS_DEVCTRL_ADDEN_Pos)           /* (USBHS_DEVCTRL) Address Enable Mask */
#define USBHS_DEVCTRL_ADDEN(value)            (USBHS_DEVCTRL_ADDEN_Msk & (_UINT32_(value) << USBHS_DEVCTRL_ADDEN_Pos)) /* Assigment of value for ADDEN in the USBHS_DEVCTRL register */
#define USBHS_DEVCTRL_DETACH_Pos              _UINT32_(8)                                          /* (USBHS_DEVCTRL) Detach Position */
#define USBHS_DEVCTRL_DETACH_Msk              (_UINT32_(0x1) << USBHS_DEVCTRL_DETACH_Pos)          /* (USBHS_DEVCTRL) Detach Mask */
#define USBHS_DEVCTRL_DETACH(value)           (USBHS_DEVCTRL_DETACH_Msk & (_UINT32_(value) << USBHS_DEVCTRL_DETACH_Pos)) /* Assigment of value for DETACH in the USBHS_DEVCTRL register */
#define USBHS_DEVCTRL_RMWKUP_Pos              _UINT32_(9)                                          /* (USBHS_DEVCTRL) Remote Wake-Up Position */
#define USBHS_DEVCTRL_RMWKUP_Msk              (_UINT32_(0x1) << USBHS_DEVCTRL_RMWKUP_Pos)          /* (USBHS_DEVCTRL) Remote Wake-Up Mask */
#define USBHS_DEVCTRL_RMWKUP(value)           (USBHS_DEVCTRL_RMWKUP_Msk & (_UINT32_(value) << USBHS_DEVCTRL_RMWKUP_Pos)) /* Assigment of value for RMWKUP in the USBHS_DEVCTRL register */
#define USBHS_DEVCTRL_SPDCONF_Pos             _UINT32_(10)                                         /* (USBHS_DEVCTRL) Mode Configuration Position */
#define USBHS_DEVCTRL_SPDCONF_Msk             (_UINT32_(0x3) << USBHS_DEVCTRL_SPDCONF_Pos)         /* (USBHS_DEVCTRL) Mode Configuration Mask */
#define USBHS_DEVCTRL_SPDCONF(value)          (USBHS_DEVCTRL_SPDCONF_Msk & (_UINT32_(value) << USBHS_DEVCTRL_SPDCONF_Pos)) /* Assigment of value for SPDCONF in the USBHS_DEVCTRL register */
#define   USBHS_DEVCTRL_SPDCONF_NORMAL_Val    _UINT32_(0x0)                                        /* (USBHS_DEVCTRL) The peripheral starts in Full-speed mode and performs a high-speed reset to switch to High-speed mode if the host is high-speed-capable.  */
#define   USBHS_DEVCTRL_SPDCONF_LOW_POWER_Val _UINT32_(0x1)                                        /* (USBHS_DEVCTRL) For a better consumption, if high speed is not needed.  */
#define   USBHS_DEVCTRL_SPDCONF_HIGH_SPEED_Val _UINT32_(0x2)                                        /* (USBHS_DEVCTRL) Forced high speed.  */
#define   USBHS_DEVCTRL_SPDCONF_FORCED_FS_Val _UINT32_(0x3)                                        /* (USBHS_DEVCTRL) The peripheral remains in Full-speed mode whatever the host speed capability.  */
#define USBHS_DEVCTRL_SPDCONF_NORMAL          (USBHS_DEVCTRL_SPDCONF_NORMAL_Val << USBHS_DEVCTRL_SPDCONF_Pos) /* (USBHS_DEVCTRL) The peripheral starts in Full-speed mode and performs a high-speed reset to switch to High-speed mode if the host is high-speed-capable. Position  */
#define USBHS_DEVCTRL_SPDCONF_LOW_POWER       (USBHS_DEVCTRL_SPDCONF_LOW_POWER_Val << USBHS_DEVCTRL_SPDCONF_Pos) /* (USBHS_DEVCTRL) For a better consumption, if high speed is not needed. Position  */
#define USBHS_DEVCTRL_SPDCONF_HIGH_SPEED      (USBHS_DEVCTRL_SPDCONF_HIGH_SPEED_Val << USBHS_DEVCTRL_SPDCONF_Pos) /* (USBHS_DEVCTRL) Forced high speed. Position  */
#define USBHS_DEVCTRL_SPDCONF_FORCED_FS       (USBHS_DEVCTRL_SPDCONF_FORCED_FS_Val << USBHS_DEVCTRL_SPDCONF_Pos) /* (USBHS_DEVCTRL) The peripheral remains in Full-speed mode whatever the host speed capability. Position  */
#define USBHS_DEVCTRL_LS_Pos                  _UINT32_(12)                                         /* (USBHS_DEVCTRL) Low-Speed Mode Force Position */
#define USBHS_DEVCTRL_LS_Msk                  (_UINT32_(0x1) << USBHS_DEVCTRL_LS_Pos)              /* (USBHS_DEVCTRL) Low-Speed Mode Force Mask */
#define USBHS_DEVCTRL_LS(value)               (USBHS_DEVCTRL_LS_Msk & (_UINT32_(value) << USBHS_DEVCTRL_LS_Pos)) /* Assigment of value for LS in the USBHS_DEVCTRL register */
#define USBHS_DEVCTRL_TSTJ_Pos                _UINT32_(13)                                         /* (USBHS_DEVCTRL) Test mode J Position */
#define USBHS_DEVCTRL_TSTJ_Msk                (_UINT32_(0x1) << USBHS_DEVCTRL_TSTJ_Pos)            /* (USBHS_DEVCTRL) Test mode J Mask */
#define USBHS_DEVCTRL_TSTJ(value)             (USBHS_DEVCTRL_TSTJ_Msk & (_UINT32_(value) << USBHS_DEVCTRL_TSTJ_Pos)) /* Assigment of value for TSTJ in the USBHS_DEVCTRL register */
#define USBHS_DEVCTRL_TSTK_Pos                _UINT32_(14)                                         /* (USBHS_DEVCTRL) Test mode K Position */
#define USBHS_DEVCTRL_TSTK_Msk                (_UINT32_(0x1) << USBHS_DEVCTRL_TSTK_Pos)            /* (USBHS_DEVCTRL) Test mode K Mask */
#define USBHS_DEVCTRL_TSTK(value)             (USBHS_DEVCTRL_TSTK_Msk & (_UINT32_(value) << USBHS_DEVCTRL_TSTK_Pos)) /* Assigment of value for TSTK in the USBHS_DEVCTRL register */
#define USBHS_DEVCTRL_TSTPCKT_Pos             _UINT32_(15)                                         /* (USBHS_DEVCTRL) Test packet mode Position */
#define USBHS_DEVCTRL_TSTPCKT_Msk             (_UINT32_(0x1) << USBHS_DEVCTRL_TSTPCKT_Pos)         /* (USBHS_DEVCTRL) Test packet mode Mask */
#define USBHS_DEVCTRL_TSTPCKT(value)          (USBHS_DEVCTRL_TSTPCKT_Msk & (_UINT32_(value) << USBHS_DEVCTRL_TSTPCKT_Pos)) /* Assigment of value for TSTPCKT in the USBHS_DEVCTRL register */
#define USBHS_DEVCTRL_OPMODE2_Pos             _UINT32_(16)                                         /* (USBHS_DEVCTRL) Specific Operational mode Position */
#define USBHS_DEVCTRL_OPMODE2_Msk             (_UINT32_(0x1) << USBHS_DEVCTRL_OPMODE2_Pos)         /* (USBHS_DEVCTRL) Specific Operational mode Mask */
#define USBHS_DEVCTRL_OPMODE2(value)          (USBHS_DEVCTRL_OPMODE2_Msk & (_UINT32_(value) << USBHS_DEVCTRL_OPMODE2_Pos)) /* Assigment of value for OPMODE2 in the USBHS_DEVCTRL register */
#define USBHS_DEVCTRL_Msk                     _UINT32_(0x0001FFFF)                                 /* (USBHS_DEVCTRL) Register Mask  */

#define USBHS_DEVCTRL_OPMODE_Pos              _UINT32_(16)                                         /* (USBHS_DEVCTRL Position) Specific Operational mode */
#define USBHS_DEVCTRL_OPMODE_Msk              (_UINT32_(0x1) << USBHS_DEVCTRL_OPMODE_Pos)          /* (USBHS_DEVCTRL Mask) OPMODE */
#define USBHS_DEVCTRL_OPMODE(value)           (USBHS_DEVCTRL_OPMODE_Msk & (_UINT32_(value) << USBHS_DEVCTRL_OPMODE_Pos)) 

