Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/usbhs.h
/* -------- USBHS_DEVISR : (USBHS Offset: 0x04) ( R/ 32) Device Global Interrupt Status Register -------- */
#define USBHS_DEVISR_SUSP_Pos                 _UINT32_(0)                                          /* (USBHS_DEVISR) Suspend Interrupt Position */
#define USBHS_DEVISR_SUSP_Msk                 (_UINT32_(0x1) << USBHS_DEVISR_SUSP_Pos)             /* (USBHS_DEVISR) Suspend Interrupt Mask */
#define USBHS_DEVISR_SUSP(value)              (USBHS_DEVISR_SUSP_Msk & (_UINT32_(value) << USBHS_DEVISR_SUSP_Pos)) /* Assigment of value for SUSP in the USBHS_DEVISR register */
#define USBHS_DEVISR_MSOF_Pos                 _UINT32_(1)                                          /* (USBHS_DEVISR) Micro Start of Frame Interrupt Position */
#define USBHS_DEVISR_MSOF_Msk                 (_UINT32_(0x1) << USBHS_DEVISR_MSOF_Pos)             /* (USBHS_DEVISR) Micro Start of Frame Interrupt Mask */
#define USBHS_DEVISR_MSOF(value)              (USBHS_DEVISR_MSOF_Msk & (_UINT32_(value) << USBHS_DEVISR_MSOF_Pos)) /* Assigment of value for MSOF in the USBHS_DEVISR register */
#define USBHS_DEVISR_SOF_Pos                  _UINT32_(2)                                          /* (USBHS_DEVISR) Start of Frame Interrupt Position */
#define USBHS_DEVISR_SOF_Msk                  (_UINT32_(0x1) << USBHS_DEVISR_SOF_Pos)              /* (USBHS_DEVISR) Start of Frame Interrupt Mask */
#define USBHS_DEVISR_SOF(value)               (USBHS_DEVISR_SOF_Msk & (_UINT32_(value) << USBHS_DEVISR_SOF_Pos)) /* Assigment of value for SOF in the USBHS_DEVISR register */
#define USBHS_DEVISR_EORST_Pos                _UINT32_(3)                                          /* (USBHS_DEVISR) End of Reset Interrupt Position */
#define USBHS_DEVISR_EORST_Msk                (_UINT32_(0x1) << USBHS_DEVISR_EORST_Pos)            /* (USBHS_DEVISR) End of Reset Interrupt Mask */
#define USBHS_DEVISR_EORST(value)             (USBHS_DEVISR_EORST_Msk & (_UINT32_(value) << USBHS_DEVISR_EORST_Pos)) /* Assigment of value for EORST in the USBHS_DEVISR register */
#define USBHS_DEVISR_WAKEUP_Pos               _UINT32_(4)                                          /* (USBHS_DEVISR) Wake-Up Interrupt Position */
#define USBHS_DEVISR_WAKEUP_Msk               (_UINT32_(0x1) << USBHS_DEVISR_WAKEUP_Pos)           /* (USBHS_DEVISR) Wake-Up Interrupt Mask */
#define USBHS_DEVISR_WAKEUP(value)            (USBHS_DEVISR_WAKEUP_Msk & (_UINT32_(value) << USBHS_DEVISR_WAKEUP_Pos)) /* Assigment of value for WAKEUP in the USBHS_DEVISR register */
#define USBHS_DEVISR_EORSM_Pos                _UINT32_(5)                                          /* (USBHS_DEVISR) End of Resume Interrupt Position */
#define USBHS_DEVISR_EORSM_Msk                (_UINT32_(0x1) << USBHS_DEVISR_EORSM_Pos)            /* (USBHS_DEVISR) End of Resume Interrupt Mask */
#define USBHS_DEVISR_EORSM(value)             (USBHS_DEVISR_EORSM_Msk & (_UINT32_(value) << USBHS_DEVISR_EORSM_Pos)) /* Assigment of value for EORSM in the USBHS_DEVISR register */
#define USBHS_DEVISR_UPRSM_Pos                _UINT32_(6)                                          /* (USBHS_DEVISR) Upstream Resume Interrupt Position */
#define USBHS_DEVISR_UPRSM_Msk                (_UINT32_(0x1) << USBHS_DEVISR_UPRSM_Pos)            /* (USBHS_DEVISR) Upstream Resume Interrupt Mask */
#define USBHS_DEVISR_UPRSM(value)             (USBHS_DEVISR_UPRSM_Msk & (_UINT32_(value) << USBHS_DEVISR_UPRSM_Pos)) /* Assigment of value for UPRSM in the USBHS_DEVISR register */
#define USBHS_DEVISR_PEP_0_Pos                _UINT32_(12)                                         /* (USBHS_DEVISR) Endpoint 0 Interrupt Position */
#define USBHS_DEVISR_PEP_0_Msk                (_UINT32_(0x1) << USBHS_DEVISR_PEP_0_Pos)            /* (USBHS_DEVISR) Endpoint 0 Interrupt Mask */
#define USBHS_DEVISR_PEP_0(value)             (USBHS_DEVISR_PEP_0_Msk & (_UINT32_(value) << USBHS_DEVISR_PEP_0_Pos)) /* Assigment of value for PEP_0 in the USBHS_DEVISR register */
#define USBHS_DEVISR_PEP_1_Pos                _UINT32_(13)                                         /* (USBHS_DEVISR) Endpoint 1 Interrupt Position */
#define USBHS_DEVISR_PEP_1_Msk                (_UINT32_(0x1) << USBHS_DEVISR_PEP_1_Pos)            /* (USBHS_DEVISR) Endpoint 1 Interrupt Mask */
#define USBHS_DEVISR_PEP_1(value)             (USBHS_DEVISR_PEP_1_Msk & (_UINT32_(value) << USBHS_DEVISR_PEP_1_Pos)) /* Assigment of value for PEP_1 in the USBHS_DEVISR register */
#define USBHS_DEVISR_PEP_2_Pos                _UINT32_(14)                                         /* (USBHS_DEVISR) Endpoint 2 Interrupt Position */
#define USBHS_DEVISR_PEP_2_Msk                (_UINT32_(0x1) << USBHS_DEVISR_PEP_2_Pos)            /* (USBHS_DEVISR) Endpoint 2 Interrupt Mask */
#define USBHS_DEVISR_PEP_2(value)             (USBHS_DEVISR_PEP_2_Msk & (_UINT32_(value) << USBHS_DEVISR_PEP_2_Pos)) /* Assigment of value for PEP_2 in the USBHS_DEVISR register */
#define USBHS_DEVISR_PEP_3_Pos                _UINT32_(15)                                         /* (USBHS_DEVISR) Endpoint 3 Interrupt Position */
#define USBHS_DEVISR_PEP_3_Msk                (_UINT32_(0x1) << USBHS_DEVISR_PEP_3_Pos)            /* (USBHS_DEVISR) Endpoint 3 Interrupt Mask */
#define USBHS_DEVISR_PEP_3(value)             (USBHS_DEVISR_PEP_3_Msk & (_UINT32_(value) << USBHS_DEVISR_PEP_3_Pos)) /* Assigment of value for PEP_3 in the USBHS_DEVISR register */
#define USBHS_DEVISR_PEP_4_Pos                _UINT32_(16)                                         /* (USBHS_DEVISR) Endpoint 4 Interrupt Position */
#define USBHS_DEVISR_PEP_4_Msk                (_UINT32_(0x1) << USBHS_DEVISR_PEP_4_Pos)            /* (USBHS_DEVISR) Endpoint 4 Interrupt Mask */
#define USBHS_DEVISR_PEP_4(value)             (USBHS_DEVISR_PEP_4_Msk & (_UINT32_(value) << USBHS_DEVISR_PEP_4_Pos)) /* Assigment of value for PEP_4 in the USBHS_DEVISR register */
#define USBHS_DEVISR_PEP_5_Pos                _UINT32_(17)                                         /* (USBHS_DEVISR) Endpoint 5 Interrupt Position */
#define USBHS_DEVISR_PEP_5_Msk                (_UINT32_(0x1) << USBHS_DEVISR_PEP_5_Pos)            /* (USBHS_DEVISR) Endpoint 5 Interrupt Mask */
#define USBHS_DEVISR_PEP_5(value)             (USBHS_DEVISR_PEP_5_Msk & (_UINT32_(value) << USBHS_DEVISR_PEP_5_Pos)) /* Assigment of value for PEP_5 in the USBHS_DEVISR register */
#define USBHS_DEVISR_PEP_6_Pos                _UINT32_(18)                                         /* (USBHS_DEVISR) Endpoint 6 Interrupt Position */
#define USBHS_DEVISR_PEP_6_Msk                (_UINT32_(0x1) << USBHS_DEVISR_PEP_6_Pos)            /* (USBHS_DEVISR) Endpoint 6 Interrupt Mask */
#define USBHS_DEVISR_PEP_6(value)             (USBHS_DEVISR_PEP_6_Msk & (_UINT32_(value) << USBHS_DEVISR_PEP_6_Pos)) /* Assigment of value for PEP_6 in the USBHS_DEVISR register */
#define USBHS_DEVISR_PEP_7_Pos                _UINT32_(19)                                         /* (USBHS_DEVISR) Endpoint 7 Interrupt Position */
#define USBHS_DEVISR_PEP_7_Msk                (_UINT32_(0x1) << USBHS_DEVISR_PEP_7_Pos)            /* (USBHS_DEVISR) Endpoint 7 Interrupt Mask */
#define USBHS_DEVISR_PEP_7(value)             (USBHS_DEVISR_PEP_7_Msk & (_UINT32_(value) << USBHS_DEVISR_PEP_7_Pos)) /* Assigment of value for PEP_7 in the USBHS_DEVISR register */
#define USBHS_DEVISR_PEP_8_Pos                _UINT32_(20)                                         /* (USBHS_DEVISR) Endpoint 8 Interrupt Position */
#define USBHS_DEVISR_PEP_8_Msk                (_UINT32_(0x1) << USBHS_DEVISR_PEP_8_Pos)            /* (USBHS_DEVISR) Endpoint 8 Interrupt Mask */
#define USBHS_DEVISR_PEP_8(value)             (USBHS_DEVISR_PEP_8_Msk & (_UINT32_(value) << USBHS_DEVISR_PEP_8_Pos)) /* Assigment of value for PEP_8 in the USBHS_DEVISR register */
#define USBHS_DEVISR_PEP_9_Pos                _UINT32_(21)                                         /* (USBHS_DEVISR) Endpoint 9 Interrupt Position */
#define USBHS_DEVISR_PEP_9_Msk                (_UINT32_(0x1) << USBHS_DEVISR_PEP_9_Pos)            /* (USBHS_DEVISR) Endpoint 9 Interrupt Mask */
#define USBHS_DEVISR_PEP_9(value)             (USBHS_DEVISR_PEP_9_Msk & (_UINT32_(value) << USBHS_DEVISR_PEP_9_Pos)) /* Assigment of value for PEP_9 in the USBHS_DEVISR register */
#define USBHS_DEVISR_DMA_1_Pos                _UINT32_(25)                                         /* (USBHS_DEVISR) DMA Channel 1 Interrupt Position */
#define USBHS_DEVISR_DMA_1_Msk                (_UINT32_(0x1) << USBHS_DEVISR_DMA_1_Pos)            /* (USBHS_DEVISR) DMA Channel 1 Interrupt Mask */
#define USBHS_DEVISR_DMA_1(value)             (USBHS_DEVISR_DMA_1_Msk & (_UINT32_(value) << USBHS_DEVISR_DMA_1_Pos)) /* Assigment of value for DMA_1 in the USBHS_DEVISR register */
#define USBHS_DEVISR_DMA_2_Pos                _UINT32_(26)                                         /* (USBHS_DEVISR) DMA Channel 2 Interrupt Position */
#define USBHS_DEVISR_DMA_2_Msk                (_UINT32_(0x1) << USBHS_DEVISR_DMA_2_Pos)            /* (USBHS_DEVISR) DMA Channel 2 Interrupt Mask */
#define USBHS_DEVISR_DMA_2(value)             (USBHS_DEVISR_DMA_2_Msk & (_UINT32_(value) << USBHS_DEVISR_DMA_2_Pos)) /* Assigment of value for DMA_2 in the USBHS_DEVISR register */
#define USBHS_DEVISR_DMA_3_Pos                _UINT32_(27)                                         /* (USBHS_DEVISR) DMA Channel 3 Interrupt Position */
#define USBHS_DEVISR_DMA_3_Msk                (_UINT32_(0x1) << USBHS_DEVISR_DMA_3_Pos)            /* (USBHS_DEVISR) DMA Channel 3 Interrupt Mask */
#define USBHS_DEVISR_DMA_3(value)             (USBHS_DEVISR_DMA_3_Msk & (_UINT32_(value) << USBHS_DEVISR_DMA_3_Pos)) /* Assigment of value for DMA_3 in the USBHS_DEVISR register */
#define USBHS_DEVISR_DMA_4_Pos                _UINT32_(28)                                         /* (USBHS_DEVISR) DMA Channel 4 Interrupt Position */
#define USBHS_DEVISR_DMA_4_Msk                (_UINT32_(0x1) << USBHS_DEVISR_DMA_4_Pos)            /* (USBHS_DEVISR) DMA Channel 4 Interrupt Mask */
#define USBHS_DEVISR_DMA_4(value)             (USBHS_DEVISR_DMA_4_Msk & (_UINT32_(value) << USBHS_DEVISR_DMA_4_Pos)) /* Assigment of value for DMA_4 in the USBHS_DEVISR register */
#define USBHS_DEVISR_DMA_5_Pos                _UINT32_(29)                                         /* (USBHS_DEVISR) DMA Channel 5 Interrupt Position */
#define USBHS_DEVISR_DMA_5_Msk                (_UINT32_(0x1) << USBHS_DEVISR_DMA_5_Pos)            /* (USBHS_DEVISR) DMA Channel 5 Interrupt Mask */
#define USBHS_DEVISR_DMA_5(value)             (USBHS_DEVISR_DMA_5_Msk & (_UINT32_(value) << USBHS_DEVISR_DMA_5_Pos)) /* Assigment of value for DMA_5 in the USBHS_DEVISR register */
#define USBHS_DEVISR_DMA_6_Pos                _UINT32_(30)                                         /* (USBHS_DEVISR) DMA Channel 6 Interrupt Position */
#define USBHS_DEVISR_DMA_6_Msk                (_UINT32_(0x1) << USBHS_DEVISR_DMA_6_Pos)            /* (USBHS_DEVISR) DMA Channel 6 Interrupt Mask */
#define USBHS_DEVISR_DMA_6(value)             (USBHS_DEVISR_DMA_6_Msk & (_UINT32_(value) << USBHS_DEVISR_DMA_6_Pos)) /* Assigment of value for DMA_6 in the USBHS_DEVISR register */
#define USBHS_DEVISR_DMA_7_Pos                _UINT32_(31)                                         /* (USBHS_DEVISR) DMA Channel 7 Interrupt Position */
#define USBHS_DEVISR_DMA_7_Msk                (_UINT32_(0x1) << USBHS_DEVISR_DMA_7_Pos)            /* (USBHS_DEVISR) DMA Channel 7 Interrupt Mask */
#define USBHS_DEVISR_DMA_7(value)             (USBHS_DEVISR_DMA_7_Msk & (_UINT32_(value) << USBHS_DEVISR_DMA_7_Pos)) /* Assigment of value for DMA_7 in the USBHS_DEVISR register */
#define USBHS_DEVISR_Msk                      _UINT32_(0xFE3FF07F)                                 /* (USBHS_DEVISR) Register Mask  */

