Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/usbhs.h
#define USBHS_DEVISR_PEP__Pos                 _UINT32_(12)                                         /* (USBHS_DEVISR Position) Endpoint x Interrupt */
#define USBHS_DEVISR_PEP__Msk                 (_UINT32_(0x3FF) << USBHS_DEVISR_PEP__Pos)           /* (USBHS_DEVISR Mask) PEP_ */
#define USBHS_DEVISR_PEP_(value)              (USBHS_DEVISR_PEP__Msk & (_UINT32_(value) << USBHS_DEVISR_PEP__Pos)) 
#define USBHS_DEVISR_DMA__Pos                 _UINT32_(25)                                         /* (USBHS_DEVISR Position) DMA Channel 7 Interrupt */
#define USBHS_DEVISR_DMA__Msk                 (_UINT32_(0x7F) << USBHS_DEVISR_DMA__Pos)            /* (USBHS_DEVISR Mask) DMA_ */
#define USBHS_DEVISR_DMA_(value)              (USBHS_DEVISR_DMA__Msk & (_UINT32_(value) << USBHS_DEVISR_DMA__Pos)) 

/* -------- USBHS_DEVICR : (USBHS Offset: 0x08) ( /W 32) Device Global Interrupt Clear Register -------- */
#define USBHS_DEVICR_SUSPC_Pos                _UINT32_(0)                                          /* (USBHS_DEVICR) Suspend Interrupt Clear Position */
#define USBHS_DEVICR_SUSPC_Msk                (_UINT32_(0x1) << USBHS_DEVICR_SUSPC_Pos)            /* (USBHS_DEVICR) Suspend Interrupt Clear Mask */
#define USBHS_DEVICR_SUSPC(value)             (USBHS_DEVICR_SUSPC_Msk & (_UINT32_(value) << USBHS_DEVICR_SUSPC_Pos)) /* Assigment of value for SUSPC in the USBHS_DEVICR register */
#define USBHS_DEVICR_MSOFC_Pos                _UINT32_(1)                                          /* (USBHS_DEVICR) Micro Start of Frame Interrupt Clear Position */
#define USBHS_DEVICR_MSOFC_Msk                (_UINT32_(0x1) << USBHS_DEVICR_MSOFC_Pos)            /* (USBHS_DEVICR) Micro Start of Frame Interrupt Clear Mask */
#define USBHS_DEVICR_MSOFC(value)             (USBHS_DEVICR_MSOFC_Msk & (_UINT32_(value) << USBHS_DEVICR_MSOFC_Pos)) /* Assigment of value for MSOFC in the USBHS_DEVICR register */
#define USBHS_DEVICR_SOFC_Pos                 _UINT32_(2)                                          /* (USBHS_DEVICR) Start of Frame Interrupt Clear Position */
#define USBHS_DEVICR_SOFC_Msk                 (_UINT32_(0x1) << USBHS_DEVICR_SOFC_Pos)             /* (USBHS_DEVICR) Start of Frame Interrupt Clear Mask */
#define USBHS_DEVICR_SOFC(value)              (USBHS_DEVICR_SOFC_Msk & (_UINT32_(value) << USBHS_DEVICR_SOFC_Pos)) /* Assigment of value for SOFC in the USBHS_DEVICR register */
#define USBHS_DEVICR_EORSTC_Pos               _UINT32_(3)                                          /* (USBHS_DEVICR) End of Reset Interrupt Clear Position */
#define USBHS_DEVICR_EORSTC_Msk               (_UINT32_(0x1) << USBHS_DEVICR_EORSTC_Pos)           /* (USBHS_DEVICR) End of Reset Interrupt Clear Mask */
#define USBHS_DEVICR_EORSTC(value)            (USBHS_DEVICR_EORSTC_Msk & (_UINT32_(value) << USBHS_DEVICR_EORSTC_Pos)) /* Assigment of value for EORSTC in the USBHS_DEVICR register */
#define USBHS_DEVICR_WAKEUPC_Pos              _UINT32_(4)                                          /* (USBHS_DEVICR) Wake-Up Interrupt Clear Position */
#define USBHS_DEVICR_WAKEUPC_Msk              (_UINT32_(0x1) << USBHS_DEVICR_WAKEUPC_Pos)          /* (USBHS_DEVICR) Wake-Up Interrupt Clear Mask */
#define USBHS_DEVICR_WAKEUPC(value)           (USBHS_DEVICR_WAKEUPC_Msk & (_UINT32_(value) << USBHS_DEVICR_WAKEUPC_Pos)) /* Assigment of value for WAKEUPC in the USBHS_DEVICR register */
#define USBHS_DEVICR_EORSMC_Pos               _UINT32_(5)                                          /* (USBHS_DEVICR) End of Resume Interrupt Clear Position */
#define USBHS_DEVICR_EORSMC_Msk               (_UINT32_(0x1) << USBHS_DEVICR_EORSMC_Pos)           /* (USBHS_DEVICR) End of Resume Interrupt Clear Mask */
#define USBHS_DEVICR_EORSMC(value)            (USBHS_DEVICR_EORSMC_Msk & (_UINT32_(value) << USBHS_DEVICR_EORSMC_Pos)) /* Assigment of value for EORSMC in the USBHS_DEVICR register */
#define USBHS_DEVICR_UPRSMC_Pos               _UINT32_(6)                                          /* (USBHS_DEVICR) Upstream Resume Interrupt Clear Position */
#define USBHS_DEVICR_UPRSMC_Msk               (_UINT32_(0x1) << USBHS_DEVICR_UPRSMC_Pos)           /* (USBHS_DEVICR) Upstream Resume Interrupt Clear Mask */
#define USBHS_DEVICR_UPRSMC(value)            (USBHS_DEVICR_UPRSMC_Msk & (_UINT32_(value) << USBHS_DEVICR_UPRSMC_Pos)) /* Assigment of value for UPRSMC in the USBHS_DEVICR register */
#define USBHS_DEVICR_Msk                      _UINT32_(0x0000007F)                                 /* (USBHS_DEVICR) Register Mask  */


/* -------- USBHS_DEVIFR : (USBHS Offset: 0x0C) ( /W 32) Device Global Interrupt Set Register -------- */
#define USBHS_DEVIFR_SUSPS_Pos                _UINT32_(0)                                          /* (USBHS_DEVIFR) Suspend Interrupt Set Position */
#define USBHS_DEVIFR_SUSPS_Msk                (_UINT32_(0x1) << USBHS_DEVIFR_SUSPS_Pos)            /* (USBHS_DEVIFR) Suspend Interrupt Set Mask */
#define USBHS_DEVIFR_SUSPS(value)             (USBHS_DEVIFR_SUSPS_Msk & (_UINT32_(value) << USBHS_DEVIFR_SUSPS_Pos)) /* Assigment of value for SUSPS in the USBHS_DEVIFR register */
#define USBHS_DEVIFR_MSOFS_Pos                _UINT32_(1)                                          /* (USBHS_DEVIFR) Micro Start of Frame Interrupt Set Position */
#define USBHS_DEVIFR_MSOFS_Msk                (_UINT32_(0x1) << USBHS_DEVIFR_MSOFS_Pos)            /* (USBHS_DEVIFR) Micro Start of Frame Interrupt Set Mask */
#define USBHS_DEVIFR_MSOFS(value)             (USBHS_DEVIFR_MSOFS_Msk & (_UINT32_(value) << USBHS_DEVIFR_MSOFS_Pos)) /* Assigment of value for MSOFS in the USBHS_DEVIFR register */
#define USBHS_DEVIFR_SOFS_Pos                 _UINT32_(2)                                          /* (USBHS_DEVIFR) Start of Frame Interrupt Set Position */
#define USBHS_DEVIFR_SOFS_Msk                 (_UINT32_(0x1) << USBHS_DEVIFR_SOFS_Pos)             /* (USBHS_DEVIFR) Start of Frame Interrupt Set Mask */
#define USBHS_DEVIFR_SOFS(value)              (USBHS_DEVIFR_SOFS_Msk & (_UINT32_(value) << USBHS_DEVIFR_SOFS_Pos)) /* Assigment of value for SOFS in the USBHS_DEVIFR register */
#define USBHS_DEVIFR_EORSTS_Pos               _UINT32_(3)                                          /* (USBHS_DEVIFR) End of Reset Interrupt Set Position */
#define USBHS_DEVIFR_EORSTS_Msk               (_UINT32_(0x1) << USBHS_DEVIFR_EORSTS_Pos)           /* (USBHS_DEVIFR) End of Reset Interrupt Set Mask */
#define USBHS_DEVIFR_EORSTS(value)            (USBHS_DEVIFR_EORSTS_Msk & (_UINT32_(value) << USBHS_DEVIFR_EORSTS_Pos)) /* Assigment of value for EORSTS in the USBHS_DEVIFR register */
#define USBHS_DEVIFR_WAKEUPS_Pos              _UINT32_(4)                                          /* (USBHS_DEVIFR) Wake-Up Interrupt Set Position */
#define USBHS_DEVIFR_WAKEUPS_Msk              (_UINT32_(0x1) << USBHS_DEVIFR_WAKEUPS_Pos)          /* (USBHS_DEVIFR) Wake-Up Interrupt Set Mask */
#define USBHS_DEVIFR_WAKEUPS(value)           (USBHS_DEVIFR_WAKEUPS_Msk & (_UINT32_(value) << USBHS_DEVIFR_WAKEUPS_Pos)) /* Assigment of value for WAKEUPS in the USBHS_DEVIFR register */
#define USBHS_DEVIFR_EORSMS_Pos               _UINT32_(5)                                          /* (USBHS_DEVIFR) End of Resume Interrupt Set Position */
#define USBHS_DEVIFR_EORSMS_Msk               (_UINT32_(0x1) << USBHS_DEVIFR_EORSMS_Pos)           /* (USBHS_DEVIFR) End of Resume Interrupt Set Mask */
#define USBHS_DEVIFR_EORSMS(value)            (USBHS_DEVIFR_EORSMS_Msk & (_UINT32_(value) << USBHS_DEVIFR_EORSMS_Pos)) /* Assigment of value for EORSMS in the USBHS_DEVIFR register */
#define USBHS_DEVIFR_UPRSMS_Pos               _UINT32_(6)                                          /* (USBHS_DEVIFR) Upstream Resume Interrupt Set Position */
#define USBHS_DEVIFR_UPRSMS_Msk               (_UINT32_(0x1) << USBHS_DEVIFR_UPRSMS_Pos)           /* (USBHS_DEVIFR) Upstream Resume Interrupt Set Mask */
#define USBHS_DEVIFR_UPRSMS(value)            (USBHS_DEVIFR_UPRSMS_Msk & (_UINT32_(value) << USBHS_DEVIFR_UPRSMS_Pos)) /* Assigment of value for UPRSMS in the USBHS_DEVIFR register */
#define USBHS_DEVIFR_DMA_1_Pos                _UINT32_(25)                                         /* (USBHS_DEVIFR) DMA Channel 1 Interrupt Set Position */
#define USBHS_DEVIFR_DMA_1_Msk                (_UINT32_(0x1) << USBHS_DEVIFR_DMA_1_Pos)            /* (USBHS_DEVIFR) DMA Channel 1 Interrupt Set Mask */
#define USBHS_DEVIFR_DMA_1(value)             (USBHS_DEVIFR_DMA_1_Msk & (_UINT32_(value) << USBHS_DEVIFR_DMA_1_Pos)) /* Assigment of value for DMA_1 in the USBHS_DEVIFR register */
#define USBHS_DEVIFR_DMA_2_Pos                _UINT32_(26)                                         /* (USBHS_DEVIFR) DMA Channel 2 Interrupt Set Position */
#define USBHS_DEVIFR_DMA_2_Msk                (_UINT32_(0x1) << USBHS_DEVIFR_DMA_2_Pos)            /* (USBHS_DEVIFR) DMA Channel 2 Interrupt Set Mask */
#define USBHS_DEVIFR_DMA_2(value)             (USBHS_DEVIFR_DMA_2_Msk & (_UINT32_(value) << USBHS_DEVIFR_DMA_2_Pos)) /* Assigment of value for DMA_2 in the USBHS_DEVIFR register */
#define USBHS_DEVIFR_DMA_3_Pos                _UINT32_(27)                                         /* (USBHS_DEVIFR) DMA Channel 3 Interrupt Set Position */
#define USBHS_DEVIFR_DMA_3_Msk                (_UINT32_(0x1) << USBHS_DEVIFR_DMA_3_Pos)            /* (USBHS_DEVIFR) DMA Channel 3 Interrupt Set Mask */
#define USBHS_DEVIFR_DMA_3(value)             (USBHS_DEVIFR_DMA_3_Msk & (_UINT32_(value) << USBHS_DEVIFR_DMA_3_Pos)) /* Assigment of value for DMA_3 in the USBHS_DEVIFR register */
#define USBHS_DEVIFR_DMA_4_Pos                _UINT32_(28)                                         /* (USBHS_DEVIFR) DMA Channel 4 Interrupt Set Position */
#define USBHS_DEVIFR_DMA_4_Msk                (_UINT32_(0x1) << USBHS_DEVIFR_DMA_4_Pos)            /* (USBHS_DEVIFR) DMA Channel 4 Interrupt Set Mask */
#define USBHS_DEVIFR_DMA_4(value)             (USBHS_DEVIFR_DMA_4_Msk & (_UINT32_(value) << USBHS_DEVIFR_DMA_4_Pos)) /* Assigment of value for DMA_4 in the USBHS_DEVIFR register */
#define USBHS_DEVIFR_DMA_5_Pos                _UINT32_(29)                                         /* (USBHS_DEVIFR) DMA Channel 5 Interrupt Set Position */
#define USBHS_DEVIFR_DMA_5_Msk                (_UINT32_(0x1) << USBHS_DEVIFR_DMA_5_Pos)            /* (USBHS_DEVIFR) DMA Channel 5 Interrupt Set Mask */
#define USBHS_DEVIFR_DMA_5(value)             (USBHS_DEVIFR_DMA_5_Msk & (_UINT32_(value) << USBHS_DEVIFR_DMA_5_Pos)) /* Assigment of value for DMA_5 in the USBHS_DEVIFR register */
#define USBHS_DEVIFR_DMA_6_Pos                _UINT32_(30)                                         /* (USBHS_DEVIFR) DMA Channel 6 Interrupt Set Position */
#define USBHS_DEVIFR_DMA_6_Msk                (_UINT32_(0x1) << USBHS_DEVIFR_DMA_6_Pos)            /* (USBHS_DEVIFR) DMA Channel 6 Interrupt Set Mask */
#define USBHS_DEVIFR_DMA_6(value)             (USBHS_DEVIFR_DMA_6_Msk & (_UINT32_(value) << USBHS_DEVIFR_DMA_6_Pos)) /* Assigment of value for DMA_6 in the USBHS_DEVIFR register */
#define USBHS_DEVIFR_DMA_7_Pos                _UINT32_(31)                                         /* (USBHS_DEVIFR) DMA Channel 7 Interrupt Set Position */
#define USBHS_DEVIFR_DMA_7_Msk                (_UINT32_(0x1) << USBHS_DEVIFR_DMA_7_Pos)            /* (USBHS_DEVIFR) DMA Channel 7 Interrupt Set Mask */
#define USBHS_DEVIFR_DMA_7(value)             (USBHS_DEVIFR_DMA_7_Msk & (_UINT32_(value) << USBHS_DEVIFR_DMA_7_Pos)) /* Assigment of value for DMA_7 in the USBHS_DEVIFR register */
#define USBHS_DEVIFR_Msk                      _UINT32_(0xFE00007F)                                 /* (USBHS_DEVIFR) Register Mask  */

#define USBHS_DEVIFR_DMA__Pos                 _UINT32_(25)                                         /* (USBHS_DEVIFR Position) DMA Channel 7 Interrupt Set */
#define USBHS_DEVIFR_DMA__Msk                 (_UINT32_(0x7F) << USBHS_DEVIFR_DMA__Pos)            /* (USBHS_DEVIFR Mask) DMA_ */
#define USBHS_DEVIFR_DMA_(value)              (USBHS_DEVIFR_DMA__Msk & (_UINT32_(value) << USBHS_DEVIFR_DMA__Pos)) 

