Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/usbhs.h
/* -------- USBHS_DEVIMR : (USBHS Offset: 0x10) ( R/ 32) Device Global Interrupt Mask Register -------- */
#define USBHS_DEVIMR_SUSPE_Pos                _UINT32_(0)                                          /* (USBHS_DEVIMR) Suspend Interrupt Mask Position */
#define USBHS_DEVIMR_SUSPE_Msk                (_UINT32_(0x1) << USBHS_DEVIMR_SUSPE_Pos)            /* (USBHS_DEVIMR) Suspend Interrupt Mask Mask */
#define USBHS_DEVIMR_SUSPE(value)             (USBHS_DEVIMR_SUSPE_Msk & (_UINT32_(value) << USBHS_DEVIMR_SUSPE_Pos)) /* Assigment of value for SUSPE in the USBHS_DEVIMR register */
#define USBHS_DEVIMR_MSOFE_Pos                _UINT32_(1)                                          /* (USBHS_DEVIMR) Micro Start of Frame Interrupt Mask Position */
#define USBHS_DEVIMR_MSOFE_Msk                (_UINT32_(0x1) << USBHS_DEVIMR_MSOFE_Pos)            /* (USBHS_DEVIMR) Micro Start of Frame Interrupt Mask Mask */
#define USBHS_DEVIMR_MSOFE(value)             (USBHS_DEVIMR_MSOFE_Msk & (_UINT32_(value) << USBHS_DEVIMR_MSOFE_Pos)) /* Assigment of value for MSOFE in the USBHS_DEVIMR register */
#define USBHS_DEVIMR_SOFE_Pos                 _UINT32_(2)                                          /* (USBHS_DEVIMR) Start of Frame Interrupt Mask Position */
#define USBHS_DEVIMR_SOFE_Msk                 (_UINT32_(0x1) << USBHS_DEVIMR_SOFE_Pos)             /* (USBHS_DEVIMR) Start of Frame Interrupt Mask Mask */
#define USBHS_DEVIMR_SOFE(value)              (USBHS_DEVIMR_SOFE_Msk & (_UINT32_(value) << USBHS_DEVIMR_SOFE_Pos)) /* Assigment of value for SOFE in the USBHS_DEVIMR register */
#define USBHS_DEVIMR_EORSTE_Pos               _UINT32_(3)                                          /* (USBHS_DEVIMR) End of Reset Interrupt Mask Position */
#define USBHS_DEVIMR_EORSTE_Msk               (_UINT32_(0x1) << USBHS_DEVIMR_EORSTE_Pos)           /* (USBHS_DEVIMR) End of Reset Interrupt Mask Mask */
#define USBHS_DEVIMR_EORSTE(value)            (USBHS_DEVIMR_EORSTE_Msk & (_UINT32_(value) << USBHS_DEVIMR_EORSTE_Pos)) /* Assigment of value for EORSTE in the USBHS_DEVIMR register */
#define USBHS_DEVIMR_WAKEUPE_Pos              _UINT32_(4)                                          /* (USBHS_DEVIMR) Wake-Up Interrupt Mask Position */
#define USBHS_DEVIMR_WAKEUPE_Msk              (_UINT32_(0x1) << USBHS_DEVIMR_WAKEUPE_Pos)          /* (USBHS_DEVIMR) Wake-Up Interrupt Mask Mask */
#define USBHS_DEVIMR_WAKEUPE(value)           (USBHS_DEVIMR_WAKEUPE_Msk & (_UINT32_(value) << USBHS_DEVIMR_WAKEUPE_Pos)) /* Assigment of value for WAKEUPE in the USBHS_DEVIMR register */
#define USBHS_DEVIMR_EORSME_Pos               _UINT32_(5)                                          /* (USBHS_DEVIMR) End of Resume Interrupt Mask Position */
#define USBHS_DEVIMR_EORSME_Msk               (_UINT32_(0x1) << USBHS_DEVIMR_EORSME_Pos)           /* (USBHS_DEVIMR) End of Resume Interrupt Mask Mask */
#define USBHS_DEVIMR_EORSME(value)            (USBHS_DEVIMR_EORSME_Msk & (_UINT32_(value) << USBHS_DEVIMR_EORSME_Pos)) /* Assigment of value for EORSME in the USBHS_DEVIMR register */
#define USBHS_DEVIMR_UPRSME_Pos               _UINT32_(6)                                          /* (USBHS_DEVIMR) Upstream Resume Interrupt Mask Position */
#define USBHS_DEVIMR_UPRSME_Msk               (_UINT32_(0x1) << USBHS_DEVIMR_UPRSME_Pos)           /* (USBHS_DEVIMR) Upstream Resume Interrupt Mask Mask */
#define USBHS_DEVIMR_UPRSME(value)            (USBHS_DEVIMR_UPRSME_Msk & (_UINT32_(value) << USBHS_DEVIMR_UPRSME_Pos)) /* Assigment of value for UPRSME in the USBHS_DEVIMR register */
#define USBHS_DEVIMR_PEP_0_Pos                _UINT32_(12)                                         /* (USBHS_DEVIMR) Endpoint 0 Interrupt Mask Position */
#define USBHS_DEVIMR_PEP_0_Msk                (_UINT32_(0x1) << USBHS_DEVIMR_PEP_0_Pos)            /* (USBHS_DEVIMR) Endpoint 0 Interrupt Mask Mask */
#define USBHS_DEVIMR_PEP_0(value)             (USBHS_DEVIMR_PEP_0_Msk & (_UINT32_(value) << USBHS_DEVIMR_PEP_0_Pos)) /* Assigment of value for PEP_0 in the USBHS_DEVIMR register */
#define USBHS_DEVIMR_PEP_1_Pos                _UINT32_(13)                                         /* (USBHS_DEVIMR) Endpoint 1 Interrupt Mask Position */
#define USBHS_DEVIMR_PEP_1_Msk                (_UINT32_(0x1) << USBHS_DEVIMR_PEP_1_Pos)            /* (USBHS_DEVIMR) Endpoint 1 Interrupt Mask Mask */
#define USBHS_DEVIMR_PEP_1(value)             (USBHS_DEVIMR_PEP_1_Msk & (_UINT32_(value) << USBHS_DEVIMR_PEP_1_Pos)) /* Assigment of value for PEP_1 in the USBHS_DEVIMR register */
#define USBHS_DEVIMR_PEP_2_Pos                _UINT32_(14)                                         /* (USBHS_DEVIMR) Endpoint 2 Interrupt Mask Position */
#define USBHS_DEVIMR_PEP_2_Msk                (_UINT32_(0x1) << USBHS_DEVIMR_PEP_2_Pos)            /* (USBHS_DEVIMR) Endpoint 2 Interrupt Mask Mask */
#define USBHS_DEVIMR_PEP_2(value)             (USBHS_DEVIMR_PEP_2_Msk & (_UINT32_(value) << USBHS_DEVIMR_PEP_2_Pos)) /* Assigment of value for PEP_2 in the USBHS_DEVIMR register */
#define USBHS_DEVIMR_PEP_3_Pos                _UINT32_(15)                                         /* (USBHS_DEVIMR) Endpoint 3 Interrupt Mask Position */
#define USBHS_DEVIMR_PEP_3_Msk                (_UINT32_(0x1) << USBHS_DEVIMR_PEP_3_Pos)            /* (USBHS_DEVIMR) Endpoint 3 Interrupt Mask Mask */
#define USBHS_DEVIMR_PEP_3(value)             (USBHS_DEVIMR_PEP_3_Msk & (_UINT32_(value) << USBHS_DEVIMR_PEP_3_Pos)) /* Assigment of value for PEP_3 in the USBHS_DEVIMR register */
#define USBHS_DEVIMR_PEP_4_Pos                _UINT32_(16)                                         /* (USBHS_DEVIMR) Endpoint 4 Interrupt Mask Position */
#define USBHS_DEVIMR_PEP_4_Msk                (_UINT32_(0x1) << USBHS_DEVIMR_PEP_4_Pos)            /* (USBHS_DEVIMR) Endpoint 4 Interrupt Mask Mask */
#define USBHS_DEVIMR_PEP_4(value)             (USBHS_DEVIMR_PEP_4_Msk & (_UINT32_(value) << USBHS_DEVIMR_PEP_4_Pos)) /* Assigment of value for PEP_4 in the USBHS_DEVIMR register */
#define USBHS_DEVIMR_PEP_5_Pos                _UINT32_(17)                                         /* (USBHS_DEVIMR) Endpoint 5 Interrupt Mask Position */
#define USBHS_DEVIMR_PEP_5_Msk                (_UINT32_(0x1) << USBHS_DEVIMR_PEP_5_Pos)            /* (USBHS_DEVIMR) Endpoint 5 Interrupt Mask Mask */
#define USBHS_DEVIMR_PEP_5(value)             (USBHS_DEVIMR_PEP_5_Msk & (_UINT32_(value) << USBHS_DEVIMR_PEP_5_Pos)) /* Assigment of value for PEP_5 in the USBHS_DEVIMR register */
#define USBHS_DEVIMR_PEP_6_Pos                _UINT32_(18)                                         /* (USBHS_DEVIMR) Endpoint 6 Interrupt Mask Position */
#define USBHS_DEVIMR_PEP_6_Msk                (_UINT32_(0x1) << USBHS_DEVIMR_PEP_6_Pos)            /* (USBHS_DEVIMR) Endpoint 6 Interrupt Mask Mask */
#define USBHS_DEVIMR_PEP_6(value)             (USBHS_DEVIMR_PEP_6_Msk & (_UINT32_(value) << USBHS_DEVIMR_PEP_6_Pos)) /* Assigment of value for PEP_6 in the USBHS_DEVIMR register */
#define USBHS_DEVIMR_PEP_7_Pos                _UINT32_(19)                                         /* (USBHS_DEVIMR) Endpoint 7 Interrupt Mask Position */
#define USBHS_DEVIMR_PEP_7_Msk                (_UINT32_(0x1) << USBHS_DEVIMR_PEP_7_Pos)            /* (USBHS_DEVIMR) Endpoint 7 Interrupt Mask Mask */
#define USBHS_DEVIMR_PEP_7(value)             (USBHS_DEVIMR_PEP_7_Msk & (_UINT32_(value) << USBHS_DEVIMR_PEP_7_Pos)) /* Assigment of value for PEP_7 in the USBHS_DEVIMR register */
#define USBHS_DEVIMR_PEP_8_Pos                _UINT32_(20)                                         /* (USBHS_DEVIMR) Endpoint 8 Interrupt Mask Position */
#define USBHS_DEVIMR_PEP_8_Msk                (_UINT32_(0x1) << USBHS_DEVIMR_PEP_8_Pos)            /* (USBHS_DEVIMR) Endpoint 8 Interrupt Mask Mask */
#define USBHS_DEVIMR_PEP_8(value)             (USBHS_DEVIMR_PEP_8_Msk & (_UINT32_(value) << USBHS_DEVIMR_PEP_8_Pos)) /* Assigment of value for PEP_8 in the USBHS_DEVIMR register */
#define USBHS_DEVIMR_PEP_9_Pos                _UINT32_(21)                                         /* (USBHS_DEVIMR) Endpoint 9 Interrupt Mask Position */
#define USBHS_DEVIMR_PEP_9_Msk                (_UINT32_(0x1) << USBHS_DEVIMR_PEP_9_Pos)            /* (USBHS_DEVIMR) Endpoint 9 Interrupt Mask Mask */
#define USBHS_DEVIMR_PEP_9(value)             (USBHS_DEVIMR_PEP_9_Msk & (_UINT32_(value) << USBHS_DEVIMR_PEP_9_Pos)) /* Assigment of value for PEP_9 in the USBHS_DEVIMR register */
#define USBHS_DEVIMR_DMA_1_Pos                _UINT32_(25)                                         /* (USBHS_DEVIMR) DMA Channel 1 Interrupt Mask Position */
#define USBHS_DEVIMR_DMA_1_Msk                (_UINT32_(0x1) << USBHS_DEVIMR_DMA_1_Pos)            /* (USBHS_DEVIMR) DMA Channel 1 Interrupt Mask Mask */
#define USBHS_DEVIMR_DMA_1(value)             (USBHS_DEVIMR_DMA_1_Msk & (_UINT32_(value) << USBHS_DEVIMR_DMA_1_Pos)) /* Assigment of value for DMA_1 in the USBHS_DEVIMR register */
#define USBHS_DEVIMR_DMA_2_Pos                _UINT32_(26)                                         /* (USBHS_DEVIMR) DMA Channel 2 Interrupt Mask Position */
#define USBHS_DEVIMR_DMA_2_Msk                (_UINT32_(0x1) << USBHS_DEVIMR_DMA_2_Pos)            /* (USBHS_DEVIMR) DMA Channel 2 Interrupt Mask Mask */
#define USBHS_DEVIMR_DMA_2(value)             (USBHS_DEVIMR_DMA_2_Msk & (_UINT32_(value) << USBHS_DEVIMR_DMA_2_Pos)) /* Assigment of value for DMA_2 in the USBHS_DEVIMR register */
#define USBHS_DEVIMR_DMA_3_Pos                _UINT32_(27)                                         /* (USBHS_DEVIMR) DMA Channel 3 Interrupt Mask Position */
#define USBHS_DEVIMR_DMA_3_Msk                (_UINT32_(0x1) << USBHS_DEVIMR_DMA_3_Pos)            /* (USBHS_DEVIMR) DMA Channel 3 Interrupt Mask Mask */
#define USBHS_DEVIMR_DMA_3(value)             (USBHS_DEVIMR_DMA_3_Msk & (_UINT32_(value) << USBHS_DEVIMR_DMA_3_Pos)) /* Assigment of value for DMA_3 in the USBHS_DEVIMR register */
#define USBHS_DEVIMR_DMA_4_Pos                _UINT32_(28)                                         /* (USBHS_DEVIMR) DMA Channel 4 Interrupt Mask Position */
#define USBHS_DEVIMR_DMA_4_Msk                (_UINT32_(0x1) << USBHS_DEVIMR_DMA_4_Pos)            /* (USBHS_DEVIMR) DMA Channel 4 Interrupt Mask Mask */
#define USBHS_DEVIMR_DMA_4(value)             (USBHS_DEVIMR_DMA_4_Msk & (_UINT32_(value) << USBHS_DEVIMR_DMA_4_Pos)) /* Assigment of value for DMA_4 in the USBHS_DEVIMR register */
#define USBHS_DEVIMR_DMA_5_Pos                _UINT32_(29)                                         /* (USBHS_DEVIMR) DMA Channel 5 Interrupt Mask Position */
#define USBHS_DEVIMR_DMA_5_Msk                (_UINT32_(0x1) << USBHS_DEVIMR_DMA_5_Pos)            /* (USBHS_DEVIMR) DMA Channel 5 Interrupt Mask Mask */
#define USBHS_DEVIMR_DMA_5(value)             (USBHS_DEVIMR_DMA_5_Msk & (_UINT32_(value) << USBHS_DEVIMR_DMA_5_Pos)) /* Assigment of value for DMA_5 in the USBHS_DEVIMR register */
#define USBHS_DEVIMR_DMA_6_Pos                _UINT32_(30)                                         /* (USBHS_DEVIMR) DMA Channel 6 Interrupt Mask Position */
#define USBHS_DEVIMR_DMA_6_Msk                (_UINT32_(0x1) << USBHS_DEVIMR_DMA_6_Pos)            /* (USBHS_DEVIMR) DMA Channel 6 Interrupt Mask Mask */
#define USBHS_DEVIMR_DMA_6(value)             (USBHS_DEVIMR_DMA_6_Msk & (_UINT32_(value) << USBHS_DEVIMR_DMA_6_Pos)) /* Assigment of value for DMA_6 in the USBHS_DEVIMR register */
#define USBHS_DEVIMR_DMA_7_Pos                _UINT32_(31)                                         /* (USBHS_DEVIMR) DMA Channel 7 Interrupt Mask Position */
#define USBHS_DEVIMR_DMA_7_Msk                (_UINT32_(0x1) << USBHS_DEVIMR_DMA_7_Pos)            /* (USBHS_DEVIMR) DMA Channel 7 Interrupt Mask Mask */
#define USBHS_DEVIMR_DMA_7(value)             (USBHS_DEVIMR_DMA_7_Msk & (_UINT32_(value) << USBHS_DEVIMR_DMA_7_Pos)) /* Assigment of value for DMA_7 in the USBHS_DEVIMR register */
#define USBHS_DEVIMR_Msk                      _UINT32_(0xFE3FF07F)                                 /* (USBHS_DEVIMR) Register Mask  */

#define USBHS_DEVIMR_PEP__Pos                 _UINT32_(12)                                         /* (USBHS_DEVIMR Position) Endpoint x Interrupt Mask */
#define USBHS_DEVIMR_PEP__Msk                 (_UINT32_(0x3FF) << USBHS_DEVIMR_PEP__Pos)           /* (USBHS_DEVIMR Mask) PEP_ */
#define USBHS_DEVIMR_PEP_(value)              (USBHS_DEVIMR_PEP__Msk & (_UINT32_(value) << USBHS_DEVIMR_PEP__Pos)) 
#define USBHS_DEVIMR_DMA__Pos                 _UINT32_(25)                                         /* (USBHS_DEVIMR Position) DMA Channel 7 Interrupt Mask */
#define USBHS_DEVIMR_DMA__Msk                 (_UINT32_(0x7F) << USBHS_DEVIMR_DMA__Pos)            /* (USBHS_DEVIMR Mask) DMA_ */
#define USBHS_DEVIMR_DMA_(value)              (USBHS_DEVIMR_DMA__Msk & (_UINT32_(value) << USBHS_DEVIMR_DMA__Pos)) 

