Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/usbhs.h
/* -------- USBHS_DEVIDR : (USBHS Offset: 0x14) ( /W 32) Device Global Interrupt Disable Register -------- */
#define USBHS_DEVIDR_SUSPEC_Pos               _UINT32_(0)                                          /* (USBHS_DEVIDR) Suspend Interrupt Disable Position */
#define USBHS_DEVIDR_SUSPEC_Msk               (_UINT32_(0x1) << USBHS_DEVIDR_SUSPEC_Pos)           /* (USBHS_DEVIDR) Suspend Interrupt Disable Mask */
#define USBHS_DEVIDR_SUSPEC(value)            (USBHS_DEVIDR_SUSPEC_Msk & (_UINT32_(value) << USBHS_DEVIDR_SUSPEC_Pos)) /* Assigment of value for SUSPEC in the USBHS_DEVIDR register */
#define USBHS_DEVIDR_MSOFEC_Pos               _UINT32_(1)                                          /* (USBHS_DEVIDR) Micro Start of Frame Interrupt Disable Position */
#define USBHS_DEVIDR_MSOFEC_Msk               (_UINT32_(0x1) << USBHS_DEVIDR_MSOFEC_Pos)           /* (USBHS_DEVIDR) Micro Start of Frame Interrupt Disable Mask */
#define USBHS_DEVIDR_MSOFEC(value)            (USBHS_DEVIDR_MSOFEC_Msk & (_UINT32_(value) << USBHS_DEVIDR_MSOFEC_Pos)) /* Assigment of value for MSOFEC in the USBHS_DEVIDR register */
#define USBHS_DEVIDR_SOFEC_Pos                _UINT32_(2)                                          /* (USBHS_DEVIDR) Start of Frame Interrupt Disable Position */
#define USBHS_DEVIDR_SOFEC_Msk                (_UINT32_(0x1) << USBHS_DEVIDR_SOFEC_Pos)            /* (USBHS_DEVIDR) Start of Frame Interrupt Disable Mask */
#define USBHS_DEVIDR_SOFEC(value)             (USBHS_DEVIDR_SOFEC_Msk & (_UINT32_(value) << USBHS_DEVIDR_SOFEC_Pos)) /* Assigment of value for SOFEC in the USBHS_DEVIDR register */
#define USBHS_DEVIDR_EORSTEC_Pos              _UINT32_(3)                                          /* (USBHS_DEVIDR) End of Reset Interrupt Disable Position */
#define USBHS_DEVIDR_EORSTEC_Msk              (_UINT32_(0x1) << USBHS_DEVIDR_EORSTEC_Pos)          /* (USBHS_DEVIDR) End of Reset Interrupt Disable Mask */
#define USBHS_DEVIDR_EORSTEC(value)           (USBHS_DEVIDR_EORSTEC_Msk & (_UINT32_(value) << USBHS_DEVIDR_EORSTEC_Pos)) /* Assigment of value for EORSTEC in the USBHS_DEVIDR register */
#define USBHS_DEVIDR_WAKEUPEC_Pos             _UINT32_(4)                                          /* (USBHS_DEVIDR) Wake-Up Interrupt Disable Position */
#define USBHS_DEVIDR_WAKEUPEC_Msk             (_UINT32_(0x1) << USBHS_DEVIDR_WAKEUPEC_Pos)         /* (USBHS_DEVIDR) Wake-Up Interrupt Disable Mask */
#define USBHS_DEVIDR_WAKEUPEC(value)          (USBHS_DEVIDR_WAKEUPEC_Msk & (_UINT32_(value) << USBHS_DEVIDR_WAKEUPEC_Pos)) /* Assigment of value for WAKEUPEC in the USBHS_DEVIDR register */
#define USBHS_DEVIDR_EORSMEC_Pos              _UINT32_(5)                                          /* (USBHS_DEVIDR) End of Resume Interrupt Disable Position */
#define USBHS_DEVIDR_EORSMEC_Msk              (_UINT32_(0x1) << USBHS_DEVIDR_EORSMEC_Pos)          /* (USBHS_DEVIDR) End of Resume Interrupt Disable Mask */
#define USBHS_DEVIDR_EORSMEC(value)           (USBHS_DEVIDR_EORSMEC_Msk & (_UINT32_(value) << USBHS_DEVIDR_EORSMEC_Pos)) /* Assigment of value for EORSMEC in the USBHS_DEVIDR register */
#define USBHS_DEVIDR_UPRSMEC_Pos              _UINT32_(6)                                          /* (USBHS_DEVIDR) Upstream Resume Interrupt Disable Position */
#define USBHS_DEVIDR_UPRSMEC_Msk              (_UINT32_(0x1) << USBHS_DEVIDR_UPRSMEC_Pos)          /* (USBHS_DEVIDR) Upstream Resume Interrupt Disable Mask */
#define USBHS_DEVIDR_UPRSMEC(value)           (USBHS_DEVIDR_UPRSMEC_Msk & (_UINT32_(value) << USBHS_DEVIDR_UPRSMEC_Pos)) /* Assigment of value for UPRSMEC in the USBHS_DEVIDR register */
#define USBHS_DEVIDR_PEP_0_Pos                _UINT32_(12)                                         /* (USBHS_DEVIDR) Endpoint 0 Interrupt Disable Position */
#define USBHS_DEVIDR_PEP_0_Msk                (_UINT32_(0x1) << USBHS_DEVIDR_PEP_0_Pos)            /* (USBHS_DEVIDR) Endpoint 0 Interrupt Disable Mask */
#define USBHS_DEVIDR_PEP_0(value)             (USBHS_DEVIDR_PEP_0_Msk & (_UINT32_(value) << USBHS_DEVIDR_PEP_0_Pos)) /* Assigment of value for PEP_0 in the USBHS_DEVIDR register */
#define USBHS_DEVIDR_PEP_1_Pos                _UINT32_(13)                                         /* (USBHS_DEVIDR) Endpoint 1 Interrupt Disable Position */
#define USBHS_DEVIDR_PEP_1_Msk                (_UINT32_(0x1) << USBHS_DEVIDR_PEP_1_Pos)            /* (USBHS_DEVIDR) Endpoint 1 Interrupt Disable Mask */
#define USBHS_DEVIDR_PEP_1(value)             (USBHS_DEVIDR_PEP_1_Msk & (_UINT32_(value) << USBHS_DEVIDR_PEP_1_Pos)) /* Assigment of value for PEP_1 in the USBHS_DEVIDR register */
#define USBHS_DEVIDR_PEP_2_Pos                _UINT32_(14)                                         /* (USBHS_DEVIDR) Endpoint 2 Interrupt Disable Position */
#define USBHS_DEVIDR_PEP_2_Msk                (_UINT32_(0x1) << USBHS_DEVIDR_PEP_2_Pos)            /* (USBHS_DEVIDR) Endpoint 2 Interrupt Disable Mask */
#define USBHS_DEVIDR_PEP_2(value)             (USBHS_DEVIDR_PEP_2_Msk & (_UINT32_(value) << USBHS_DEVIDR_PEP_2_Pos)) /* Assigment of value for PEP_2 in the USBHS_DEVIDR register */
#define USBHS_DEVIDR_PEP_3_Pos                _UINT32_(15)                                         /* (USBHS_DEVIDR) Endpoint 3 Interrupt Disable Position */
#define USBHS_DEVIDR_PEP_3_Msk                (_UINT32_(0x1) << USBHS_DEVIDR_PEP_3_Pos)            /* (USBHS_DEVIDR) Endpoint 3 Interrupt Disable Mask */
#define USBHS_DEVIDR_PEP_3(value)             (USBHS_DEVIDR_PEP_3_Msk & (_UINT32_(value) << USBHS_DEVIDR_PEP_3_Pos)) /* Assigment of value for PEP_3 in the USBHS_DEVIDR register */
#define USBHS_DEVIDR_PEP_4_Pos                _UINT32_(16)                                         /* (USBHS_DEVIDR) Endpoint 4 Interrupt Disable Position */
#define USBHS_DEVIDR_PEP_4_Msk                (_UINT32_(0x1) << USBHS_DEVIDR_PEP_4_Pos)            /* (USBHS_DEVIDR) Endpoint 4 Interrupt Disable Mask */
#define USBHS_DEVIDR_PEP_4(value)             (USBHS_DEVIDR_PEP_4_Msk & (_UINT32_(value) << USBHS_DEVIDR_PEP_4_Pos)) /* Assigment of value for PEP_4 in the USBHS_DEVIDR register */
#define USBHS_DEVIDR_PEP_5_Pos                _UINT32_(17)                                         /* (USBHS_DEVIDR) Endpoint 5 Interrupt Disable Position */
#define USBHS_DEVIDR_PEP_5_Msk                (_UINT32_(0x1) << USBHS_DEVIDR_PEP_5_Pos)            /* (USBHS_DEVIDR) Endpoint 5 Interrupt Disable Mask */
#define USBHS_DEVIDR_PEP_5(value)             (USBHS_DEVIDR_PEP_5_Msk & (_UINT32_(value) << USBHS_DEVIDR_PEP_5_Pos)) /* Assigment of value for PEP_5 in the USBHS_DEVIDR register */
#define USBHS_DEVIDR_PEP_6_Pos                _UINT32_(18)                                         /* (USBHS_DEVIDR) Endpoint 6 Interrupt Disable Position */
#define USBHS_DEVIDR_PEP_6_Msk                (_UINT32_(0x1) << USBHS_DEVIDR_PEP_6_Pos)            /* (USBHS_DEVIDR) Endpoint 6 Interrupt Disable Mask */
#define USBHS_DEVIDR_PEP_6(value)             (USBHS_DEVIDR_PEP_6_Msk & (_UINT32_(value) << USBHS_DEVIDR_PEP_6_Pos)) /* Assigment of value for PEP_6 in the USBHS_DEVIDR register */
#define USBHS_DEVIDR_PEP_7_Pos                _UINT32_(19)                                         /* (USBHS_DEVIDR) Endpoint 7 Interrupt Disable Position */
#define USBHS_DEVIDR_PEP_7_Msk                (_UINT32_(0x1) << USBHS_DEVIDR_PEP_7_Pos)            /* (USBHS_DEVIDR) Endpoint 7 Interrupt Disable Mask */
#define USBHS_DEVIDR_PEP_7(value)             (USBHS_DEVIDR_PEP_7_Msk & (_UINT32_(value) << USBHS_DEVIDR_PEP_7_Pos)) /* Assigment of value for PEP_7 in the USBHS_DEVIDR register */
#define USBHS_DEVIDR_PEP_8_Pos                _UINT32_(20)                                         /* (USBHS_DEVIDR) Endpoint 8 Interrupt Disable Position */
#define USBHS_DEVIDR_PEP_8_Msk                (_UINT32_(0x1) << USBHS_DEVIDR_PEP_8_Pos)            /* (USBHS_DEVIDR) Endpoint 8 Interrupt Disable Mask */
#define USBHS_DEVIDR_PEP_8(value)             (USBHS_DEVIDR_PEP_8_Msk & (_UINT32_(value) << USBHS_DEVIDR_PEP_8_Pos)) /* Assigment of value for PEP_8 in the USBHS_DEVIDR register */
#define USBHS_DEVIDR_PEP_9_Pos                _UINT32_(21)                                         /* (USBHS_DEVIDR) Endpoint 9 Interrupt Disable Position */
#define USBHS_DEVIDR_PEP_9_Msk                (_UINT32_(0x1) << USBHS_DEVIDR_PEP_9_Pos)            /* (USBHS_DEVIDR) Endpoint 9 Interrupt Disable Mask */
#define USBHS_DEVIDR_PEP_9(value)             (USBHS_DEVIDR_PEP_9_Msk & (_UINT32_(value) << USBHS_DEVIDR_PEP_9_Pos)) /* Assigment of value for PEP_9 in the USBHS_DEVIDR register */
#define USBHS_DEVIDR_DMA_1_Pos                _UINT32_(25)                                         /* (USBHS_DEVIDR) DMA Channel 1 Interrupt Disable Position */
#define USBHS_DEVIDR_DMA_1_Msk                (_UINT32_(0x1) << USBHS_DEVIDR_DMA_1_Pos)            /* (USBHS_DEVIDR) DMA Channel 1 Interrupt Disable Mask */
#define USBHS_DEVIDR_DMA_1(value)             (USBHS_DEVIDR_DMA_1_Msk & (_UINT32_(value) << USBHS_DEVIDR_DMA_1_Pos)) /* Assigment of value for DMA_1 in the USBHS_DEVIDR register */
#define USBHS_DEVIDR_DMA_2_Pos                _UINT32_(26)                                         /* (USBHS_DEVIDR) DMA Channel 2 Interrupt Disable Position */
#define USBHS_DEVIDR_DMA_2_Msk                (_UINT32_(0x1) << USBHS_DEVIDR_DMA_2_Pos)            /* (USBHS_DEVIDR) DMA Channel 2 Interrupt Disable Mask */
#define USBHS_DEVIDR_DMA_2(value)             (USBHS_DEVIDR_DMA_2_Msk & (_UINT32_(value) << USBHS_DEVIDR_DMA_2_Pos)) /* Assigment of value for DMA_2 in the USBHS_DEVIDR register */
#define USBHS_DEVIDR_DMA_3_Pos                _UINT32_(27)                                         /* (USBHS_DEVIDR) DMA Channel 3 Interrupt Disable Position */
#define USBHS_DEVIDR_DMA_3_Msk                (_UINT32_(0x1) << USBHS_DEVIDR_DMA_3_Pos)            /* (USBHS_DEVIDR) DMA Channel 3 Interrupt Disable Mask */
#define USBHS_DEVIDR_DMA_3(value)             (USBHS_DEVIDR_DMA_3_Msk & (_UINT32_(value) << USBHS_DEVIDR_DMA_3_Pos)) /* Assigment of value for DMA_3 in the USBHS_DEVIDR register */
#define USBHS_DEVIDR_DMA_4_Pos                _UINT32_(28)                                         /* (USBHS_DEVIDR) DMA Channel 4 Interrupt Disable Position */
#define USBHS_DEVIDR_DMA_4_Msk                (_UINT32_(0x1) << USBHS_DEVIDR_DMA_4_Pos)            /* (USBHS_DEVIDR) DMA Channel 4 Interrupt Disable Mask */
#define USBHS_DEVIDR_DMA_4(value)             (USBHS_DEVIDR_DMA_4_Msk & (_UINT32_(value) << USBHS_DEVIDR_DMA_4_Pos)) /* Assigment of value for DMA_4 in the USBHS_DEVIDR register */
#define USBHS_DEVIDR_DMA_5_Pos                _UINT32_(29)                                         /* (USBHS_DEVIDR) DMA Channel 5 Interrupt Disable Position */
#define USBHS_DEVIDR_DMA_5_Msk                (_UINT32_(0x1) << USBHS_DEVIDR_DMA_5_Pos)            /* (USBHS_DEVIDR) DMA Channel 5 Interrupt Disable Mask */
#define USBHS_DEVIDR_DMA_5(value)             (USBHS_DEVIDR_DMA_5_Msk & (_UINT32_(value) << USBHS_DEVIDR_DMA_5_Pos)) /* Assigment of value for DMA_5 in the USBHS_DEVIDR register */
#define USBHS_DEVIDR_DMA_6_Pos                _UINT32_(30)                                         /* (USBHS_DEVIDR) DMA Channel 6 Interrupt Disable Position */
#define USBHS_DEVIDR_DMA_6_Msk                (_UINT32_(0x1) << USBHS_DEVIDR_DMA_6_Pos)            /* (USBHS_DEVIDR) DMA Channel 6 Interrupt Disable Mask */
#define USBHS_DEVIDR_DMA_6(value)             (USBHS_DEVIDR_DMA_6_Msk & (_UINT32_(value) << USBHS_DEVIDR_DMA_6_Pos)) /* Assigment of value for DMA_6 in the USBHS_DEVIDR register */
#define USBHS_DEVIDR_DMA_7_Pos                _UINT32_(31)                                         /* (USBHS_DEVIDR) DMA Channel 7 Interrupt Disable Position */
#define USBHS_DEVIDR_DMA_7_Msk                (_UINT32_(0x1) << USBHS_DEVIDR_DMA_7_Pos)            /* (USBHS_DEVIDR) DMA Channel 7 Interrupt Disable Mask */
#define USBHS_DEVIDR_DMA_7(value)             (USBHS_DEVIDR_DMA_7_Msk & (_UINT32_(value) << USBHS_DEVIDR_DMA_7_Pos)) /* Assigment of value for DMA_7 in the USBHS_DEVIDR register */
#define USBHS_DEVIDR_Msk                      _UINT32_(0xFE3FF07F)                                 /* (USBHS_DEVIDR) Register Mask  */

#define USBHS_DEVIDR_PEP__Pos                 _UINT32_(12)                                         /* (USBHS_DEVIDR Position) Endpoint x Interrupt Disable */
#define USBHS_DEVIDR_PEP__Msk                 (_UINT32_(0x3FF) << USBHS_DEVIDR_PEP__Pos)           /* (USBHS_DEVIDR Mask) PEP_ */
#define USBHS_DEVIDR_PEP_(value)              (USBHS_DEVIDR_PEP__Msk & (_UINT32_(value) << USBHS_DEVIDR_PEP__Pos)) 
#define USBHS_DEVIDR_DMA__Pos                 _UINT32_(25)                                         /* (USBHS_DEVIDR Position) DMA Channel 7 Interrupt Disable */
#define USBHS_DEVIDR_DMA__Msk                 (_UINT32_(0x7F) << USBHS_DEVIDR_DMA__Pos)            /* (USBHS_DEVIDR Mask) DMA_ */
#define USBHS_DEVIDR_DMA_(value)              (USBHS_DEVIDR_DMA__Msk & (_UINT32_(value) << USBHS_DEVIDR_DMA__Pos)) 

