Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/usbhs.h
/* -------- USBHS_DEVIER : (USBHS Offset: 0x18) ( /W 32) Device Global Interrupt Enable Register -------- */
#define USBHS_DEVIER_SUSPES_Pos               _UINT32_(0)                                          /* (USBHS_DEVIER) Suspend Interrupt Enable Position */
#define USBHS_DEVIER_SUSPES_Msk               (_UINT32_(0x1) << USBHS_DEVIER_SUSPES_Pos)           /* (USBHS_DEVIER) Suspend Interrupt Enable Mask */
#define USBHS_DEVIER_SUSPES(value)            (USBHS_DEVIER_SUSPES_Msk & (_UINT32_(value) << USBHS_DEVIER_SUSPES_Pos)) /* Assigment of value for SUSPES in the USBHS_DEVIER register */
#define USBHS_DEVIER_MSOFES_Pos               _UINT32_(1)                                          /* (USBHS_DEVIER) Micro Start of Frame Interrupt Enable Position */
#define USBHS_DEVIER_MSOFES_Msk               (_UINT32_(0x1) << USBHS_DEVIER_MSOFES_Pos)           /* (USBHS_DEVIER) Micro Start of Frame Interrupt Enable Mask */
#define USBHS_DEVIER_MSOFES(value)            (USBHS_DEVIER_MSOFES_Msk & (_UINT32_(value) << USBHS_DEVIER_MSOFES_Pos)) /* Assigment of value for MSOFES in the USBHS_DEVIER register */
#define USBHS_DEVIER_SOFES_Pos                _UINT32_(2)                                          /* (USBHS_DEVIER) Start of Frame Interrupt Enable Position */
#define USBHS_DEVIER_SOFES_Msk                (_UINT32_(0x1) << USBHS_DEVIER_SOFES_Pos)            /* (USBHS_DEVIER) Start of Frame Interrupt Enable Mask */
#define USBHS_DEVIER_SOFES(value)             (USBHS_DEVIER_SOFES_Msk & (_UINT32_(value) << USBHS_DEVIER_SOFES_Pos)) /* Assigment of value for SOFES in the USBHS_DEVIER register */
#define USBHS_DEVIER_EORSTES_Pos              _UINT32_(3)                                          /* (USBHS_DEVIER) End of Reset Interrupt Enable Position */
#define USBHS_DEVIER_EORSTES_Msk              (_UINT32_(0x1) << USBHS_DEVIER_EORSTES_Pos)          /* (USBHS_DEVIER) End of Reset Interrupt Enable Mask */
#define USBHS_DEVIER_EORSTES(value)           (USBHS_DEVIER_EORSTES_Msk & (_UINT32_(value) << USBHS_DEVIER_EORSTES_Pos)) /* Assigment of value for EORSTES in the USBHS_DEVIER register */
#define USBHS_DEVIER_WAKEUPES_Pos             _UINT32_(4)                                          /* (USBHS_DEVIER) Wake-Up Interrupt Enable Position */
#define USBHS_DEVIER_WAKEUPES_Msk             (_UINT32_(0x1) << USBHS_DEVIER_WAKEUPES_Pos)         /* (USBHS_DEVIER) Wake-Up Interrupt Enable Mask */
#define USBHS_DEVIER_WAKEUPES(value)          (USBHS_DEVIER_WAKEUPES_Msk & (_UINT32_(value) << USBHS_DEVIER_WAKEUPES_Pos)) /* Assigment of value for WAKEUPES in the USBHS_DEVIER register */
#define USBHS_DEVIER_EORSMES_Pos              _UINT32_(5)                                          /* (USBHS_DEVIER) End of Resume Interrupt Enable Position */
#define USBHS_DEVIER_EORSMES_Msk              (_UINT32_(0x1) << USBHS_DEVIER_EORSMES_Pos)          /* (USBHS_DEVIER) End of Resume Interrupt Enable Mask */
#define USBHS_DEVIER_EORSMES(value)           (USBHS_DEVIER_EORSMES_Msk & (_UINT32_(value) << USBHS_DEVIER_EORSMES_Pos)) /* Assigment of value for EORSMES in the USBHS_DEVIER register */
#define USBHS_DEVIER_UPRSMES_Pos              _UINT32_(6)                                          /* (USBHS_DEVIER) Upstream Resume Interrupt Enable Position */
#define USBHS_DEVIER_UPRSMES_Msk              (_UINT32_(0x1) << USBHS_DEVIER_UPRSMES_Pos)          /* (USBHS_DEVIER) Upstream Resume Interrupt Enable Mask */
#define USBHS_DEVIER_UPRSMES(value)           (USBHS_DEVIER_UPRSMES_Msk & (_UINT32_(value) << USBHS_DEVIER_UPRSMES_Pos)) /* Assigment of value for UPRSMES in the USBHS_DEVIER register */
#define USBHS_DEVIER_PEP_0_Pos                _UINT32_(12)                                         /* (USBHS_DEVIER) Endpoint 0 Interrupt Enable Position */
#define USBHS_DEVIER_PEP_0_Msk                (_UINT32_(0x1) << USBHS_DEVIER_PEP_0_Pos)            /* (USBHS_DEVIER) Endpoint 0 Interrupt Enable Mask */
#define USBHS_DEVIER_PEP_0(value)             (USBHS_DEVIER_PEP_0_Msk & (_UINT32_(value) << USBHS_DEVIER_PEP_0_Pos)) /* Assigment of value for PEP_0 in the USBHS_DEVIER register */
#define USBHS_DEVIER_PEP_1_Pos                _UINT32_(13)                                         /* (USBHS_DEVIER) Endpoint 1 Interrupt Enable Position */
#define USBHS_DEVIER_PEP_1_Msk                (_UINT32_(0x1) << USBHS_DEVIER_PEP_1_Pos)            /* (USBHS_DEVIER) Endpoint 1 Interrupt Enable Mask */
#define USBHS_DEVIER_PEP_1(value)             (USBHS_DEVIER_PEP_1_Msk & (_UINT32_(value) << USBHS_DEVIER_PEP_1_Pos)) /* Assigment of value for PEP_1 in the USBHS_DEVIER register */
#define USBHS_DEVIER_PEP_2_Pos                _UINT32_(14)                                         /* (USBHS_DEVIER) Endpoint 2 Interrupt Enable Position */
#define USBHS_DEVIER_PEP_2_Msk                (_UINT32_(0x1) << USBHS_DEVIER_PEP_2_Pos)            /* (USBHS_DEVIER) Endpoint 2 Interrupt Enable Mask */
#define USBHS_DEVIER_PEP_2(value)             (USBHS_DEVIER_PEP_2_Msk & (_UINT32_(value) << USBHS_DEVIER_PEP_2_Pos)) /* Assigment of value for PEP_2 in the USBHS_DEVIER register */
#define USBHS_DEVIER_PEP_3_Pos                _UINT32_(15)                                         /* (USBHS_DEVIER) Endpoint 3 Interrupt Enable Position */
#define USBHS_DEVIER_PEP_3_Msk                (_UINT32_(0x1) << USBHS_DEVIER_PEP_3_Pos)            /* (USBHS_DEVIER) Endpoint 3 Interrupt Enable Mask */
#define USBHS_DEVIER_PEP_3(value)             (USBHS_DEVIER_PEP_3_Msk & (_UINT32_(value) << USBHS_DEVIER_PEP_3_Pos)) /* Assigment of value for PEP_3 in the USBHS_DEVIER register */
#define USBHS_DEVIER_PEP_4_Pos                _UINT32_(16)                                         /* (USBHS_DEVIER) Endpoint 4 Interrupt Enable Position */
#define USBHS_DEVIER_PEP_4_Msk                (_UINT32_(0x1) << USBHS_DEVIER_PEP_4_Pos)            /* (USBHS_DEVIER) Endpoint 4 Interrupt Enable Mask */
#define USBHS_DEVIER_PEP_4(value)             (USBHS_DEVIER_PEP_4_Msk & (_UINT32_(value) << USBHS_DEVIER_PEP_4_Pos)) /* Assigment of value for PEP_4 in the USBHS_DEVIER register */
#define USBHS_DEVIER_PEP_5_Pos                _UINT32_(17)                                         /* (USBHS_DEVIER) Endpoint 5 Interrupt Enable Position */
#define USBHS_DEVIER_PEP_5_Msk                (_UINT32_(0x1) << USBHS_DEVIER_PEP_5_Pos)            /* (USBHS_DEVIER) Endpoint 5 Interrupt Enable Mask */
#define USBHS_DEVIER_PEP_5(value)             (USBHS_DEVIER_PEP_5_Msk & (_UINT32_(value) << USBHS_DEVIER_PEP_5_Pos)) /* Assigment of value for PEP_5 in the USBHS_DEVIER register */
#define USBHS_DEVIER_PEP_6_Pos                _UINT32_(18)                                         /* (USBHS_DEVIER) Endpoint 6 Interrupt Enable Position */
#define USBHS_DEVIER_PEP_6_Msk                (_UINT32_(0x1) << USBHS_DEVIER_PEP_6_Pos)            /* (USBHS_DEVIER) Endpoint 6 Interrupt Enable Mask */
#define USBHS_DEVIER_PEP_6(value)             (USBHS_DEVIER_PEP_6_Msk & (_UINT32_(value) << USBHS_DEVIER_PEP_6_Pos)) /* Assigment of value for PEP_6 in the USBHS_DEVIER register */
#define USBHS_DEVIER_PEP_7_Pos                _UINT32_(19)                                         /* (USBHS_DEVIER) Endpoint 7 Interrupt Enable Position */
#define USBHS_DEVIER_PEP_7_Msk                (_UINT32_(0x1) << USBHS_DEVIER_PEP_7_Pos)            /* (USBHS_DEVIER) Endpoint 7 Interrupt Enable Mask */
#define USBHS_DEVIER_PEP_7(value)             (USBHS_DEVIER_PEP_7_Msk & (_UINT32_(value) << USBHS_DEVIER_PEP_7_Pos)) /* Assigment of value for PEP_7 in the USBHS_DEVIER register */
#define USBHS_DEVIER_PEP_8_Pos                _UINT32_(20)                                         /* (USBHS_DEVIER) Endpoint 8 Interrupt Enable Position */
#define USBHS_DEVIER_PEP_8_Msk                (_UINT32_(0x1) << USBHS_DEVIER_PEP_8_Pos)            /* (USBHS_DEVIER) Endpoint 8 Interrupt Enable Mask */
#define USBHS_DEVIER_PEP_8(value)             (USBHS_DEVIER_PEP_8_Msk & (_UINT32_(value) << USBHS_DEVIER_PEP_8_Pos)) /* Assigment of value for PEP_8 in the USBHS_DEVIER register */
#define USBHS_DEVIER_PEP_9_Pos                _UINT32_(21)                                         /* (USBHS_DEVIER) Endpoint 9 Interrupt Enable Position */
#define USBHS_DEVIER_PEP_9_Msk                (_UINT32_(0x1) << USBHS_DEVIER_PEP_9_Pos)            /* (USBHS_DEVIER) Endpoint 9 Interrupt Enable Mask */
#define USBHS_DEVIER_PEP_9(value)             (USBHS_DEVIER_PEP_9_Msk & (_UINT32_(value) << USBHS_DEVIER_PEP_9_Pos)) /* Assigment of value for PEP_9 in the USBHS_DEVIER register */
#define USBHS_DEVIER_DMA_1_Pos                _UINT32_(25)                                         /* (USBHS_DEVIER) DMA Channel 1 Interrupt Enable Position */
#define USBHS_DEVIER_DMA_1_Msk                (_UINT32_(0x1) << USBHS_DEVIER_DMA_1_Pos)            /* (USBHS_DEVIER) DMA Channel 1 Interrupt Enable Mask */
#define USBHS_DEVIER_DMA_1(value)             (USBHS_DEVIER_DMA_1_Msk & (_UINT32_(value) << USBHS_DEVIER_DMA_1_Pos)) /* Assigment of value for DMA_1 in the USBHS_DEVIER register */
#define USBHS_DEVIER_DMA_2_Pos                _UINT32_(26)                                         /* (USBHS_DEVIER) DMA Channel 2 Interrupt Enable Position */
#define USBHS_DEVIER_DMA_2_Msk                (_UINT32_(0x1) << USBHS_DEVIER_DMA_2_Pos)            /* (USBHS_DEVIER) DMA Channel 2 Interrupt Enable Mask */
#define USBHS_DEVIER_DMA_2(value)             (USBHS_DEVIER_DMA_2_Msk & (_UINT32_(value) << USBHS_DEVIER_DMA_2_Pos)) /* Assigment of value for DMA_2 in the USBHS_DEVIER register */
#define USBHS_DEVIER_DMA_3_Pos                _UINT32_(27)                                         /* (USBHS_DEVIER) DMA Channel 3 Interrupt Enable Position */
#define USBHS_DEVIER_DMA_3_Msk                (_UINT32_(0x1) << USBHS_DEVIER_DMA_3_Pos)            /* (USBHS_DEVIER) DMA Channel 3 Interrupt Enable Mask */
#define USBHS_DEVIER_DMA_3(value)             (USBHS_DEVIER_DMA_3_Msk & (_UINT32_(value) << USBHS_DEVIER_DMA_3_Pos)) /* Assigment of value for DMA_3 in the USBHS_DEVIER register */
#define USBHS_DEVIER_DMA_4_Pos                _UINT32_(28)                                         /* (USBHS_DEVIER) DMA Channel 4 Interrupt Enable Position */
#define USBHS_DEVIER_DMA_4_Msk                (_UINT32_(0x1) << USBHS_DEVIER_DMA_4_Pos)            /* (USBHS_DEVIER) DMA Channel 4 Interrupt Enable Mask */
#define USBHS_DEVIER_DMA_4(value)             (USBHS_DEVIER_DMA_4_Msk & (_UINT32_(value) << USBHS_DEVIER_DMA_4_Pos)) /* Assigment of value for DMA_4 in the USBHS_DEVIER register */
#define USBHS_DEVIER_DMA_5_Pos                _UINT32_(29)                                         /* (USBHS_DEVIER) DMA Channel 5 Interrupt Enable Position */
#define USBHS_DEVIER_DMA_5_Msk                (_UINT32_(0x1) << USBHS_DEVIER_DMA_5_Pos)            /* (USBHS_DEVIER) DMA Channel 5 Interrupt Enable Mask */
#define USBHS_DEVIER_DMA_5(value)             (USBHS_DEVIER_DMA_5_Msk & (_UINT32_(value) << USBHS_DEVIER_DMA_5_Pos)) /* Assigment of value for DMA_5 in the USBHS_DEVIER register */
#define USBHS_DEVIER_DMA_6_Pos                _UINT32_(30)                                         /* (USBHS_DEVIER) DMA Channel 6 Interrupt Enable Position */
#define USBHS_DEVIER_DMA_6_Msk                (_UINT32_(0x1) << USBHS_DEVIER_DMA_6_Pos)            /* (USBHS_DEVIER) DMA Channel 6 Interrupt Enable Mask */
#define USBHS_DEVIER_DMA_6(value)             (USBHS_DEVIER_DMA_6_Msk & (_UINT32_(value) << USBHS_DEVIER_DMA_6_Pos)) /* Assigment of value for DMA_6 in the USBHS_DEVIER register */
#define USBHS_DEVIER_DMA_7_Pos                _UINT32_(31)                                         /* (USBHS_DEVIER) DMA Channel 7 Interrupt Enable Position */
#define USBHS_DEVIER_DMA_7_Msk                (_UINT32_(0x1) << USBHS_DEVIER_DMA_7_Pos)            /* (USBHS_DEVIER) DMA Channel 7 Interrupt Enable Mask */
#define USBHS_DEVIER_DMA_7(value)             (USBHS_DEVIER_DMA_7_Msk & (_UINT32_(value) << USBHS_DEVIER_DMA_7_Pos)) /* Assigment of value for DMA_7 in the USBHS_DEVIER register */
#define USBHS_DEVIER_Msk                      _UINT32_(0xFE3FF07F)                                 /* (USBHS_DEVIER) Register Mask  */

#define USBHS_DEVIER_PEP__Pos                 _UINT32_(12)                                         /* (USBHS_DEVIER Position) Endpoint x Interrupt Enable */
#define USBHS_DEVIER_PEP__Msk                 (_UINT32_(0x3FF) << USBHS_DEVIER_PEP__Pos)           /* (USBHS_DEVIER Mask) PEP_ */
#define USBHS_DEVIER_PEP_(value)              (USBHS_DEVIER_PEP__Msk & (_UINT32_(value) << USBHS_DEVIER_PEP__Pos)) 
#define USBHS_DEVIER_DMA__Pos                 _UINT32_(25)                                         /* (USBHS_DEVIER Position) DMA Channel 7 Interrupt Enable */
#define USBHS_DEVIER_DMA__Msk                 (_UINT32_(0x7F) << USBHS_DEVIER_DMA__Pos)            /* (USBHS_DEVIER Mask) DMA_ */
#define USBHS_DEVIER_DMA_(value)              (USBHS_DEVIER_DMA__Msk & (_UINT32_(value) << USBHS_DEVIER_DMA__Pos)) 

/* -------- USBHS_DEVEPT : (USBHS Offset: 0x1C) (R/W 32) Device Endpoint Register -------- */
#define USBHS_DEVEPT_EPEN0_Pos                _UINT32_(0)                                          /* (USBHS_DEVEPT) Endpoint 0 Enable Position */
#define USBHS_DEVEPT_EPEN0_Msk                (_UINT32_(0x1) << USBHS_DEVEPT_EPEN0_Pos)            /* (USBHS_DEVEPT) Endpoint 0 Enable Mask */
#define USBHS_DEVEPT_EPEN0(value)             (USBHS_DEVEPT_EPEN0_Msk & (_UINT32_(value) << USBHS_DEVEPT_EPEN0_Pos)) /* Assigment of value for EPEN0 in the USBHS_DEVEPT register */
#define USBHS_DEVEPT_EPEN1_Pos                _UINT32_(1)                                          /* (USBHS_DEVEPT) Endpoint 1 Enable Position */
#define USBHS_DEVEPT_EPEN1_Msk                (_UINT32_(0x1) << USBHS_DEVEPT_EPEN1_Pos)            /* (USBHS_DEVEPT) Endpoint 1 Enable Mask */
#define USBHS_DEVEPT_EPEN1(value)             (USBHS_DEVEPT_EPEN1_Msk & (_UINT32_(value) << USBHS_DEVEPT_EPEN1_Pos)) /* Assigment of value for EPEN1 in the USBHS_DEVEPT register */
#define USBHS_DEVEPT_EPEN2_Pos                _UINT32_(2)                                          /* (USBHS_DEVEPT) Endpoint 2 Enable Position */
#define USBHS_DEVEPT_EPEN2_Msk                (_UINT32_(0x1) << USBHS_DEVEPT_EPEN2_Pos)            /* (USBHS_DEVEPT) Endpoint 2 Enable Mask */
#define USBHS_DEVEPT_EPEN2(value)             (USBHS_DEVEPT_EPEN2_Msk & (_UINT32_(value) << USBHS_DEVEPT_EPEN2_Pos)) /* Assigment of value for EPEN2 in the USBHS_DEVEPT register */
#define USBHS_DEVEPT_EPEN3_Pos                _UINT32_(3)                                          /* (USBHS_DEVEPT) Endpoint 3 Enable Position */
#define USBHS_DEVEPT_EPEN3_Msk                (_UINT32_(0x1) << USBHS_DEVEPT_EPEN3_Pos)            /* (USBHS_DEVEPT) Endpoint 3 Enable Mask */
#define USBHS_DEVEPT_EPEN3(value)             (USBHS_DEVEPT_EPEN3_Msk & (_UINT32_(value) << USBHS_DEVEPT_EPEN3_Pos)) /* Assigment of value for EPEN3 in the USBHS_DEVEPT register */
#define USBHS_DEVEPT_EPEN4_Pos                _UINT32_(4)                                          /* (USBHS_DEVEPT) Endpoint 4 Enable Position */
#define USBHS_DEVEPT_EPEN4_Msk                (_UINT32_(0x1) << USBHS_DEVEPT_EPEN4_Pos)            /* (USBHS_DEVEPT) Endpoint 4 Enable Mask */
#define USBHS_DEVEPT_EPEN4(value)             (USBHS_DEVEPT_EPEN4_Msk & (_UINT32_(value) << USBHS_DEVEPT_EPEN4_Pos)) /* Assigment of value for EPEN4 in the USBHS_DEVEPT register */
#define USBHS_DEVEPT_EPEN5_Pos                _UINT32_(5)                                          /* (USBHS_DEVEPT) Endpoint 5 Enable Position */
#define USBHS_DEVEPT_EPEN5_Msk                (_UINT32_(0x1) << USBHS_DEVEPT_EPEN5_Pos)            /* (USBHS_DEVEPT) Endpoint 5 Enable Mask */
#define USBHS_DEVEPT_EPEN5(value)             (USBHS_DEVEPT_EPEN5_Msk & (_UINT32_(value) << USBHS_DEVEPT_EPEN5_Pos)) /* Assigment of value for EPEN5 in the USBHS_DEVEPT register */
#define USBHS_DEVEPT_EPEN6_Pos                _UINT32_(6)                                          /* (USBHS_DEVEPT) Endpoint 6 Enable Position */
#define USBHS_DEVEPT_EPEN6_Msk                (_UINT32_(0x1) << USBHS_DEVEPT_EPEN6_Pos)            /* (USBHS_DEVEPT) Endpoint 6 Enable Mask */
#define USBHS_DEVEPT_EPEN6(value)             (USBHS_DEVEPT_EPEN6_Msk & (_UINT32_(value) << USBHS_DEVEPT_EPEN6_Pos)) /* Assigment of value for EPEN6 in the USBHS_DEVEPT register */
#define USBHS_DEVEPT_EPEN7_Pos                _UINT32_(7)                                          /* (USBHS_DEVEPT) Endpoint 7 Enable Position */
#define USBHS_DEVEPT_EPEN7_Msk                (_UINT32_(0x1) << USBHS_DEVEPT_EPEN7_Pos)            /* (USBHS_DEVEPT) Endpoint 7 Enable Mask */
#define USBHS_DEVEPT_EPEN7(value)             (USBHS_DEVEPT_EPEN7_Msk & (_UINT32_(value) << USBHS_DEVEPT_EPEN7_Pos)) /* Assigment of value for EPEN7 in the USBHS_DEVEPT register */
#define USBHS_DEVEPT_EPEN8_Pos                _UINT32_(8)                                          /* (USBHS_DEVEPT) Endpoint 8 Enable Position */
#define USBHS_DEVEPT_EPEN8_Msk                (_UINT32_(0x1) << USBHS_DEVEPT_EPEN8_Pos)            /* (USBHS_DEVEPT) Endpoint 8 Enable Mask */
#define USBHS_DEVEPT_EPEN8(value)             (USBHS_DEVEPT_EPEN8_Msk & (_UINT32_(value) << USBHS_DEVEPT_EPEN8_Pos)) /* Assigment of value for EPEN8 in the USBHS_DEVEPT register */
#define USBHS_DEVEPT_EPEN9_Pos                _UINT32_(9)                                          /* (USBHS_DEVEPT) Endpoint 9 Enable Position */
#define USBHS_DEVEPT_EPEN9_Msk                (_UINT32_(0x1) << USBHS_DEVEPT_EPEN9_Pos)            /* (USBHS_DEVEPT) Endpoint 9 Enable Mask */
#define USBHS_DEVEPT_EPEN9(value)             (USBHS_DEVEPT_EPEN9_Msk & (_UINT32_(value) << USBHS_DEVEPT_EPEN9_Pos)) /* Assigment of value for EPEN9 in the USBHS_DEVEPT register */
#define USBHS_DEVEPT_EPRST0_Pos               _UINT32_(16)                                         /* (USBHS_DEVEPT) Endpoint 0 Reset Position */
#define USBHS_DEVEPT_EPRST0_Msk               (_UINT32_(0x1) << USBHS_DEVEPT_EPRST0_Pos)           /* (USBHS_DEVEPT) Endpoint 0 Reset Mask */
#define USBHS_DEVEPT_EPRST0(value)            (USBHS_DEVEPT_EPRST0_Msk & (_UINT32_(value) << USBHS_DEVEPT_EPRST0_Pos)) /* Assigment of value for EPRST0 in the USBHS_DEVEPT register */
#define USBHS_DEVEPT_EPRST1_Pos               _UINT32_(17)                                         /* (USBHS_DEVEPT) Endpoint 1 Reset Position */
#define USBHS_DEVEPT_EPRST1_Msk               (_UINT32_(0x1) << USBHS_DEVEPT_EPRST1_Pos)           /* (USBHS_DEVEPT) Endpoint 1 Reset Mask */
#define USBHS_DEVEPT_EPRST1(value)            (USBHS_DEVEPT_EPRST1_Msk & (_UINT32_(value) << USBHS_DEVEPT_EPRST1_Pos)) /* Assigment of value for EPRST1 in the USBHS_DEVEPT register */
#define USBHS_DEVEPT_EPRST2_Pos               _UINT32_(18)                                         /* (USBHS_DEVEPT) Endpoint 2 Reset Position */
#define USBHS_DEVEPT_EPRST2_Msk               (_UINT32_(0x1) << USBHS_DEVEPT_EPRST2_Pos)           /* (USBHS_DEVEPT) Endpoint 2 Reset Mask */
#define USBHS_DEVEPT_EPRST2(value)            (USBHS_DEVEPT_EPRST2_Msk & (_UINT32_(value) << USBHS_DEVEPT_EPRST2_Pos)) /* Assigment of value for EPRST2 in the USBHS_DEVEPT register */
#define USBHS_DEVEPT_EPRST3_Pos               _UINT32_(19)                                         /* (USBHS_DEVEPT) Endpoint 3 Reset Position */
#define USBHS_DEVEPT_EPRST3_Msk               (_UINT32_(0x1) << USBHS_DEVEPT_EPRST3_Pos)           /* (USBHS_DEVEPT) Endpoint 3 Reset Mask */
#define USBHS_DEVEPT_EPRST3(value)            (USBHS_DEVEPT_EPRST3_Msk & (_UINT32_(value) << USBHS_DEVEPT_EPRST3_Pos)) /* Assigment of value for EPRST3 in the USBHS_DEVEPT register */
#define USBHS_DEVEPT_EPRST4_Pos               _UINT32_(20)                                         /* (USBHS_DEVEPT) Endpoint 4 Reset Position */
#define USBHS_DEVEPT_EPRST4_Msk               (_UINT32_(0x1) << USBHS_DEVEPT_EPRST4_Pos)           /* (USBHS_DEVEPT) Endpoint 4 Reset Mask */
#define USBHS_DEVEPT_EPRST4(value)            (USBHS_DEVEPT_EPRST4_Msk & (_UINT32_(value) << USBHS_DEVEPT_EPRST4_Pos)) /* Assigment of value for EPRST4 in the USBHS_DEVEPT register */
#define USBHS_DEVEPT_EPRST5_Pos               _UINT32_(21)                                         /* (USBHS_DEVEPT) Endpoint 5 Reset Position */
#define USBHS_DEVEPT_EPRST5_Msk               (_UINT32_(0x1) << USBHS_DEVEPT_EPRST5_Pos)           /* (USBHS_DEVEPT) Endpoint 5 Reset Mask */
#define USBHS_DEVEPT_EPRST5(value)            (USBHS_DEVEPT_EPRST5_Msk & (_UINT32_(value) << USBHS_DEVEPT_EPRST5_Pos)) /* Assigment of value for EPRST5 in the USBHS_DEVEPT register */
#define USBHS_DEVEPT_EPRST6_Pos               _UINT32_(22)                                         /* (USBHS_DEVEPT) Endpoint 6 Reset Position */
#define USBHS_DEVEPT_EPRST6_Msk               (_UINT32_(0x1) << USBHS_DEVEPT_EPRST6_Pos)           /* (USBHS_DEVEPT) Endpoint 6 Reset Mask */
#define USBHS_DEVEPT_EPRST6(value)            (USBHS_DEVEPT_EPRST6_Msk & (_UINT32_(value) << USBHS_DEVEPT_EPRST6_Pos)) /* Assigment of value for EPRST6 in the USBHS_DEVEPT register */
#define USBHS_DEVEPT_EPRST7_Pos               _UINT32_(23)                                         /* (USBHS_DEVEPT) Endpoint 7 Reset Position */
#define USBHS_DEVEPT_EPRST7_Msk               (_UINT32_(0x1) << USBHS_DEVEPT_EPRST7_Pos)           /* (USBHS_DEVEPT) Endpoint 7 Reset Mask */
#define USBHS_DEVEPT_EPRST7(value)            (USBHS_DEVEPT_EPRST7_Msk & (_UINT32_(value) << USBHS_DEVEPT_EPRST7_Pos)) /* Assigment of value for EPRST7 in the USBHS_DEVEPT register */
#define USBHS_DEVEPT_EPRST8_Pos               _UINT32_(24)                                         /* (USBHS_DEVEPT) Endpoint 8 Reset Position */
#define USBHS_DEVEPT_EPRST8_Msk               (_UINT32_(0x1) << USBHS_DEVEPT_EPRST8_Pos)           /* (USBHS_DEVEPT) Endpoint 8 Reset Mask */
#define USBHS_DEVEPT_EPRST8(value)            (USBHS_DEVEPT_EPRST8_Msk & (_UINT32_(value) << USBHS_DEVEPT_EPRST8_Pos)) /* Assigment of value for EPRST8 in the USBHS_DEVEPT register */
#define USBHS_DEVEPT_EPRST9_Pos               _UINT32_(25)                                         /* (USBHS_DEVEPT) Endpoint 9 Reset Position */
#define USBHS_DEVEPT_EPRST9_Msk               (_UINT32_(0x1) << USBHS_DEVEPT_EPRST9_Pos)           /* (USBHS_DEVEPT) Endpoint 9 Reset Mask */
#define USBHS_DEVEPT_EPRST9(value)            (USBHS_DEVEPT_EPRST9_Msk & (_UINT32_(value) << USBHS_DEVEPT_EPRST9_Pos)) /* Assigment of value for EPRST9 in the USBHS_DEVEPT register */
#define USBHS_DEVEPT_Msk                      _UINT32_(0x03FF03FF)                                 /* (USBHS_DEVEPT) Register Mask  */

#define USBHS_DEVEPT_EPEN_Pos                 _UINT32_(0)                                          /* (USBHS_DEVEPT Position) Endpoint x Enable */
#define USBHS_DEVEPT_EPEN_Msk                 (_UINT32_(0x3FF) << USBHS_DEVEPT_EPEN_Pos)           /* (USBHS_DEVEPT Mask) EPEN */
#define USBHS_DEVEPT_EPEN(value)              (USBHS_DEVEPT_EPEN_Msk & (_UINT32_(value) << USBHS_DEVEPT_EPEN_Pos)) 
#define USBHS_DEVEPT_EPRST_Pos                _UINT32_(16)                                         /* (USBHS_DEVEPT Position) Endpoint 9 Reset */
#define USBHS_DEVEPT_EPRST_Msk                (_UINT32_(0x3FF) << USBHS_DEVEPT_EPRST_Pos)          /* (USBHS_DEVEPT Mask) EPRST */
#define USBHS_DEVEPT_EPRST(value)             (USBHS_DEVEPT_EPRST_Msk & (_UINT32_(value) << USBHS_DEVEPT_EPRST_Pos)) 

