Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/usbhs.h
/* -------- USBHS_DEVEPTIMR : (USBHS Offset: 0x1C0) ( R/ 32) Device Endpoint Interrupt Mask Register -------- */
#define USBHS_DEVEPTIMR_TXINE_Pos             _UINT32_(0)                                          /* (USBHS_DEVEPTIMR) Transmitted IN Data Interrupt Position */
#define USBHS_DEVEPTIMR_TXINE_Msk             (_UINT32_(0x1) << USBHS_DEVEPTIMR_TXINE_Pos)         /* (USBHS_DEVEPTIMR) Transmitted IN Data Interrupt Mask */
#define USBHS_DEVEPTIMR_TXINE(value)          (USBHS_DEVEPTIMR_TXINE_Msk & (_UINT32_(value) << USBHS_DEVEPTIMR_TXINE_Pos)) /* Assigment of value for TXINE in the USBHS_DEVEPTIMR register */
#define USBHS_DEVEPTIMR_RXOUTE_Pos            _UINT32_(1)                                          /* (USBHS_DEVEPTIMR) Received OUT Data Interrupt Position */
#define USBHS_DEVEPTIMR_RXOUTE_Msk            (_UINT32_(0x1) << USBHS_DEVEPTIMR_RXOUTE_Pos)        /* (USBHS_DEVEPTIMR) Received OUT Data Interrupt Mask */
#define USBHS_DEVEPTIMR_RXOUTE(value)         (USBHS_DEVEPTIMR_RXOUTE_Msk & (_UINT32_(value) << USBHS_DEVEPTIMR_RXOUTE_Pos)) /* Assigment of value for RXOUTE in the USBHS_DEVEPTIMR register */
#define USBHS_DEVEPTIMR_OVERFE_Pos            _UINT32_(5)                                          /* (USBHS_DEVEPTIMR) Overflow Interrupt Position */
#define USBHS_DEVEPTIMR_OVERFE_Msk            (_UINT32_(0x1) << USBHS_DEVEPTIMR_OVERFE_Pos)        /* (USBHS_DEVEPTIMR) Overflow Interrupt Mask */
#define USBHS_DEVEPTIMR_OVERFE(value)         (USBHS_DEVEPTIMR_OVERFE_Msk & (_UINT32_(value) << USBHS_DEVEPTIMR_OVERFE_Pos)) /* Assigment of value for OVERFE in the USBHS_DEVEPTIMR register */
#define USBHS_DEVEPTIMR_SHORTPACKETE_Pos      _UINT32_(7)                                          /* (USBHS_DEVEPTIMR) Short Packet Interrupt Position */
#define USBHS_DEVEPTIMR_SHORTPACKETE_Msk      (_UINT32_(0x1) << USBHS_DEVEPTIMR_SHORTPACKETE_Pos)  /* (USBHS_DEVEPTIMR) Short Packet Interrupt Mask */
#define USBHS_DEVEPTIMR_SHORTPACKETE(value)   (USBHS_DEVEPTIMR_SHORTPACKETE_Msk & (_UINT32_(value) << USBHS_DEVEPTIMR_SHORTPACKETE_Pos)) /* Assigment of value for SHORTPACKETE in the USBHS_DEVEPTIMR register */
#define USBHS_DEVEPTIMR_NBUSYBKE_Pos          _UINT32_(12)                                         /* (USBHS_DEVEPTIMR) Number of Busy Banks Interrupt Position */
#define USBHS_DEVEPTIMR_NBUSYBKE_Msk          (_UINT32_(0x1) << USBHS_DEVEPTIMR_NBUSYBKE_Pos)      /* (USBHS_DEVEPTIMR) Number of Busy Banks Interrupt Mask */
#define USBHS_DEVEPTIMR_NBUSYBKE(value)       (USBHS_DEVEPTIMR_NBUSYBKE_Msk & (_UINT32_(value) << USBHS_DEVEPTIMR_NBUSYBKE_Pos)) /* Assigment of value for NBUSYBKE in the USBHS_DEVEPTIMR register */
#define USBHS_DEVEPTIMR_KILLBK_Pos            _UINT32_(13)                                         /* (USBHS_DEVEPTIMR) Kill IN Bank Position */
#define USBHS_DEVEPTIMR_KILLBK_Msk            (_UINT32_(0x1) << USBHS_DEVEPTIMR_KILLBK_Pos)        /* (USBHS_DEVEPTIMR) Kill IN Bank Mask */
#define USBHS_DEVEPTIMR_KILLBK(value)         (USBHS_DEVEPTIMR_KILLBK_Msk & (_UINT32_(value) << USBHS_DEVEPTIMR_KILLBK_Pos)) /* Assigment of value for KILLBK in the USBHS_DEVEPTIMR register */
#define USBHS_DEVEPTIMR_FIFOCON_Pos           _UINT32_(14)                                         /* (USBHS_DEVEPTIMR) FIFO Control Position */
#define USBHS_DEVEPTIMR_FIFOCON_Msk           (_UINT32_(0x1) << USBHS_DEVEPTIMR_FIFOCON_Pos)       /* (USBHS_DEVEPTIMR) FIFO Control Mask */
#define USBHS_DEVEPTIMR_FIFOCON(value)        (USBHS_DEVEPTIMR_FIFOCON_Msk & (_UINT32_(value) << USBHS_DEVEPTIMR_FIFOCON_Pos)) /* Assigment of value for FIFOCON in the USBHS_DEVEPTIMR register */
#define USBHS_DEVEPTIMR_EPDISHDMA_Pos         _UINT32_(16)                                         /* (USBHS_DEVEPTIMR) Endpoint Interrupts Disable HDMA Request Position */
#define USBHS_DEVEPTIMR_EPDISHDMA_Msk         (_UINT32_(0x1) << USBHS_DEVEPTIMR_EPDISHDMA_Pos)     /* (USBHS_DEVEPTIMR) Endpoint Interrupts Disable HDMA Request Mask */
#define USBHS_DEVEPTIMR_EPDISHDMA(value)      (USBHS_DEVEPTIMR_EPDISHDMA_Msk & (_UINT32_(value) << USBHS_DEVEPTIMR_EPDISHDMA_Pos)) /* Assigment of value for EPDISHDMA in the USBHS_DEVEPTIMR register */
#define USBHS_DEVEPTIMR_RSTDT_Pos             _UINT32_(18)                                         /* (USBHS_DEVEPTIMR) Reset Data Toggle Position */
#define USBHS_DEVEPTIMR_RSTDT_Msk             (_UINT32_(0x1) << USBHS_DEVEPTIMR_RSTDT_Pos)         /* (USBHS_DEVEPTIMR) Reset Data Toggle Mask */
#define USBHS_DEVEPTIMR_RSTDT(value)          (USBHS_DEVEPTIMR_RSTDT_Msk & (_UINT32_(value) << USBHS_DEVEPTIMR_RSTDT_Pos)) /* Assigment of value for RSTDT in the USBHS_DEVEPTIMR register */
#define USBHS_DEVEPTIMR_Msk                   _UINT32_(0x000570A3)                                 /* (USBHS_DEVEPTIMR) Register Mask  */

/* CTRL mode */
#define USBHS_DEVEPTIMR_CTRL_RXSTPE_Pos       _UINT32_(2)                                          /* (USBHS_DEVEPTIMR) Received SETUP Interrupt Position */
#define USBHS_DEVEPTIMR_CTRL_RXSTPE_Msk       (_UINT32_(0x1) << USBHS_DEVEPTIMR_CTRL_RXSTPE_Pos)   /* (USBHS_DEVEPTIMR) Received SETUP Interrupt Mask */
#define USBHS_DEVEPTIMR_CTRL_RXSTPE(value)    (USBHS_DEVEPTIMR_CTRL_RXSTPE_Msk & (_UINT32_(value) << USBHS_DEVEPTIMR_CTRL_RXSTPE_Pos))
#define USBHS_DEVEPTIMR_CTRL_NAKOUTE_Pos      _UINT32_(3)                                          /* (USBHS_DEVEPTIMR) NAKed OUT Interrupt Position */
#define USBHS_DEVEPTIMR_CTRL_NAKOUTE_Msk      (_UINT32_(0x1) << USBHS_DEVEPTIMR_CTRL_NAKOUTE_Pos)  /* (USBHS_DEVEPTIMR) NAKed OUT Interrupt Mask */
#define USBHS_DEVEPTIMR_CTRL_NAKOUTE(value)   (USBHS_DEVEPTIMR_CTRL_NAKOUTE_Msk & (_UINT32_(value) << USBHS_DEVEPTIMR_CTRL_NAKOUTE_Pos))
#define USBHS_DEVEPTIMR_CTRL_NAKINE_Pos       _UINT32_(4)                                          /* (USBHS_DEVEPTIMR) NAKed IN Interrupt Position */
#define USBHS_DEVEPTIMR_CTRL_NAKINE_Msk       (_UINT32_(0x1) << USBHS_DEVEPTIMR_CTRL_NAKINE_Pos)   /* (USBHS_DEVEPTIMR) NAKed IN Interrupt Mask */
#define USBHS_DEVEPTIMR_CTRL_NAKINE(value)    (USBHS_DEVEPTIMR_CTRL_NAKINE_Msk & (_UINT32_(value) << USBHS_DEVEPTIMR_CTRL_NAKINE_Pos))
#define USBHS_DEVEPTIMR_CTRL_STALLEDE_Pos     _UINT32_(6)                                          /* (USBHS_DEVEPTIMR) STALLed Interrupt Position */
#define USBHS_DEVEPTIMR_CTRL_STALLEDE_Msk     (_UINT32_(0x1) << USBHS_DEVEPTIMR_CTRL_STALLEDE_Pos) /* (USBHS_DEVEPTIMR) STALLed Interrupt Mask */
#define USBHS_DEVEPTIMR_CTRL_STALLEDE(value)  (USBHS_DEVEPTIMR_CTRL_STALLEDE_Msk & (_UINT32_(value) << USBHS_DEVEPTIMR_CTRL_STALLEDE_Pos))
#define USBHS_DEVEPTIMR_CTRL_NYETDIS_Pos      _UINT32_(17)                                         /* (USBHS_DEVEPTIMR) NYET Token Disable Position */
#define USBHS_DEVEPTIMR_CTRL_NYETDIS_Msk      (_UINT32_(0x1) << USBHS_DEVEPTIMR_CTRL_NYETDIS_Pos)  /* (USBHS_DEVEPTIMR) NYET Token Disable Mask */
#define USBHS_DEVEPTIMR_CTRL_NYETDIS(value)   (USBHS_DEVEPTIMR_CTRL_NYETDIS_Msk & (_UINT32_(value) << USBHS_DEVEPTIMR_CTRL_NYETDIS_Pos))
#define USBHS_DEVEPTIMR_CTRL_STALLRQ_Pos      _UINT32_(19)                                         /* (USBHS_DEVEPTIMR) STALL Request Position */
#define USBHS_DEVEPTIMR_CTRL_STALLRQ_Msk      (_UINT32_(0x1) << USBHS_DEVEPTIMR_CTRL_STALLRQ_Pos)  /* (USBHS_DEVEPTIMR) STALL Request Mask */
#define USBHS_DEVEPTIMR_CTRL_STALLRQ(value)   (USBHS_DEVEPTIMR_CTRL_STALLRQ_Msk & (_UINT32_(value) << USBHS_DEVEPTIMR_CTRL_STALLRQ_Pos))
#define USBHS_DEVEPTIMR_CTRL_Msk              _UINT32_(0x000A005C)                                  /* (USBHS_DEVEPTIMR_CTRL) Register Mask  */

