Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/usbhs.h
/* -------- USBHS_HSTCTRL : (USBHS Offset: 0x400) (R/W 32) Host General Control Register -------- */
#define USBHS_HSTCTRL_SOFE_Pos                _UINT32_(8)                                          /* (USBHS_HSTCTRL) Start of Frame Generation Enable Position */
#define USBHS_HSTCTRL_SOFE_Msk                (_UINT32_(0x1) << USBHS_HSTCTRL_SOFE_Pos)            /* (USBHS_HSTCTRL) Start of Frame Generation Enable Mask */
#define USBHS_HSTCTRL_SOFE(value)             (USBHS_HSTCTRL_SOFE_Msk & (_UINT32_(value) << USBHS_HSTCTRL_SOFE_Pos)) /* Assigment of value for SOFE in the USBHS_HSTCTRL register */
#define USBHS_HSTCTRL_RESET_Pos               _UINT32_(9)                                          /* (USBHS_HSTCTRL) Send USB Reset Position */
#define USBHS_HSTCTRL_RESET_Msk               (_UINT32_(0x1) << USBHS_HSTCTRL_RESET_Pos)           /* (USBHS_HSTCTRL) Send USB Reset Mask */
#define USBHS_HSTCTRL_RESET(value)            (USBHS_HSTCTRL_RESET_Msk & (_UINT32_(value) << USBHS_HSTCTRL_RESET_Pos)) /* Assigment of value for RESET in the USBHS_HSTCTRL register */
#define USBHS_HSTCTRL_RESUME_Pos              _UINT32_(10)                                         /* (USBHS_HSTCTRL) Send USB Resume Position */
#define USBHS_HSTCTRL_RESUME_Msk              (_UINT32_(0x1) << USBHS_HSTCTRL_RESUME_Pos)          /* (USBHS_HSTCTRL) Send USB Resume Mask */
#define USBHS_HSTCTRL_RESUME(value)           (USBHS_HSTCTRL_RESUME_Msk & (_UINT32_(value) << USBHS_HSTCTRL_RESUME_Pos)) /* Assigment of value for RESUME in the USBHS_HSTCTRL register */
#define USBHS_HSTCTRL_SPDCONF_Pos             _UINT32_(12)                                         /* (USBHS_HSTCTRL) Mode Configuration Position */
#define USBHS_HSTCTRL_SPDCONF_Msk             (_UINT32_(0x3) << USBHS_HSTCTRL_SPDCONF_Pos)         /* (USBHS_HSTCTRL) Mode Configuration Mask */
#define USBHS_HSTCTRL_SPDCONF(value)          (USBHS_HSTCTRL_SPDCONF_Msk & (_UINT32_(value) << USBHS_HSTCTRL_SPDCONF_Pos)) /* Assigment of value for SPDCONF in the USBHS_HSTCTRL register */
#define   USBHS_HSTCTRL_SPDCONF_NORMAL_Val    _UINT32_(0x0)                                        /* (USBHS_HSTCTRL) The host starts in Full-speed mode and performs a high-speed reset to switch to High-speed mode if the downstream peripheral is high-speed capable.  */
#define   USBHS_HSTCTRL_SPDCONF_LOW_POWER_Val _UINT32_(0x1)                                        /* (USBHS_HSTCTRL) For a better consumption, if high speed is not needed.  */
#define   USBHS_HSTCTRL_SPDCONF_HIGH_SPEED_Val _UINT32_(0x2)                                        /* (USBHS_HSTCTRL) Forced high speed.  */
#define   USBHS_HSTCTRL_SPDCONF_FORCED_FS_Val _UINT32_(0x3)                                        /* (USBHS_HSTCTRL) The host remains in Full-speed mode whatever the peripheral speed capability.  */
#define USBHS_HSTCTRL_SPDCONF_NORMAL          (USBHS_HSTCTRL_SPDCONF_NORMAL_Val << USBHS_HSTCTRL_SPDCONF_Pos) /* (USBHS_HSTCTRL) The host starts in Full-speed mode and performs a high-speed reset to switch to High-speed mode if the downstream peripheral is high-speed capable. Position  */
#define USBHS_HSTCTRL_SPDCONF_LOW_POWER       (USBHS_HSTCTRL_SPDCONF_LOW_POWER_Val << USBHS_HSTCTRL_SPDCONF_Pos) /* (USBHS_HSTCTRL) For a better consumption, if high speed is not needed. Position  */
#define USBHS_HSTCTRL_SPDCONF_HIGH_SPEED      (USBHS_HSTCTRL_SPDCONF_HIGH_SPEED_Val << USBHS_HSTCTRL_SPDCONF_Pos) /* (USBHS_HSTCTRL) Forced high speed. Position  */
#define USBHS_HSTCTRL_SPDCONF_FORCED_FS       (USBHS_HSTCTRL_SPDCONF_FORCED_FS_Val << USBHS_HSTCTRL_SPDCONF_Pos) /* (USBHS_HSTCTRL) The host remains in Full-speed mode whatever the peripheral speed capability. Position  */
#define USBHS_HSTCTRL_Msk                     _UINT32_(0x00003700)                                 /* (USBHS_HSTCTRL) Register Mask  */


/* -------- USBHS_HSTISR : (USBHS Offset: 0x404) ( R/ 32) Host Global Interrupt Status Register -------- */
#define USBHS_HSTISR_DCONNI_Pos               _UINT32_(0)                                          /* (USBHS_HSTISR) Device Connection Interrupt Position */
#define USBHS_HSTISR_DCONNI_Msk               (_UINT32_(0x1) << USBHS_HSTISR_DCONNI_Pos)           /* (USBHS_HSTISR) Device Connection Interrupt Mask */
#define USBHS_HSTISR_DCONNI(value)            (USBHS_HSTISR_DCONNI_Msk & (_UINT32_(value) << USBHS_HSTISR_DCONNI_Pos)) /* Assigment of value for DCONNI in the USBHS_HSTISR register */
#define USBHS_HSTISR_DDISCI_Pos               _UINT32_(1)                                          /* (USBHS_HSTISR) Device Disconnection Interrupt Position */
#define USBHS_HSTISR_DDISCI_Msk               (_UINT32_(0x1) << USBHS_HSTISR_DDISCI_Pos)           /* (USBHS_HSTISR) Device Disconnection Interrupt Mask */
#define USBHS_HSTISR_DDISCI(value)            (USBHS_HSTISR_DDISCI_Msk & (_UINT32_(value) << USBHS_HSTISR_DDISCI_Pos)) /* Assigment of value for DDISCI in the USBHS_HSTISR register */
#define USBHS_HSTISR_RSTI_Pos                 _UINT32_(2)                                          /* (USBHS_HSTISR) USB Reset Sent Interrupt Position */
#define USBHS_HSTISR_RSTI_Msk                 (_UINT32_(0x1) << USBHS_HSTISR_RSTI_Pos)             /* (USBHS_HSTISR) USB Reset Sent Interrupt Mask */
#define USBHS_HSTISR_RSTI(value)              (USBHS_HSTISR_RSTI_Msk & (_UINT32_(value) << USBHS_HSTISR_RSTI_Pos)) /* Assigment of value for RSTI in the USBHS_HSTISR register */
#define USBHS_HSTISR_RSMEDI_Pos               _UINT32_(3)                                          /* (USBHS_HSTISR) Downstream Resume Sent Interrupt Position */
#define USBHS_HSTISR_RSMEDI_Msk               (_UINT32_(0x1) << USBHS_HSTISR_RSMEDI_Pos)           /* (USBHS_HSTISR) Downstream Resume Sent Interrupt Mask */
#define USBHS_HSTISR_RSMEDI(value)            (USBHS_HSTISR_RSMEDI_Msk & (_UINT32_(value) << USBHS_HSTISR_RSMEDI_Pos)) /* Assigment of value for RSMEDI in the USBHS_HSTISR register */
#define USBHS_HSTISR_RXRSMI_Pos               _UINT32_(4)                                          /* (USBHS_HSTISR) Upstream Resume Received Interrupt Position */
#define USBHS_HSTISR_RXRSMI_Msk               (_UINT32_(0x1) << USBHS_HSTISR_RXRSMI_Pos)           /* (USBHS_HSTISR) Upstream Resume Received Interrupt Mask */
#define USBHS_HSTISR_RXRSMI(value)            (USBHS_HSTISR_RXRSMI_Msk & (_UINT32_(value) << USBHS_HSTISR_RXRSMI_Pos)) /* Assigment of value for RXRSMI in the USBHS_HSTISR register */
#define USBHS_HSTISR_HSOFI_Pos                _UINT32_(5)                                          /* (USBHS_HSTISR) Host Start of Frame Interrupt Position */
#define USBHS_HSTISR_HSOFI_Msk                (_UINT32_(0x1) << USBHS_HSTISR_HSOFI_Pos)            /* (USBHS_HSTISR) Host Start of Frame Interrupt Mask */
#define USBHS_HSTISR_HSOFI(value)             (USBHS_HSTISR_HSOFI_Msk & (_UINT32_(value) << USBHS_HSTISR_HSOFI_Pos)) /* Assigment of value for HSOFI in the USBHS_HSTISR register */
#define USBHS_HSTISR_HWUPI_Pos                _UINT32_(6)                                          /* (USBHS_HSTISR) Host Wake-Up Interrupt Position */
#define USBHS_HSTISR_HWUPI_Msk                (_UINT32_(0x1) << USBHS_HSTISR_HWUPI_Pos)            /* (USBHS_HSTISR) Host Wake-Up Interrupt Mask */
#define USBHS_HSTISR_HWUPI(value)             (USBHS_HSTISR_HWUPI_Msk & (_UINT32_(value) << USBHS_HSTISR_HWUPI_Pos)) /* Assigment of value for HWUPI in the USBHS_HSTISR register */
#define USBHS_HSTISR_PEP_0_Pos                _UINT32_(8)                                          /* (USBHS_HSTISR) Pipe 0 Interrupt Position */
#define USBHS_HSTISR_PEP_0_Msk                (_UINT32_(0x1) << USBHS_HSTISR_PEP_0_Pos)            /* (USBHS_HSTISR) Pipe 0 Interrupt Mask */
#define USBHS_HSTISR_PEP_0(value)             (USBHS_HSTISR_PEP_0_Msk & (_UINT32_(value) << USBHS_HSTISR_PEP_0_Pos)) /* Assigment of value for PEP_0 in the USBHS_HSTISR register */
#define USBHS_HSTISR_PEP_1_Pos                _UINT32_(9)                                          /* (USBHS_HSTISR) Pipe 1 Interrupt Position */
#define USBHS_HSTISR_PEP_1_Msk                (_UINT32_(0x1) << USBHS_HSTISR_PEP_1_Pos)            /* (USBHS_HSTISR) Pipe 1 Interrupt Mask */
#define USBHS_HSTISR_PEP_1(value)             (USBHS_HSTISR_PEP_1_Msk & (_UINT32_(value) << USBHS_HSTISR_PEP_1_Pos)) /* Assigment of value for PEP_1 in the USBHS_HSTISR register */
#define USBHS_HSTISR_PEP_2_Pos                _UINT32_(10)                                         /* (USBHS_HSTISR) Pipe 2 Interrupt Position */
#define USBHS_HSTISR_PEP_2_Msk                (_UINT32_(0x1) << USBHS_HSTISR_PEP_2_Pos)            /* (USBHS_HSTISR) Pipe 2 Interrupt Mask */
#define USBHS_HSTISR_PEP_2(value)             (USBHS_HSTISR_PEP_2_Msk & (_UINT32_(value) << USBHS_HSTISR_PEP_2_Pos)) /* Assigment of value for PEP_2 in the USBHS_HSTISR register */
#define USBHS_HSTISR_PEP_3_Pos                _UINT32_(11)                                         /* (USBHS_HSTISR) Pipe 3 Interrupt Position */
#define USBHS_HSTISR_PEP_3_Msk                (_UINT32_(0x1) << USBHS_HSTISR_PEP_3_Pos)            /* (USBHS_HSTISR) Pipe 3 Interrupt Mask */
#define USBHS_HSTISR_PEP_3(value)             (USBHS_HSTISR_PEP_3_Msk & (_UINT32_(value) << USBHS_HSTISR_PEP_3_Pos)) /* Assigment of value for PEP_3 in the USBHS_HSTISR register */
#define USBHS_HSTISR_PEP_4_Pos                _UINT32_(12)                                         /* (USBHS_HSTISR) Pipe 4 Interrupt Position */
#define USBHS_HSTISR_PEP_4_Msk                (_UINT32_(0x1) << USBHS_HSTISR_PEP_4_Pos)            /* (USBHS_HSTISR) Pipe 4 Interrupt Mask */
#define USBHS_HSTISR_PEP_4(value)             (USBHS_HSTISR_PEP_4_Msk & (_UINT32_(value) << USBHS_HSTISR_PEP_4_Pos)) /* Assigment of value for PEP_4 in the USBHS_HSTISR register */
#define USBHS_HSTISR_PEP_5_Pos                _UINT32_(13)                                         /* (USBHS_HSTISR) Pipe 5 Interrupt Position */
#define USBHS_HSTISR_PEP_5_Msk                (_UINT32_(0x1) << USBHS_HSTISR_PEP_5_Pos)            /* (USBHS_HSTISR) Pipe 5 Interrupt Mask */
#define USBHS_HSTISR_PEP_5(value)             (USBHS_HSTISR_PEP_5_Msk & (_UINT32_(value) << USBHS_HSTISR_PEP_5_Pos)) /* Assigment of value for PEP_5 in the USBHS_HSTISR register */
#define USBHS_HSTISR_PEP_6_Pos                _UINT32_(14)                                         /* (USBHS_HSTISR) Pipe 6 Interrupt Position */
#define USBHS_HSTISR_PEP_6_Msk                (_UINT32_(0x1) << USBHS_HSTISR_PEP_6_Pos)            /* (USBHS_HSTISR) Pipe 6 Interrupt Mask */
#define USBHS_HSTISR_PEP_6(value)             (USBHS_HSTISR_PEP_6_Msk & (_UINT32_(value) << USBHS_HSTISR_PEP_6_Pos)) /* Assigment of value for PEP_6 in the USBHS_HSTISR register */
#define USBHS_HSTISR_PEP_7_Pos                _UINT32_(15)                                         /* (USBHS_HSTISR) Pipe 7 Interrupt Position */
#define USBHS_HSTISR_PEP_7_Msk                (_UINT32_(0x1) << USBHS_HSTISR_PEP_7_Pos)            /* (USBHS_HSTISR) Pipe 7 Interrupt Mask */
#define USBHS_HSTISR_PEP_7(value)             (USBHS_HSTISR_PEP_7_Msk & (_UINT32_(value) << USBHS_HSTISR_PEP_7_Pos)) /* Assigment of value for PEP_7 in the USBHS_HSTISR register */
#define USBHS_HSTISR_PEP_8_Pos                _UINT32_(16)                                         /* (USBHS_HSTISR) Pipe 8 Interrupt Position */
#define USBHS_HSTISR_PEP_8_Msk                (_UINT32_(0x1) << USBHS_HSTISR_PEP_8_Pos)            /* (USBHS_HSTISR) Pipe 8 Interrupt Mask */
#define USBHS_HSTISR_PEP_8(value)             (USBHS_HSTISR_PEP_8_Msk & (_UINT32_(value) << USBHS_HSTISR_PEP_8_Pos)) /* Assigment of value for PEP_8 in the USBHS_HSTISR register */
#define USBHS_HSTISR_PEP_9_Pos                _UINT32_(17)                                         /* (USBHS_HSTISR) Pipe 9 Interrupt Position */
#define USBHS_HSTISR_PEP_9_Msk                (_UINT32_(0x1) << USBHS_HSTISR_PEP_9_Pos)            /* (USBHS_HSTISR) Pipe 9 Interrupt Mask */
#define USBHS_HSTISR_PEP_9(value)             (USBHS_HSTISR_PEP_9_Msk & (_UINT32_(value) << USBHS_HSTISR_PEP_9_Pos)) /* Assigment of value for PEP_9 in the USBHS_HSTISR register */
#define USBHS_HSTISR_DMA_1_Pos                _UINT32_(25)                                         /* (USBHS_HSTISR) DMA Channel 0 Interrupt Position */
#define USBHS_HSTISR_DMA_1_Msk                (_UINT32_(0x1) << USBHS_HSTISR_DMA_1_Pos)            /* (USBHS_HSTISR) DMA Channel 0 Interrupt Mask */
#define USBHS_HSTISR_DMA_1(value)             (USBHS_HSTISR_DMA_1_Msk & (_UINT32_(value) << USBHS_HSTISR_DMA_1_Pos)) /* Assigment of value for DMA_1 in the USBHS_HSTISR register */
#define USBHS_HSTISR_DMA_2_Pos                _UINT32_(26)                                         /* (USBHS_HSTISR) DMA Channel 1 Interrupt Position */
#define USBHS_HSTISR_DMA_2_Msk                (_UINT32_(0x1) << USBHS_HSTISR_DMA_2_Pos)            /* (USBHS_HSTISR) DMA Channel 1 Interrupt Mask */
#define USBHS_HSTISR_DMA_2(value)             (USBHS_HSTISR_DMA_2_Msk & (_UINT32_(value) << USBHS_HSTISR_DMA_2_Pos)) /* Assigment of value for DMA_2 in the USBHS_HSTISR register */
#define USBHS_HSTISR_DMA_3_Pos                _UINT32_(27)                                         /* (USBHS_HSTISR) DMA Channel 2 Interrupt Position */
#define USBHS_HSTISR_DMA_3_Msk                (_UINT32_(0x1) << USBHS_HSTISR_DMA_3_Pos)            /* (USBHS_HSTISR) DMA Channel 2 Interrupt Mask */
#define USBHS_HSTISR_DMA_3(value)             (USBHS_HSTISR_DMA_3_Msk & (_UINT32_(value) << USBHS_HSTISR_DMA_3_Pos)) /* Assigment of value for DMA_3 in the USBHS_HSTISR register */
#define USBHS_HSTISR_DMA_4_Pos                _UINT32_(28)                                         /* (USBHS_HSTISR) DMA Channel 3 Interrupt Position */
#define USBHS_HSTISR_DMA_4_Msk                (_UINT32_(0x1) << USBHS_HSTISR_DMA_4_Pos)            /* (USBHS_HSTISR) DMA Channel 3 Interrupt Mask */
#define USBHS_HSTISR_DMA_4(value)             (USBHS_HSTISR_DMA_4_Msk & (_UINT32_(value) << USBHS_HSTISR_DMA_4_Pos)) /* Assigment of value for DMA_4 in the USBHS_HSTISR register */
#define USBHS_HSTISR_DMA_5_Pos                _UINT32_(29)                                         /* (USBHS_HSTISR) DMA Channel 4 Interrupt Position */
#define USBHS_HSTISR_DMA_5_Msk                (_UINT32_(0x1) << USBHS_HSTISR_DMA_5_Pos)            /* (USBHS_HSTISR) DMA Channel 4 Interrupt Mask */
#define USBHS_HSTISR_DMA_5(value)             (USBHS_HSTISR_DMA_5_Msk & (_UINT32_(value) << USBHS_HSTISR_DMA_5_Pos)) /* Assigment of value for DMA_5 in the USBHS_HSTISR register */
#define USBHS_HSTISR_DMA_6_Pos                _UINT32_(30)                                         /* (USBHS_HSTISR) DMA Channel 5 Interrupt Position */
#define USBHS_HSTISR_DMA_6_Msk                (_UINT32_(0x1) << USBHS_HSTISR_DMA_6_Pos)            /* (USBHS_HSTISR) DMA Channel 5 Interrupt Mask */
#define USBHS_HSTISR_DMA_6(value)             (USBHS_HSTISR_DMA_6_Msk & (_UINT32_(value) << USBHS_HSTISR_DMA_6_Pos)) /* Assigment of value for DMA_6 in the USBHS_HSTISR register */
#define USBHS_HSTISR_DMA_7_Pos                _UINT32_(31)                                         /* (USBHS_HSTISR) DMA Channel 6 Interrupt Position */
#define USBHS_HSTISR_DMA_7_Msk                (_UINT32_(0x1) << USBHS_HSTISR_DMA_7_Pos)            /* (USBHS_HSTISR) DMA Channel 6 Interrupt Mask */
#define USBHS_HSTISR_DMA_7(value)             (USBHS_HSTISR_DMA_7_Msk & (_UINT32_(value) << USBHS_HSTISR_DMA_7_Pos)) /* Assigment of value for DMA_7 in the USBHS_HSTISR register */
#define USBHS_HSTISR_Msk                      _UINT32_(0xFE03FF7F)                                 /* (USBHS_HSTISR) Register Mask  */

