Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/usbhs.h
#define USBHS_HSTISR_PEP__Pos                 _UINT32_(8)                                          /* (USBHS_HSTISR Position) Pipe x Interrupt */
#define USBHS_HSTISR_PEP__Msk                 (_UINT32_(0x3FF) << USBHS_HSTISR_PEP__Pos)           /* (USBHS_HSTISR Mask) PEP_ */
#define USBHS_HSTISR_PEP_(value)              (USBHS_HSTISR_PEP__Msk & (_UINT32_(value) << USBHS_HSTISR_PEP__Pos)) 
#define USBHS_HSTISR_DMA__Pos                 _UINT32_(25)                                         /* (USBHS_HSTISR Position) DMA Channel 6 Interrupt */
#define USBHS_HSTISR_DMA__Msk                 (_UINT32_(0x7F) << USBHS_HSTISR_DMA__Pos)            /* (USBHS_HSTISR Mask) DMA_ */
#define USBHS_HSTISR_DMA_(value)              (USBHS_HSTISR_DMA__Msk & (_UINT32_(value) << USBHS_HSTISR_DMA__Pos)) 

/* -------- USBHS_HSTICR : (USBHS Offset: 0x408) ( /W 32) Host Global Interrupt Clear Register -------- */
#define USBHS_HSTICR_DCONNIC_Pos              _UINT32_(0)                                          /* (USBHS_HSTICR) Device Connection Interrupt Clear Position */
#define USBHS_HSTICR_DCONNIC_Msk              (_UINT32_(0x1) << USBHS_HSTICR_DCONNIC_Pos)          /* (USBHS_HSTICR) Device Connection Interrupt Clear Mask */
#define USBHS_HSTICR_DCONNIC(value)           (USBHS_HSTICR_DCONNIC_Msk & (_UINT32_(value) << USBHS_HSTICR_DCONNIC_Pos)) /* Assigment of value for DCONNIC in the USBHS_HSTICR register */
#define USBHS_HSTICR_DDISCIC_Pos              _UINT32_(1)                                          /* (USBHS_HSTICR) Device Disconnection Interrupt Clear Position */
#define USBHS_HSTICR_DDISCIC_Msk              (_UINT32_(0x1) << USBHS_HSTICR_DDISCIC_Pos)          /* (USBHS_HSTICR) Device Disconnection Interrupt Clear Mask */
#define USBHS_HSTICR_DDISCIC(value)           (USBHS_HSTICR_DDISCIC_Msk & (_UINT32_(value) << USBHS_HSTICR_DDISCIC_Pos)) /* Assigment of value for DDISCIC in the USBHS_HSTICR register */
#define USBHS_HSTICR_RSTIC_Pos                _UINT32_(2)                                          /* (USBHS_HSTICR) USB Reset Sent Interrupt Clear Position */
#define USBHS_HSTICR_RSTIC_Msk                (_UINT32_(0x1) << USBHS_HSTICR_RSTIC_Pos)            /* (USBHS_HSTICR) USB Reset Sent Interrupt Clear Mask */
#define USBHS_HSTICR_RSTIC(value)             (USBHS_HSTICR_RSTIC_Msk & (_UINT32_(value) << USBHS_HSTICR_RSTIC_Pos)) /* Assigment of value for RSTIC in the USBHS_HSTICR register */
#define USBHS_HSTICR_RSMEDIC_Pos              _UINT32_(3)                                          /* (USBHS_HSTICR) Downstream Resume Sent Interrupt Clear Position */
#define USBHS_HSTICR_RSMEDIC_Msk              (_UINT32_(0x1) << USBHS_HSTICR_RSMEDIC_Pos)          /* (USBHS_HSTICR) Downstream Resume Sent Interrupt Clear Mask */
#define USBHS_HSTICR_RSMEDIC(value)           (USBHS_HSTICR_RSMEDIC_Msk & (_UINT32_(value) << USBHS_HSTICR_RSMEDIC_Pos)) /* Assigment of value for RSMEDIC in the USBHS_HSTICR register */
#define USBHS_HSTICR_RXRSMIC_Pos              _UINT32_(4)                                          /* (USBHS_HSTICR) Upstream Resume Received Interrupt Clear Position */
#define USBHS_HSTICR_RXRSMIC_Msk              (_UINT32_(0x1) << USBHS_HSTICR_RXRSMIC_Pos)          /* (USBHS_HSTICR) Upstream Resume Received Interrupt Clear Mask */
#define USBHS_HSTICR_RXRSMIC(value)           (USBHS_HSTICR_RXRSMIC_Msk & (_UINT32_(value) << USBHS_HSTICR_RXRSMIC_Pos)) /* Assigment of value for RXRSMIC in the USBHS_HSTICR register */
#define USBHS_HSTICR_HSOFIC_Pos               _UINT32_(5)                                          /* (USBHS_HSTICR) Host Start of Frame Interrupt Clear Position */
#define USBHS_HSTICR_HSOFIC_Msk               (_UINT32_(0x1) << USBHS_HSTICR_HSOFIC_Pos)           /* (USBHS_HSTICR) Host Start of Frame Interrupt Clear Mask */
#define USBHS_HSTICR_HSOFIC(value)            (USBHS_HSTICR_HSOFIC_Msk & (_UINT32_(value) << USBHS_HSTICR_HSOFIC_Pos)) /* Assigment of value for HSOFIC in the USBHS_HSTICR register */
#define USBHS_HSTICR_HWUPIC_Pos               _UINT32_(6)                                          /* (USBHS_HSTICR) Host Wake-Up Interrupt Clear Position */
#define USBHS_HSTICR_HWUPIC_Msk               (_UINT32_(0x1) << USBHS_HSTICR_HWUPIC_Pos)           /* (USBHS_HSTICR) Host Wake-Up Interrupt Clear Mask */
#define USBHS_HSTICR_HWUPIC(value)            (USBHS_HSTICR_HWUPIC_Msk & (_UINT32_(value) << USBHS_HSTICR_HWUPIC_Pos)) /* Assigment of value for HWUPIC in the USBHS_HSTICR register */
#define USBHS_HSTICR_Msk                      _UINT32_(0x0000007F)                                 /* (USBHS_HSTICR) Register Mask  */


/* -------- USBHS_HSTIFR : (USBHS Offset: 0x40C) ( /W 32) Host Global Interrupt Set Register -------- */
#define USBHS_HSTIFR_DCONNIS_Pos              _UINT32_(0)                                          /* (USBHS_HSTIFR) Device Connection Interrupt Set Position */
#define USBHS_HSTIFR_DCONNIS_Msk              (_UINT32_(0x1) << USBHS_HSTIFR_DCONNIS_Pos)          /* (USBHS_HSTIFR) Device Connection Interrupt Set Mask */
#define USBHS_HSTIFR_DCONNIS(value)           (USBHS_HSTIFR_DCONNIS_Msk & (_UINT32_(value) << USBHS_HSTIFR_DCONNIS_Pos)) /* Assigment of value for DCONNIS in the USBHS_HSTIFR register */
#define USBHS_HSTIFR_DDISCIS_Pos              _UINT32_(1)                                          /* (USBHS_HSTIFR) Device Disconnection Interrupt Set Position */
#define USBHS_HSTIFR_DDISCIS_Msk              (_UINT32_(0x1) << USBHS_HSTIFR_DDISCIS_Pos)          /* (USBHS_HSTIFR) Device Disconnection Interrupt Set Mask */
#define USBHS_HSTIFR_DDISCIS(value)           (USBHS_HSTIFR_DDISCIS_Msk & (_UINT32_(value) << USBHS_HSTIFR_DDISCIS_Pos)) /* Assigment of value for DDISCIS in the USBHS_HSTIFR register */
#define USBHS_HSTIFR_RSTIS_Pos                _UINT32_(2)                                          /* (USBHS_HSTIFR) USB Reset Sent Interrupt Set Position */
#define USBHS_HSTIFR_RSTIS_Msk                (_UINT32_(0x1) << USBHS_HSTIFR_RSTIS_Pos)            /* (USBHS_HSTIFR) USB Reset Sent Interrupt Set Mask */
#define USBHS_HSTIFR_RSTIS(value)             (USBHS_HSTIFR_RSTIS_Msk & (_UINT32_(value) << USBHS_HSTIFR_RSTIS_Pos)) /* Assigment of value for RSTIS in the USBHS_HSTIFR register */
#define USBHS_HSTIFR_RSMEDIS_Pos              _UINT32_(3)                                          /* (USBHS_HSTIFR) Downstream Resume Sent Interrupt Set Position */
#define USBHS_HSTIFR_RSMEDIS_Msk              (_UINT32_(0x1) << USBHS_HSTIFR_RSMEDIS_Pos)          /* (USBHS_HSTIFR) Downstream Resume Sent Interrupt Set Mask */
#define USBHS_HSTIFR_RSMEDIS(value)           (USBHS_HSTIFR_RSMEDIS_Msk & (_UINT32_(value) << USBHS_HSTIFR_RSMEDIS_Pos)) /* Assigment of value for RSMEDIS in the USBHS_HSTIFR register */
#define USBHS_HSTIFR_RXRSMIS_Pos              _UINT32_(4)                                          /* (USBHS_HSTIFR) Upstream Resume Received Interrupt Set Position */
#define USBHS_HSTIFR_RXRSMIS_Msk              (_UINT32_(0x1) << USBHS_HSTIFR_RXRSMIS_Pos)          /* (USBHS_HSTIFR) Upstream Resume Received Interrupt Set Mask */
#define USBHS_HSTIFR_RXRSMIS(value)           (USBHS_HSTIFR_RXRSMIS_Msk & (_UINT32_(value) << USBHS_HSTIFR_RXRSMIS_Pos)) /* Assigment of value for RXRSMIS in the USBHS_HSTIFR register */
#define USBHS_HSTIFR_HSOFIS_Pos               _UINT32_(5)                                          /* (USBHS_HSTIFR) Host Start of Frame Interrupt Set Position */
#define USBHS_HSTIFR_HSOFIS_Msk               (_UINT32_(0x1) << USBHS_HSTIFR_HSOFIS_Pos)           /* (USBHS_HSTIFR) Host Start of Frame Interrupt Set Mask */
#define USBHS_HSTIFR_HSOFIS(value)            (USBHS_HSTIFR_HSOFIS_Msk & (_UINT32_(value) << USBHS_HSTIFR_HSOFIS_Pos)) /* Assigment of value for HSOFIS in the USBHS_HSTIFR register */
#define USBHS_HSTIFR_HWUPIS_Pos               _UINT32_(6)                                          /* (USBHS_HSTIFR) Host Wake-Up Interrupt Set Position */
#define USBHS_HSTIFR_HWUPIS_Msk               (_UINT32_(0x1) << USBHS_HSTIFR_HWUPIS_Pos)           /* (USBHS_HSTIFR) Host Wake-Up Interrupt Set Mask */
#define USBHS_HSTIFR_HWUPIS(value)            (USBHS_HSTIFR_HWUPIS_Msk & (_UINT32_(value) << USBHS_HSTIFR_HWUPIS_Pos)) /* Assigment of value for HWUPIS in the USBHS_HSTIFR register */
#define USBHS_HSTIFR_DMA_1_Pos                _UINT32_(25)                                         /* (USBHS_HSTIFR) DMA Channel 0 Interrupt Set Position */
#define USBHS_HSTIFR_DMA_1_Msk                (_UINT32_(0x1) << USBHS_HSTIFR_DMA_1_Pos)            /* (USBHS_HSTIFR) DMA Channel 0 Interrupt Set Mask */
#define USBHS_HSTIFR_DMA_1(value)             (USBHS_HSTIFR_DMA_1_Msk & (_UINT32_(value) << USBHS_HSTIFR_DMA_1_Pos)) /* Assigment of value for DMA_1 in the USBHS_HSTIFR register */
#define USBHS_HSTIFR_DMA_2_Pos                _UINT32_(26)                                         /* (USBHS_HSTIFR) DMA Channel 1 Interrupt Set Position */
#define USBHS_HSTIFR_DMA_2_Msk                (_UINT32_(0x1) << USBHS_HSTIFR_DMA_2_Pos)            /* (USBHS_HSTIFR) DMA Channel 1 Interrupt Set Mask */
#define USBHS_HSTIFR_DMA_2(value)             (USBHS_HSTIFR_DMA_2_Msk & (_UINT32_(value) << USBHS_HSTIFR_DMA_2_Pos)) /* Assigment of value for DMA_2 in the USBHS_HSTIFR register */
#define USBHS_HSTIFR_DMA_3_Pos                _UINT32_(27)                                         /* (USBHS_HSTIFR) DMA Channel 2 Interrupt Set Position */
#define USBHS_HSTIFR_DMA_3_Msk                (_UINT32_(0x1) << USBHS_HSTIFR_DMA_3_Pos)            /* (USBHS_HSTIFR) DMA Channel 2 Interrupt Set Mask */
#define USBHS_HSTIFR_DMA_3(value)             (USBHS_HSTIFR_DMA_3_Msk & (_UINT32_(value) << USBHS_HSTIFR_DMA_3_Pos)) /* Assigment of value for DMA_3 in the USBHS_HSTIFR register */
#define USBHS_HSTIFR_DMA_4_Pos                _UINT32_(28)                                         /* (USBHS_HSTIFR) DMA Channel 3 Interrupt Set Position */
#define USBHS_HSTIFR_DMA_4_Msk                (_UINT32_(0x1) << USBHS_HSTIFR_DMA_4_Pos)            /* (USBHS_HSTIFR) DMA Channel 3 Interrupt Set Mask */
#define USBHS_HSTIFR_DMA_4(value)             (USBHS_HSTIFR_DMA_4_Msk & (_UINT32_(value) << USBHS_HSTIFR_DMA_4_Pos)) /* Assigment of value for DMA_4 in the USBHS_HSTIFR register */
#define USBHS_HSTIFR_DMA_5_Pos                _UINT32_(29)                                         /* (USBHS_HSTIFR) DMA Channel 4 Interrupt Set Position */
#define USBHS_HSTIFR_DMA_5_Msk                (_UINT32_(0x1) << USBHS_HSTIFR_DMA_5_Pos)            /* (USBHS_HSTIFR) DMA Channel 4 Interrupt Set Mask */
#define USBHS_HSTIFR_DMA_5(value)             (USBHS_HSTIFR_DMA_5_Msk & (_UINT32_(value) << USBHS_HSTIFR_DMA_5_Pos)) /* Assigment of value for DMA_5 in the USBHS_HSTIFR register */
#define USBHS_HSTIFR_DMA_6_Pos                _UINT32_(30)                                         /* (USBHS_HSTIFR) DMA Channel 5 Interrupt Set Position */
#define USBHS_HSTIFR_DMA_6_Msk                (_UINT32_(0x1) << USBHS_HSTIFR_DMA_6_Pos)            /* (USBHS_HSTIFR) DMA Channel 5 Interrupt Set Mask */
#define USBHS_HSTIFR_DMA_6(value)             (USBHS_HSTIFR_DMA_6_Msk & (_UINT32_(value) << USBHS_HSTIFR_DMA_6_Pos)) /* Assigment of value for DMA_6 in the USBHS_HSTIFR register */
#define USBHS_HSTIFR_DMA_7_Pos                _UINT32_(31)                                         /* (USBHS_HSTIFR) DMA Channel 6 Interrupt Set Position */
#define USBHS_HSTIFR_DMA_7_Msk                (_UINT32_(0x1) << USBHS_HSTIFR_DMA_7_Pos)            /* (USBHS_HSTIFR) DMA Channel 6 Interrupt Set Mask */
#define USBHS_HSTIFR_DMA_7(value)             (USBHS_HSTIFR_DMA_7_Msk & (_UINT32_(value) << USBHS_HSTIFR_DMA_7_Pos)) /* Assigment of value for DMA_7 in the USBHS_HSTIFR register */
#define USBHS_HSTIFR_Msk                      _UINT32_(0xFE00007F)                                 /* (USBHS_HSTIFR) Register Mask  */

