Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/usbhs.h
#define USBHS_HSTIFR_DMA__Pos                 _UINT32_(25)                                         /* (USBHS_HSTIFR Position) DMA Channel 6 Interrupt Set */
#define USBHS_HSTIFR_DMA__Msk                 (_UINT32_(0x7F) << USBHS_HSTIFR_DMA__Pos)            /* (USBHS_HSTIFR Mask) DMA_ */
#define USBHS_HSTIFR_DMA_(value)              (USBHS_HSTIFR_DMA__Msk & (_UINT32_(value) << USBHS_HSTIFR_DMA__Pos)) 

/* -------- USBHS_HSTIMR : (USBHS Offset: 0x410) ( R/ 32) Host Global Interrupt Mask Register -------- */
#define USBHS_HSTIMR_DCONNIE_Pos              _UINT32_(0)                                          /* (USBHS_HSTIMR) Device Connection Interrupt Enable Position */
#define USBHS_HSTIMR_DCONNIE_Msk              (_UINT32_(0x1) << USBHS_HSTIMR_DCONNIE_Pos)          /* (USBHS_HSTIMR) Device Connection Interrupt Enable Mask */
#define USBHS_HSTIMR_DCONNIE(value)           (USBHS_HSTIMR_DCONNIE_Msk & (_UINT32_(value) << USBHS_HSTIMR_DCONNIE_Pos)) /* Assigment of value for DCONNIE in the USBHS_HSTIMR register */
#define USBHS_HSTIMR_DDISCIE_Pos              _UINT32_(1)                                          /* (USBHS_HSTIMR) Device Disconnection Interrupt Enable Position */
#define USBHS_HSTIMR_DDISCIE_Msk              (_UINT32_(0x1) << USBHS_HSTIMR_DDISCIE_Pos)          /* (USBHS_HSTIMR) Device Disconnection Interrupt Enable Mask */
#define USBHS_HSTIMR_DDISCIE(value)           (USBHS_HSTIMR_DDISCIE_Msk & (_UINT32_(value) << USBHS_HSTIMR_DDISCIE_Pos)) /* Assigment of value for DDISCIE in the USBHS_HSTIMR register */
#define USBHS_HSTIMR_RSTIE_Pos                _UINT32_(2)                                          /* (USBHS_HSTIMR) USB Reset Sent Interrupt Enable Position */
#define USBHS_HSTIMR_RSTIE_Msk                (_UINT32_(0x1) << USBHS_HSTIMR_RSTIE_Pos)            /* (USBHS_HSTIMR) USB Reset Sent Interrupt Enable Mask */
#define USBHS_HSTIMR_RSTIE(value)             (USBHS_HSTIMR_RSTIE_Msk & (_UINT32_(value) << USBHS_HSTIMR_RSTIE_Pos)) /* Assigment of value for RSTIE in the USBHS_HSTIMR register */
#define USBHS_HSTIMR_RSMEDIE_Pos              _UINT32_(3)                                          /* (USBHS_HSTIMR) Downstream Resume Sent Interrupt Enable Position */
#define USBHS_HSTIMR_RSMEDIE_Msk              (_UINT32_(0x1) << USBHS_HSTIMR_RSMEDIE_Pos)          /* (USBHS_HSTIMR) Downstream Resume Sent Interrupt Enable Mask */
#define USBHS_HSTIMR_RSMEDIE(value)           (USBHS_HSTIMR_RSMEDIE_Msk & (_UINT32_(value) << USBHS_HSTIMR_RSMEDIE_Pos)) /* Assigment of value for RSMEDIE in the USBHS_HSTIMR register */
#define USBHS_HSTIMR_RXRSMIE_Pos              _UINT32_(4)                                          /* (USBHS_HSTIMR) Upstream Resume Received Interrupt Enable Position */
#define USBHS_HSTIMR_RXRSMIE_Msk              (_UINT32_(0x1) << USBHS_HSTIMR_RXRSMIE_Pos)          /* (USBHS_HSTIMR) Upstream Resume Received Interrupt Enable Mask */
#define USBHS_HSTIMR_RXRSMIE(value)           (USBHS_HSTIMR_RXRSMIE_Msk & (_UINT32_(value) << USBHS_HSTIMR_RXRSMIE_Pos)) /* Assigment of value for RXRSMIE in the USBHS_HSTIMR register */
#define USBHS_HSTIMR_HSOFIE_Pos               _UINT32_(5)                                          /* (USBHS_HSTIMR) Host Start of Frame Interrupt Enable Position */
#define USBHS_HSTIMR_HSOFIE_Msk               (_UINT32_(0x1) << USBHS_HSTIMR_HSOFIE_Pos)           /* (USBHS_HSTIMR) Host Start of Frame Interrupt Enable Mask */
#define USBHS_HSTIMR_HSOFIE(value)            (USBHS_HSTIMR_HSOFIE_Msk & (_UINT32_(value) << USBHS_HSTIMR_HSOFIE_Pos)) /* Assigment of value for HSOFIE in the USBHS_HSTIMR register */
#define USBHS_HSTIMR_HWUPIE_Pos               _UINT32_(6)                                          /* (USBHS_HSTIMR) Host Wake-Up Interrupt Enable Position */
#define USBHS_HSTIMR_HWUPIE_Msk               (_UINT32_(0x1) << USBHS_HSTIMR_HWUPIE_Pos)           /* (USBHS_HSTIMR) Host Wake-Up Interrupt Enable Mask */
#define USBHS_HSTIMR_HWUPIE(value)            (USBHS_HSTIMR_HWUPIE_Msk & (_UINT32_(value) << USBHS_HSTIMR_HWUPIE_Pos)) /* Assigment of value for HWUPIE in the USBHS_HSTIMR register */
#define USBHS_HSTIMR_PEP_0_Pos                _UINT32_(8)                                          /* (USBHS_HSTIMR) Pipe 0 Interrupt Enable Position */
#define USBHS_HSTIMR_PEP_0_Msk                (_UINT32_(0x1) << USBHS_HSTIMR_PEP_0_Pos)            /* (USBHS_HSTIMR) Pipe 0 Interrupt Enable Mask */
#define USBHS_HSTIMR_PEP_0(value)             (USBHS_HSTIMR_PEP_0_Msk & (_UINT32_(value) << USBHS_HSTIMR_PEP_0_Pos)) /* Assigment of value for PEP_0 in the USBHS_HSTIMR register */
#define USBHS_HSTIMR_PEP_1_Pos                _UINT32_(9)                                          /* (USBHS_HSTIMR) Pipe 1 Interrupt Enable Position */
#define USBHS_HSTIMR_PEP_1_Msk                (_UINT32_(0x1) << USBHS_HSTIMR_PEP_1_Pos)            /* (USBHS_HSTIMR) Pipe 1 Interrupt Enable Mask */
#define USBHS_HSTIMR_PEP_1(value)             (USBHS_HSTIMR_PEP_1_Msk & (_UINT32_(value) << USBHS_HSTIMR_PEP_1_Pos)) /* Assigment of value for PEP_1 in the USBHS_HSTIMR register */
#define USBHS_HSTIMR_PEP_2_Pos                _UINT32_(10)                                         /* (USBHS_HSTIMR) Pipe 2 Interrupt Enable Position */
#define USBHS_HSTIMR_PEP_2_Msk                (_UINT32_(0x1) << USBHS_HSTIMR_PEP_2_Pos)            /* (USBHS_HSTIMR) Pipe 2 Interrupt Enable Mask */
#define USBHS_HSTIMR_PEP_2(value)             (USBHS_HSTIMR_PEP_2_Msk & (_UINT32_(value) << USBHS_HSTIMR_PEP_2_Pos)) /* Assigment of value for PEP_2 in the USBHS_HSTIMR register */
#define USBHS_HSTIMR_PEP_3_Pos                _UINT32_(11)                                         /* (USBHS_HSTIMR) Pipe 3 Interrupt Enable Position */
#define USBHS_HSTIMR_PEP_3_Msk                (_UINT32_(0x1) << USBHS_HSTIMR_PEP_3_Pos)            /* (USBHS_HSTIMR) Pipe 3 Interrupt Enable Mask */
#define USBHS_HSTIMR_PEP_3(value)             (USBHS_HSTIMR_PEP_3_Msk & (_UINT32_(value) << USBHS_HSTIMR_PEP_3_Pos)) /* Assigment of value for PEP_3 in the USBHS_HSTIMR register */
#define USBHS_HSTIMR_PEP_4_Pos                _UINT32_(12)                                         /* (USBHS_HSTIMR) Pipe 4 Interrupt Enable Position */
#define USBHS_HSTIMR_PEP_4_Msk                (_UINT32_(0x1) << USBHS_HSTIMR_PEP_4_Pos)            /* (USBHS_HSTIMR) Pipe 4 Interrupt Enable Mask */
#define USBHS_HSTIMR_PEP_4(value)             (USBHS_HSTIMR_PEP_4_Msk & (_UINT32_(value) << USBHS_HSTIMR_PEP_4_Pos)) /* Assigment of value for PEP_4 in the USBHS_HSTIMR register */
#define USBHS_HSTIMR_PEP_5_Pos                _UINT32_(13)                                         /* (USBHS_HSTIMR) Pipe 5 Interrupt Enable Position */
#define USBHS_HSTIMR_PEP_5_Msk                (_UINT32_(0x1) << USBHS_HSTIMR_PEP_5_Pos)            /* (USBHS_HSTIMR) Pipe 5 Interrupt Enable Mask */
#define USBHS_HSTIMR_PEP_5(value)             (USBHS_HSTIMR_PEP_5_Msk & (_UINT32_(value) << USBHS_HSTIMR_PEP_5_Pos)) /* Assigment of value for PEP_5 in the USBHS_HSTIMR register */
#define USBHS_HSTIMR_PEP_6_Pos                _UINT32_(14)                                         /* (USBHS_HSTIMR) Pipe 6 Interrupt Enable Position */
#define USBHS_HSTIMR_PEP_6_Msk                (_UINT32_(0x1) << USBHS_HSTIMR_PEP_6_Pos)            /* (USBHS_HSTIMR) Pipe 6 Interrupt Enable Mask */
#define USBHS_HSTIMR_PEP_6(value)             (USBHS_HSTIMR_PEP_6_Msk & (_UINT32_(value) << USBHS_HSTIMR_PEP_6_Pos)) /* Assigment of value for PEP_6 in the USBHS_HSTIMR register */
#define USBHS_HSTIMR_PEP_7_Pos                _UINT32_(15)                                         /* (USBHS_HSTIMR) Pipe 7 Interrupt Enable Position */
#define USBHS_HSTIMR_PEP_7_Msk                (_UINT32_(0x1) << USBHS_HSTIMR_PEP_7_Pos)            /* (USBHS_HSTIMR) Pipe 7 Interrupt Enable Mask */
#define USBHS_HSTIMR_PEP_7(value)             (USBHS_HSTIMR_PEP_7_Msk & (_UINT32_(value) << USBHS_HSTIMR_PEP_7_Pos)) /* Assigment of value for PEP_7 in the USBHS_HSTIMR register */
#define USBHS_HSTIMR_PEP_8_Pos                _UINT32_(16)                                         /* (USBHS_HSTIMR) Pipe 8 Interrupt Enable Position */
#define USBHS_HSTIMR_PEP_8_Msk                (_UINT32_(0x1) << USBHS_HSTIMR_PEP_8_Pos)            /* (USBHS_HSTIMR) Pipe 8 Interrupt Enable Mask */
#define USBHS_HSTIMR_PEP_8(value)             (USBHS_HSTIMR_PEP_8_Msk & (_UINT32_(value) << USBHS_HSTIMR_PEP_8_Pos)) /* Assigment of value for PEP_8 in the USBHS_HSTIMR register */
#define USBHS_HSTIMR_PEP_9_Pos                _UINT32_(17)                                         /* (USBHS_HSTIMR) Pipe 9 Interrupt Enable Position */
#define USBHS_HSTIMR_PEP_9_Msk                (_UINT32_(0x1) << USBHS_HSTIMR_PEP_9_Pos)            /* (USBHS_HSTIMR) Pipe 9 Interrupt Enable Mask */
#define USBHS_HSTIMR_PEP_9(value)             (USBHS_HSTIMR_PEP_9_Msk & (_UINT32_(value) << USBHS_HSTIMR_PEP_9_Pos)) /* Assigment of value for PEP_9 in the USBHS_HSTIMR register */
#define USBHS_HSTIMR_DMA_1_Pos                _UINT32_(25)                                         /* (USBHS_HSTIMR) DMA Channel 0 Interrupt Enable Position */
#define USBHS_HSTIMR_DMA_1_Msk                (_UINT32_(0x1) << USBHS_HSTIMR_DMA_1_Pos)            /* (USBHS_HSTIMR) DMA Channel 0 Interrupt Enable Mask */
#define USBHS_HSTIMR_DMA_1(value)             (USBHS_HSTIMR_DMA_1_Msk & (_UINT32_(value) << USBHS_HSTIMR_DMA_1_Pos)) /* Assigment of value for DMA_1 in the USBHS_HSTIMR register */
#define USBHS_HSTIMR_DMA_2_Pos                _UINT32_(26)                                         /* (USBHS_HSTIMR) DMA Channel 1 Interrupt Enable Position */
#define USBHS_HSTIMR_DMA_2_Msk                (_UINT32_(0x1) << USBHS_HSTIMR_DMA_2_Pos)            /* (USBHS_HSTIMR) DMA Channel 1 Interrupt Enable Mask */
#define USBHS_HSTIMR_DMA_2(value)             (USBHS_HSTIMR_DMA_2_Msk & (_UINT32_(value) << USBHS_HSTIMR_DMA_2_Pos)) /* Assigment of value for DMA_2 in the USBHS_HSTIMR register */
#define USBHS_HSTIMR_DMA_3_Pos                _UINT32_(27)                                         /* (USBHS_HSTIMR) DMA Channel 2 Interrupt Enable Position */
#define USBHS_HSTIMR_DMA_3_Msk                (_UINT32_(0x1) << USBHS_HSTIMR_DMA_3_Pos)            /* (USBHS_HSTIMR) DMA Channel 2 Interrupt Enable Mask */
#define USBHS_HSTIMR_DMA_3(value)             (USBHS_HSTIMR_DMA_3_Msk & (_UINT32_(value) << USBHS_HSTIMR_DMA_3_Pos)) /* Assigment of value for DMA_3 in the USBHS_HSTIMR register */
#define USBHS_HSTIMR_DMA_4_Pos                _UINT32_(28)                                         /* (USBHS_HSTIMR) DMA Channel 3 Interrupt Enable Position */
#define USBHS_HSTIMR_DMA_4_Msk                (_UINT32_(0x1) << USBHS_HSTIMR_DMA_4_Pos)            /* (USBHS_HSTIMR) DMA Channel 3 Interrupt Enable Mask */
#define USBHS_HSTIMR_DMA_4(value)             (USBHS_HSTIMR_DMA_4_Msk & (_UINT32_(value) << USBHS_HSTIMR_DMA_4_Pos)) /* Assigment of value for DMA_4 in the USBHS_HSTIMR register */
#define USBHS_HSTIMR_DMA_5_Pos                _UINT32_(29)                                         /* (USBHS_HSTIMR) DMA Channel 4 Interrupt Enable Position */
#define USBHS_HSTIMR_DMA_5_Msk                (_UINT32_(0x1) << USBHS_HSTIMR_DMA_5_Pos)            /* (USBHS_HSTIMR) DMA Channel 4 Interrupt Enable Mask */
#define USBHS_HSTIMR_DMA_5(value)             (USBHS_HSTIMR_DMA_5_Msk & (_UINT32_(value) << USBHS_HSTIMR_DMA_5_Pos)) /* Assigment of value for DMA_5 in the USBHS_HSTIMR register */
#define USBHS_HSTIMR_DMA_6_Pos                _UINT32_(30)                                         /* (USBHS_HSTIMR) DMA Channel 5 Interrupt Enable Position */
#define USBHS_HSTIMR_DMA_6_Msk                (_UINT32_(0x1) << USBHS_HSTIMR_DMA_6_Pos)            /* (USBHS_HSTIMR) DMA Channel 5 Interrupt Enable Mask */
#define USBHS_HSTIMR_DMA_6(value)             (USBHS_HSTIMR_DMA_6_Msk & (_UINT32_(value) << USBHS_HSTIMR_DMA_6_Pos)) /* Assigment of value for DMA_6 in the USBHS_HSTIMR register */
#define USBHS_HSTIMR_DMA_7_Pos                _UINT32_(31)                                         /* (USBHS_HSTIMR) DMA Channel 6 Interrupt Enable Position */
#define USBHS_HSTIMR_DMA_7_Msk                (_UINT32_(0x1) << USBHS_HSTIMR_DMA_7_Pos)            /* (USBHS_HSTIMR) DMA Channel 6 Interrupt Enable Mask */
#define USBHS_HSTIMR_DMA_7(value)             (USBHS_HSTIMR_DMA_7_Msk & (_UINT32_(value) << USBHS_HSTIMR_DMA_7_Pos)) /* Assigment of value for DMA_7 in the USBHS_HSTIMR register */
#define USBHS_HSTIMR_Msk                      _UINT32_(0xFE03FF7F)                                 /* (USBHS_HSTIMR) Register Mask  */

