Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/usbhs.h
#define USBHS_HSTIMR_PEP__Pos                 _UINT32_(8)                                          /* (USBHS_HSTIMR Position) Pipe x Interrupt Enable */
#define USBHS_HSTIMR_PEP__Msk                 (_UINT32_(0x3FF) << USBHS_HSTIMR_PEP__Pos)           /* (USBHS_HSTIMR Mask) PEP_ */
#define USBHS_HSTIMR_PEP_(value)              (USBHS_HSTIMR_PEP__Msk & (_UINT32_(value) << USBHS_HSTIMR_PEP__Pos)) 
#define USBHS_HSTIMR_DMA__Pos                 _UINT32_(25)                                         /* (USBHS_HSTIMR Position) DMA Channel 6 Interrupt Enable */
#define USBHS_HSTIMR_DMA__Msk                 (_UINT32_(0x7F) << USBHS_HSTIMR_DMA__Pos)            /* (USBHS_HSTIMR Mask) DMA_ */
#define USBHS_HSTIMR_DMA_(value)              (USBHS_HSTIMR_DMA__Msk & (_UINT32_(value) << USBHS_HSTIMR_DMA__Pos)) 

/* -------- USBHS_HSTIDR : (USBHS Offset: 0x414) ( /W 32) Host Global Interrupt Disable Register -------- */
#define USBHS_HSTIDR_DCONNIEC_Pos             _UINT32_(0)                                          /* (USBHS_HSTIDR) Device Connection Interrupt Disable Position */
#define USBHS_HSTIDR_DCONNIEC_Msk             (_UINT32_(0x1) << USBHS_HSTIDR_DCONNIEC_Pos)         /* (USBHS_HSTIDR) Device Connection Interrupt Disable Mask */
#define USBHS_HSTIDR_DCONNIEC(value)          (USBHS_HSTIDR_DCONNIEC_Msk & (_UINT32_(value) << USBHS_HSTIDR_DCONNIEC_Pos)) /* Assigment of value for DCONNIEC in the USBHS_HSTIDR register */
#define USBHS_HSTIDR_DDISCIEC_Pos             _UINT32_(1)                                          /* (USBHS_HSTIDR) Device Disconnection Interrupt Disable Position */
#define USBHS_HSTIDR_DDISCIEC_Msk             (_UINT32_(0x1) << USBHS_HSTIDR_DDISCIEC_Pos)         /* (USBHS_HSTIDR) Device Disconnection Interrupt Disable Mask */
#define USBHS_HSTIDR_DDISCIEC(value)          (USBHS_HSTIDR_DDISCIEC_Msk & (_UINT32_(value) << USBHS_HSTIDR_DDISCIEC_Pos)) /* Assigment of value for DDISCIEC in the USBHS_HSTIDR register */
#define USBHS_HSTIDR_RSTIEC_Pos               _UINT32_(2)                                          /* (USBHS_HSTIDR) USB Reset Sent Interrupt Disable Position */
#define USBHS_HSTIDR_RSTIEC_Msk               (_UINT32_(0x1) << USBHS_HSTIDR_RSTIEC_Pos)           /* (USBHS_HSTIDR) USB Reset Sent Interrupt Disable Mask */
#define USBHS_HSTIDR_RSTIEC(value)            (USBHS_HSTIDR_RSTIEC_Msk & (_UINT32_(value) << USBHS_HSTIDR_RSTIEC_Pos)) /* Assigment of value for RSTIEC in the USBHS_HSTIDR register */
#define USBHS_HSTIDR_RSMEDIEC_Pos             _UINT32_(3)                                          /* (USBHS_HSTIDR) Downstream Resume Sent Interrupt Disable Position */
#define USBHS_HSTIDR_RSMEDIEC_Msk             (_UINT32_(0x1) << USBHS_HSTIDR_RSMEDIEC_Pos)         /* (USBHS_HSTIDR) Downstream Resume Sent Interrupt Disable Mask */
#define USBHS_HSTIDR_RSMEDIEC(value)          (USBHS_HSTIDR_RSMEDIEC_Msk & (_UINT32_(value) << USBHS_HSTIDR_RSMEDIEC_Pos)) /* Assigment of value for RSMEDIEC in the USBHS_HSTIDR register */
#define USBHS_HSTIDR_RXRSMIEC_Pos             _UINT32_(4)                                          /* (USBHS_HSTIDR) Upstream Resume Received Interrupt Disable Position */
#define USBHS_HSTIDR_RXRSMIEC_Msk             (_UINT32_(0x1) << USBHS_HSTIDR_RXRSMIEC_Pos)         /* (USBHS_HSTIDR) Upstream Resume Received Interrupt Disable Mask */
#define USBHS_HSTIDR_RXRSMIEC(value)          (USBHS_HSTIDR_RXRSMIEC_Msk & (_UINT32_(value) << USBHS_HSTIDR_RXRSMIEC_Pos)) /* Assigment of value for RXRSMIEC in the USBHS_HSTIDR register */
#define USBHS_HSTIDR_HSOFIEC_Pos              _UINT32_(5)                                          /* (USBHS_HSTIDR) Host Start of Frame Interrupt Disable Position */
#define USBHS_HSTIDR_HSOFIEC_Msk              (_UINT32_(0x1) << USBHS_HSTIDR_HSOFIEC_Pos)          /* (USBHS_HSTIDR) Host Start of Frame Interrupt Disable Mask */
#define USBHS_HSTIDR_HSOFIEC(value)           (USBHS_HSTIDR_HSOFIEC_Msk & (_UINT32_(value) << USBHS_HSTIDR_HSOFIEC_Pos)) /* Assigment of value for HSOFIEC in the USBHS_HSTIDR register */
#define USBHS_HSTIDR_HWUPIEC_Pos              _UINT32_(6)                                          /* (USBHS_HSTIDR) Host Wake-Up Interrupt Disable Position */
#define USBHS_HSTIDR_HWUPIEC_Msk              (_UINT32_(0x1) << USBHS_HSTIDR_HWUPIEC_Pos)          /* (USBHS_HSTIDR) Host Wake-Up Interrupt Disable Mask */
#define USBHS_HSTIDR_HWUPIEC(value)           (USBHS_HSTIDR_HWUPIEC_Msk & (_UINT32_(value) << USBHS_HSTIDR_HWUPIEC_Pos)) /* Assigment of value for HWUPIEC in the USBHS_HSTIDR register */
#define USBHS_HSTIDR_PEP_0_Pos                _UINT32_(8)                                          /* (USBHS_HSTIDR) Pipe 0 Interrupt Disable Position */
#define USBHS_HSTIDR_PEP_0_Msk                (_UINT32_(0x1) << USBHS_HSTIDR_PEP_0_Pos)            /* (USBHS_HSTIDR) Pipe 0 Interrupt Disable Mask */
#define USBHS_HSTIDR_PEP_0(value)             (USBHS_HSTIDR_PEP_0_Msk & (_UINT32_(value) << USBHS_HSTIDR_PEP_0_Pos)) /* Assigment of value for PEP_0 in the USBHS_HSTIDR register */
#define USBHS_HSTIDR_PEP_1_Pos                _UINT32_(9)                                          /* (USBHS_HSTIDR) Pipe 1 Interrupt Disable Position */
#define USBHS_HSTIDR_PEP_1_Msk                (_UINT32_(0x1) << USBHS_HSTIDR_PEP_1_Pos)            /* (USBHS_HSTIDR) Pipe 1 Interrupt Disable Mask */
#define USBHS_HSTIDR_PEP_1(value)             (USBHS_HSTIDR_PEP_1_Msk & (_UINT32_(value) << USBHS_HSTIDR_PEP_1_Pos)) /* Assigment of value for PEP_1 in the USBHS_HSTIDR register */
#define USBHS_HSTIDR_PEP_2_Pos                _UINT32_(10)                                         /* (USBHS_HSTIDR) Pipe 2 Interrupt Disable Position */
#define USBHS_HSTIDR_PEP_2_Msk                (_UINT32_(0x1) << USBHS_HSTIDR_PEP_2_Pos)            /* (USBHS_HSTIDR) Pipe 2 Interrupt Disable Mask */
#define USBHS_HSTIDR_PEP_2(value)             (USBHS_HSTIDR_PEP_2_Msk & (_UINT32_(value) << USBHS_HSTIDR_PEP_2_Pos)) /* Assigment of value for PEP_2 in the USBHS_HSTIDR register */
#define USBHS_HSTIDR_PEP_3_Pos                _UINT32_(11)                                         /* (USBHS_HSTIDR) Pipe 3 Interrupt Disable Position */
#define USBHS_HSTIDR_PEP_3_Msk                (_UINT32_(0x1) << USBHS_HSTIDR_PEP_3_Pos)            /* (USBHS_HSTIDR) Pipe 3 Interrupt Disable Mask */
#define USBHS_HSTIDR_PEP_3(value)             (USBHS_HSTIDR_PEP_3_Msk & (_UINT32_(value) << USBHS_HSTIDR_PEP_3_Pos)) /* Assigment of value for PEP_3 in the USBHS_HSTIDR register */
#define USBHS_HSTIDR_PEP_4_Pos                _UINT32_(12)                                         /* (USBHS_HSTIDR) Pipe 4 Interrupt Disable Position */
#define USBHS_HSTIDR_PEP_4_Msk                (_UINT32_(0x1) << USBHS_HSTIDR_PEP_4_Pos)            /* (USBHS_HSTIDR) Pipe 4 Interrupt Disable Mask */
#define USBHS_HSTIDR_PEP_4(value)             (USBHS_HSTIDR_PEP_4_Msk & (_UINT32_(value) << USBHS_HSTIDR_PEP_4_Pos)) /* Assigment of value for PEP_4 in the USBHS_HSTIDR register */
#define USBHS_HSTIDR_PEP_5_Pos                _UINT32_(13)                                         /* (USBHS_HSTIDR) Pipe 5 Interrupt Disable Position */
#define USBHS_HSTIDR_PEP_5_Msk                (_UINT32_(0x1) << USBHS_HSTIDR_PEP_5_Pos)            /* (USBHS_HSTIDR) Pipe 5 Interrupt Disable Mask */
#define USBHS_HSTIDR_PEP_5(value)             (USBHS_HSTIDR_PEP_5_Msk & (_UINT32_(value) << USBHS_HSTIDR_PEP_5_Pos)) /* Assigment of value for PEP_5 in the USBHS_HSTIDR register */
#define USBHS_HSTIDR_PEP_6_Pos                _UINT32_(14)                                         /* (USBHS_HSTIDR) Pipe 6 Interrupt Disable Position */
#define USBHS_HSTIDR_PEP_6_Msk                (_UINT32_(0x1) << USBHS_HSTIDR_PEP_6_Pos)            /* (USBHS_HSTIDR) Pipe 6 Interrupt Disable Mask */
#define USBHS_HSTIDR_PEP_6(value)             (USBHS_HSTIDR_PEP_6_Msk & (_UINT32_(value) << USBHS_HSTIDR_PEP_6_Pos)) /* Assigment of value for PEP_6 in the USBHS_HSTIDR register */
#define USBHS_HSTIDR_PEP_7_Pos                _UINT32_(15)                                         /* (USBHS_HSTIDR) Pipe 7 Interrupt Disable Position */
#define USBHS_HSTIDR_PEP_7_Msk                (_UINT32_(0x1) << USBHS_HSTIDR_PEP_7_Pos)            /* (USBHS_HSTIDR) Pipe 7 Interrupt Disable Mask */
#define USBHS_HSTIDR_PEP_7(value)             (USBHS_HSTIDR_PEP_7_Msk & (_UINT32_(value) << USBHS_HSTIDR_PEP_7_Pos)) /* Assigment of value for PEP_7 in the USBHS_HSTIDR register */
#define USBHS_HSTIDR_PEP_8_Pos                _UINT32_(16)                                         /* (USBHS_HSTIDR) Pipe 8 Interrupt Disable Position */
#define USBHS_HSTIDR_PEP_8_Msk                (_UINT32_(0x1) << USBHS_HSTIDR_PEP_8_Pos)            /* (USBHS_HSTIDR) Pipe 8 Interrupt Disable Mask */
#define USBHS_HSTIDR_PEP_8(value)             (USBHS_HSTIDR_PEP_8_Msk & (_UINT32_(value) << USBHS_HSTIDR_PEP_8_Pos)) /* Assigment of value for PEP_8 in the USBHS_HSTIDR register */
#define USBHS_HSTIDR_PEP_9_Pos                _UINT32_(17)                                         /* (USBHS_HSTIDR) Pipe 9 Interrupt Disable Position */
#define USBHS_HSTIDR_PEP_9_Msk                (_UINT32_(0x1) << USBHS_HSTIDR_PEP_9_Pos)            /* (USBHS_HSTIDR) Pipe 9 Interrupt Disable Mask */
#define USBHS_HSTIDR_PEP_9(value)             (USBHS_HSTIDR_PEP_9_Msk & (_UINT32_(value) << USBHS_HSTIDR_PEP_9_Pos)) /* Assigment of value for PEP_9 in the USBHS_HSTIDR register */
#define USBHS_HSTIDR_DMA_1_Pos                _UINT32_(25)                                         /* (USBHS_HSTIDR) DMA Channel 0 Interrupt Disable Position */
#define USBHS_HSTIDR_DMA_1_Msk                (_UINT32_(0x1) << USBHS_HSTIDR_DMA_1_Pos)            /* (USBHS_HSTIDR) DMA Channel 0 Interrupt Disable Mask */
#define USBHS_HSTIDR_DMA_1(value)             (USBHS_HSTIDR_DMA_1_Msk & (_UINT32_(value) << USBHS_HSTIDR_DMA_1_Pos)) /* Assigment of value for DMA_1 in the USBHS_HSTIDR register */
#define USBHS_HSTIDR_DMA_2_Pos                _UINT32_(26)                                         /* (USBHS_HSTIDR) DMA Channel 1 Interrupt Disable Position */
#define USBHS_HSTIDR_DMA_2_Msk                (_UINT32_(0x1) << USBHS_HSTIDR_DMA_2_Pos)            /* (USBHS_HSTIDR) DMA Channel 1 Interrupt Disable Mask */
#define USBHS_HSTIDR_DMA_2(value)             (USBHS_HSTIDR_DMA_2_Msk & (_UINT32_(value) << USBHS_HSTIDR_DMA_2_Pos)) /* Assigment of value for DMA_2 in the USBHS_HSTIDR register */
#define USBHS_HSTIDR_DMA_3_Pos                _UINT32_(27)                                         /* (USBHS_HSTIDR) DMA Channel 2 Interrupt Disable Position */
#define USBHS_HSTIDR_DMA_3_Msk                (_UINT32_(0x1) << USBHS_HSTIDR_DMA_3_Pos)            /* (USBHS_HSTIDR) DMA Channel 2 Interrupt Disable Mask */
#define USBHS_HSTIDR_DMA_3(value)             (USBHS_HSTIDR_DMA_3_Msk & (_UINT32_(value) << USBHS_HSTIDR_DMA_3_Pos)) /* Assigment of value for DMA_3 in the USBHS_HSTIDR register */
#define USBHS_HSTIDR_DMA_4_Pos                _UINT32_(28)                                         /* (USBHS_HSTIDR) DMA Channel 3 Interrupt Disable Position */
#define USBHS_HSTIDR_DMA_4_Msk                (_UINT32_(0x1) << USBHS_HSTIDR_DMA_4_Pos)            /* (USBHS_HSTIDR) DMA Channel 3 Interrupt Disable Mask */
#define USBHS_HSTIDR_DMA_4(value)             (USBHS_HSTIDR_DMA_4_Msk & (_UINT32_(value) << USBHS_HSTIDR_DMA_4_Pos)) /* Assigment of value for DMA_4 in the USBHS_HSTIDR register */
#define USBHS_HSTIDR_DMA_5_Pos                _UINT32_(29)                                         /* (USBHS_HSTIDR) DMA Channel 4 Interrupt Disable Position */
#define USBHS_HSTIDR_DMA_5_Msk                (_UINT32_(0x1) << USBHS_HSTIDR_DMA_5_Pos)            /* (USBHS_HSTIDR) DMA Channel 4 Interrupt Disable Mask */
#define USBHS_HSTIDR_DMA_5(value)             (USBHS_HSTIDR_DMA_5_Msk & (_UINT32_(value) << USBHS_HSTIDR_DMA_5_Pos)) /* Assigment of value for DMA_5 in the USBHS_HSTIDR register */
#define USBHS_HSTIDR_DMA_6_Pos                _UINT32_(30)                                         /* (USBHS_HSTIDR) DMA Channel 5 Interrupt Disable Position */
#define USBHS_HSTIDR_DMA_6_Msk                (_UINT32_(0x1) << USBHS_HSTIDR_DMA_6_Pos)            /* (USBHS_HSTIDR) DMA Channel 5 Interrupt Disable Mask */
#define USBHS_HSTIDR_DMA_6(value)             (USBHS_HSTIDR_DMA_6_Msk & (_UINT32_(value) << USBHS_HSTIDR_DMA_6_Pos)) /* Assigment of value for DMA_6 in the USBHS_HSTIDR register */
#define USBHS_HSTIDR_DMA_7_Pos                _UINT32_(31)                                         /* (USBHS_HSTIDR) DMA Channel 6 Interrupt Disable Position */
#define USBHS_HSTIDR_DMA_7_Msk                (_UINT32_(0x1) << USBHS_HSTIDR_DMA_7_Pos)            /* (USBHS_HSTIDR) DMA Channel 6 Interrupt Disable Mask */
#define USBHS_HSTIDR_DMA_7(value)             (USBHS_HSTIDR_DMA_7_Msk & (_UINT32_(value) << USBHS_HSTIDR_DMA_7_Pos)) /* Assigment of value for DMA_7 in the USBHS_HSTIDR register */
#define USBHS_HSTIDR_Msk                      _UINT32_(0xFE03FF7F)                                 /* (USBHS_HSTIDR) Register Mask  */

#define USBHS_HSTIDR_PEP__Pos                 _UINT32_(8)                                          /* (USBHS_HSTIDR Position) Pipe x Interrupt Disable */
#define USBHS_HSTIDR_PEP__Msk                 (_UINT32_(0x3FF) << USBHS_HSTIDR_PEP__Pos)           /* (USBHS_HSTIDR Mask) PEP_ */
#define USBHS_HSTIDR_PEP_(value)              (USBHS_HSTIDR_PEP__Msk & (_UINT32_(value) << USBHS_HSTIDR_PEP__Pos)) 
#define USBHS_HSTIDR_DMA__Pos                 _UINT32_(25)                                         /* (USBHS_HSTIDR Position) DMA Channel 6 Interrupt Disable */
#define USBHS_HSTIDR_DMA__Msk                 (_UINT32_(0x7F) << USBHS_HSTIDR_DMA__Pos)            /* (USBHS_HSTIDR Mask) DMA_ */
#define USBHS_HSTIDR_DMA_(value)              (USBHS_HSTIDR_DMA__Msk & (_UINT32_(value) << USBHS_HSTIDR_DMA__Pos)) 

