Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/usbhs.h
/* -------- USBHS_HSTIER : (USBHS Offset: 0x418) ( /W 32) Host Global Interrupt Enable Register -------- */
#define USBHS_HSTIER_DCONNIES_Pos             _UINT32_(0)                                          /* (USBHS_HSTIER) Device Connection Interrupt Enable Position */
#define USBHS_HSTIER_DCONNIES_Msk             (_UINT32_(0x1) << USBHS_HSTIER_DCONNIES_Pos)         /* (USBHS_HSTIER) Device Connection Interrupt Enable Mask */
#define USBHS_HSTIER_DCONNIES(value)          (USBHS_HSTIER_DCONNIES_Msk & (_UINT32_(value) << USBHS_HSTIER_DCONNIES_Pos)) /* Assigment of value for DCONNIES in the USBHS_HSTIER register */
#define USBHS_HSTIER_DDISCIES_Pos             _UINT32_(1)                                          /* (USBHS_HSTIER) Device Disconnection Interrupt Enable Position */
#define USBHS_HSTIER_DDISCIES_Msk             (_UINT32_(0x1) << USBHS_HSTIER_DDISCIES_Pos)         /* (USBHS_HSTIER) Device Disconnection Interrupt Enable Mask */
#define USBHS_HSTIER_DDISCIES(value)          (USBHS_HSTIER_DDISCIES_Msk & (_UINT32_(value) << USBHS_HSTIER_DDISCIES_Pos)) /* Assigment of value for DDISCIES in the USBHS_HSTIER register */
#define USBHS_HSTIER_RSTIES_Pos               _UINT32_(2)                                          /* (USBHS_HSTIER) USB Reset Sent Interrupt Enable Position */
#define USBHS_HSTIER_RSTIES_Msk               (_UINT32_(0x1) << USBHS_HSTIER_RSTIES_Pos)           /* (USBHS_HSTIER) USB Reset Sent Interrupt Enable Mask */
#define USBHS_HSTIER_RSTIES(value)            (USBHS_HSTIER_RSTIES_Msk & (_UINT32_(value) << USBHS_HSTIER_RSTIES_Pos)) /* Assigment of value for RSTIES in the USBHS_HSTIER register */
#define USBHS_HSTIER_RSMEDIES_Pos             _UINT32_(3)                                          /* (USBHS_HSTIER) Downstream Resume Sent Interrupt Enable Position */
#define USBHS_HSTIER_RSMEDIES_Msk             (_UINT32_(0x1) << USBHS_HSTIER_RSMEDIES_Pos)         /* (USBHS_HSTIER) Downstream Resume Sent Interrupt Enable Mask */
#define USBHS_HSTIER_RSMEDIES(value)          (USBHS_HSTIER_RSMEDIES_Msk & (_UINT32_(value) << USBHS_HSTIER_RSMEDIES_Pos)) /* Assigment of value for RSMEDIES in the USBHS_HSTIER register */
#define USBHS_HSTIER_RXRSMIES_Pos             _UINT32_(4)                                          /* (USBHS_HSTIER) Upstream Resume Received Interrupt Enable Position */
#define USBHS_HSTIER_RXRSMIES_Msk             (_UINT32_(0x1) << USBHS_HSTIER_RXRSMIES_Pos)         /* (USBHS_HSTIER) Upstream Resume Received Interrupt Enable Mask */
#define USBHS_HSTIER_RXRSMIES(value)          (USBHS_HSTIER_RXRSMIES_Msk & (_UINT32_(value) << USBHS_HSTIER_RXRSMIES_Pos)) /* Assigment of value for RXRSMIES in the USBHS_HSTIER register */
#define USBHS_HSTIER_HSOFIES_Pos              _UINT32_(5)                                          /* (USBHS_HSTIER) Host Start of Frame Interrupt Enable Position */
#define USBHS_HSTIER_HSOFIES_Msk              (_UINT32_(0x1) << USBHS_HSTIER_HSOFIES_Pos)          /* (USBHS_HSTIER) Host Start of Frame Interrupt Enable Mask */
#define USBHS_HSTIER_HSOFIES(value)           (USBHS_HSTIER_HSOFIES_Msk & (_UINT32_(value) << USBHS_HSTIER_HSOFIES_Pos)) /* Assigment of value for HSOFIES in the USBHS_HSTIER register */
#define USBHS_HSTIER_HWUPIES_Pos              _UINT32_(6)                                          /* (USBHS_HSTIER) Host Wake-Up Interrupt Enable Position */
#define USBHS_HSTIER_HWUPIES_Msk              (_UINT32_(0x1) << USBHS_HSTIER_HWUPIES_Pos)          /* (USBHS_HSTIER) Host Wake-Up Interrupt Enable Mask */
#define USBHS_HSTIER_HWUPIES(value)           (USBHS_HSTIER_HWUPIES_Msk & (_UINT32_(value) << USBHS_HSTIER_HWUPIES_Pos)) /* Assigment of value for HWUPIES in the USBHS_HSTIER register */
#define USBHS_HSTIER_PEP_0_Pos                _UINT32_(8)                                          /* (USBHS_HSTIER) Pipe 0 Interrupt Enable Position */
#define USBHS_HSTIER_PEP_0_Msk                (_UINT32_(0x1) << USBHS_HSTIER_PEP_0_Pos)            /* (USBHS_HSTIER) Pipe 0 Interrupt Enable Mask */
#define USBHS_HSTIER_PEP_0(value)             (USBHS_HSTIER_PEP_0_Msk & (_UINT32_(value) << USBHS_HSTIER_PEP_0_Pos)) /* Assigment of value for PEP_0 in the USBHS_HSTIER register */
#define USBHS_HSTIER_PEP_1_Pos                _UINT32_(9)                                          /* (USBHS_HSTIER) Pipe 1 Interrupt Enable Position */
#define USBHS_HSTIER_PEP_1_Msk                (_UINT32_(0x1) << USBHS_HSTIER_PEP_1_Pos)            /* (USBHS_HSTIER) Pipe 1 Interrupt Enable Mask */
#define USBHS_HSTIER_PEP_1(value)             (USBHS_HSTIER_PEP_1_Msk & (_UINT32_(value) << USBHS_HSTIER_PEP_1_Pos)) /* Assigment of value for PEP_1 in the USBHS_HSTIER register */
#define USBHS_HSTIER_PEP_2_Pos                _UINT32_(10)                                         /* (USBHS_HSTIER) Pipe 2 Interrupt Enable Position */
#define USBHS_HSTIER_PEP_2_Msk                (_UINT32_(0x1) << USBHS_HSTIER_PEP_2_Pos)            /* (USBHS_HSTIER) Pipe 2 Interrupt Enable Mask */
#define USBHS_HSTIER_PEP_2(value)             (USBHS_HSTIER_PEP_2_Msk & (_UINT32_(value) << USBHS_HSTIER_PEP_2_Pos)) /* Assigment of value for PEP_2 in the USBHS_HSTIER register */
#define USBHS_HSTIER_PEP_3_Pos                _UINT32_(11)                                         /* (USBHS_HSTIER) Pipe 3 Interrupt Enable Position */
#define USBHS_HSTIER_PEP_3_Msk                (_UINT32_(0x1) << USBHS_HSTIER_PEP_3_Pos)            /* (USBHS_HSTIER) Pipe 3 Interrupt Enable Mask */
#define USBHS_HSTIER_PEP_3(value)             (USBHS_HSTIER_PEP_3_Msk & (_UINT32_(value) << USBHS_HSTIER_PEP_3_Pos)) /* Assigment of value for PEP_3 in the USBHS_HSTIER register */
#define USBHS_HSTIER_PEP_4_Pos                _UINT32_(12)                                         /* (USBHS_HSTIER) Pipe 4 Interrupt Enable Position */
#define USBHS_HSTIER_PEP_4_Msk                (_UINT32_(0x1) << USBHS_HSTIER_PEP_4_Pos)            /* (USBHS_HSTIER) Pipe 4 Interrupt Enable Mask */
#define USBHS_HSTIER_PEP_4(value)             (USBHS_HSTIER_PEP_4_Msk & (_UINT32_(value) << USBHS_HSTIER_PEP_4_Pos)) /* Assigment of value for PEP_4 in the USBHS_HSTIER register */
#define USBHS_HSTIER_PEP_5_Pos                _UINT32_(13)                                         /* (USBHS_HSTIER) Pipe 5 Interrupt Enable Position */
#define USBHS_HSTIER_PEP_5_Msk                (_UINT32_(0x1) << USBHS_HSTIER_PEP_5_Pos)            /* (USBHS_HSTIER) Pipe 5 Interrupt Enable Mask */
#define USBHS_HSTIER_PEP_5(value)             (USBHS_HSTIER_PEP_5_Msk & (_UINT32_(value) << USBHS_HSTIER_PEP_5_Pos)) /* Assigment of value for PEP_5 in the USBHS_HSTIER register */
#define USBHS_HSTIER_PEP_6_Pos                _UINT32_(14)                                         /* (USBHS_HSTIER) Pipe 6 Interrupt Enable Position */
#define USBHS_HSTIER_PEP_6_Msk                (_UINT32_(0x1) << USBHS_HSTIER_PEP_6_Pos)            /* (USBHS_HSTIER) Pipe 6 Interrupt Enable Mask */
#define USBHS_HSTIER_PEP_6(value)             (USBHS_HSTIER_PEP_6_Msk & (_UINT32_(value) << USBHS_HSTIER_PEP_6_Pos)) /* Assigment of value for PEP_6 in the USBHS_HSTIER register */
#define USBHS_HSTIER_PEP_7_Pos                _UINT32_(15)                                         /* (USBHS_HSTIER) Pipe 7 Interrupt Enable Position */
#define USBHS_HSTIER_PEP_7_Msk                (_UINT32_(0x1) << USBHS_HSTIER_PEP_7_Pos)            /* (USBHS_HSTIER) Pipe 7 Interrupt Enable Mask */
#define USBHS_HSTIER_PEP_7(value)             (USBHS_HSTIER_PEP_7_Msk & (_UINT32_(value) << USBHS_HSTIER_PEP_7_Pos)) /* Assigment of value for PEP_7 in the USBHS_HSTIER register */
#define USBHS_HSTIER_PEP_8_Pos                _UINT32_(16)                                         /* (USBHS_HSTIER) Pipe 8 Interrupt Enable Position */
#define USBHS_HSTIER_PEP_8_Msk                (_UINT32_(0x1) << USBHS_HSTIER_PEP_8_Pos)            /* (USBHS_HSTIER) Pipe 8 Interrupt Enable Mask */
#define USBHS_HSTIER_PEP_8(value)             (USBHS_HSTIER_PEP_8_Msk & (_UINT32_(value) << USBHS_HSTIER_PEP_8_Pos)) /* Assigment of value for PEP_8 in the USBHS_HSTIER register */
#define USBHS_HSTIER_PEP_9_Pos                _UINT32_(17)                                         /* (USBHS_HSTIER) Pipe 9 Interrupt Enable Position */
#define USBHS_HSTIER_PEP_9_Msk                (_UINT32_(0x1) << USBHS_HSTIER_PEP_9_Pos)            /* (USBHS_HSTIER) Pipe 9 Interrupt Enable Mask */
#define USBHS_HSTIER_PEP_9(value)             (USBHS_HSTIER_PEP_9_Msk & (_UINT32_(value) << USBHS_HSTIER_PEP_9_Pos)) /* Assigment of value for PEP_9 in the USBHS_HSTIER register */
#define USBHS_HSTIER_DMA_1_Pos                _UINT32_(25)                                         /* (USBHS_HSTIER) DMA Channel 0 Interrupt Enable Position */
#define USBHS_HSTIER_DMA_1_Msk                (_UINT32_(0x1) << USBHS_HSTIER_DMA_1_Pos)            /* (USBHS_HSTIER) DMA Channel 0 Interrupt Enable Mask */
#define USBHS_HSTIER_DMA_1(value)             (USBHS_HSTIER_DMA_1_Msk & (_UINT32_(value) << USBHS_HSTIER_DMA_1_Pos)) /* Assigment of value for DMA_1 in the USBHS_HSTIER register */
#define USBHS_HSTIER_DMA_2_Pos                _UINT32_(26)                                         /* (USBHS_HSTIER) DMA Channel 1 Interrupt Enable Position */
#define USBHS_HSTIER_DMA_2_Msk                (_UINT32_(0x1) << USBHS_HSTIER_DMA_2_Pos)            /* (USBHS_HSTIER) DMA Channel 1 Interrupt Enable Mask */
#define USBHS_HSTIER_DMA_2(value)             (USBHS_HSTIER_DMA_2_Msk & (_UINT32_(value) << USBHS_HSTIER_DMA_2_Pos)) /* Assigment of value for DMA_2 in the USBHS_HSTIER register */
#define USBHS_HSTIER_DMA_3_Pos                _UINT32_(27)                                         /* (USBHS_HSTIER) DMA Channel 2 Interrupt Enable Position */
#define USBHS_HSTIER_DMA_3_Msk                (_UINT32_(0x1) << USBHS_HSTIER_DMA_3_Pos)            /* (USBHS_HSTIER) DMA Channel 2 Interrupt Enable Mask */
#define USBHS_HSTIER_DMA_3(value)             (USBHS_HSTIER_DMA_3_Msk & (_UINT32_(value) << USBHS_HSTIER_DMA_3_Pos)) /* Assigment of value for DMA_3 in the USBHS_HSTIER register */
#define USBHS_HSTIER_DMA_4_Pos                _UINT32_(28)                                         /* (USBHS_HSTIER) DMA Channel 3 Interrupt Enable Position */
#define USBHS_HSTIER_DMA_4_Msk                (_UINT32_(0x1) << USBHS_HSTIER_DMA_4_Pos)            /* (USBHS_HSTIER) DMA Channel 3 Interrupt Enable Mask */
#define USBHS_HSTIER_DMA_4(value)             (USBHS_HSTIER_DMA_4_Msk & (_UINT32_(value) << USBHS_HSTIER_DMA_4_Pos)) /* Assigment of value for DMA_4 in the USBHS_HSTIER register */
#define USBHS_HSTIER_DMA_5_Pos                _UINT32_(29)                                         /* (USBHS_HSTIER) DMA Channel 4 Interrupt Enable Position */
#define USBHS_HSTIER_DMA_5_Msk                (_UINT32_(0x1) << USBHS_HSTIER_DMA_5_Pos)            /* (USBHS_HSTIER) DMA Channel 4 Interrupt Enable Mask */
#define USBHS_HSTIER_DMA_5(value)             (USBHS_HSTIER_DMA_5_Msk & (_UINT32_(value) << USBHS_HSTIER_DMA_5_Pos)) /* Assigment of value for DMA_5 in the USBHS_HSTIER register */
#define USBHS_HSTIER_DMA_6_Pos                _UINT32_(30)                                         /* (USBHS_HSTIER) DMA Channel 5 Interrupt Enable Position */
#define USBHS_HSTIER_DMA_6_Msk                (_UINT32_(0x1) << USBHS_HSTIER_DMA_6_Pos)            /* (USBHS_HSTIER) DMA Channel 5 Interrupt Enable Mask */
#define USBHS_HSTIER_DMA_6(value)             (USBHS_HSTIER_DMA_6_Msk & (_UINT32_(value) << USBHS_HSTIER_DMA_6_Pos)) /* Assigment of value for DMA_6 in the USBHS_HSTIER register */
#define USBHS_HSTIER_DMA_7_Pos                _UINT32_(31)                                         /* (USBHS_HSTIER) DMA Channel 6 Interrupt Enable Position */
#define USBHS_HSTIER_DMA_7_Msk                (_UINT32_(0x1) << USBHS_HSTIER_DMA_7_Pos)            /* (USBHS_HSTIER) DMA Channel 6 Interrupt Enable Mask */
#define USBHS_HSTIER_DMA_7(value)             (USBHS_HSTIER_DMA_7_Msk & (_UINT32_(value) << USBHS_HSTIER_DMA_7_Pos)) /* Assigment of value for DMA_7 in the USBHS_HSTIER register */
#define USBHS_HSTIER_Msk                      _UINT32_(0xFE03FF7F)                                 /* (USBHS_HSTIER) Register Mask  */

#define USBHS_HSTIER_PEP__Pos                 _UINT32_(8)                                          /* (USBHS_HSTIER Position) Pipe x Interrupt Enable */
#define USBHS_HSTIER_PEP__Msk                 (_UINT32_(0x3FF) << USBHS_HSTIER_PEP__Pos)           /* (USBHS_HSTIER Mask) PEP_ */
#define USBHS_HSTIER_PEP_(value)              (USBHS_HSTIER_PEP__Msk & (_UINT32_(value) << USBHS_HSTIER_PEP__Pos)) 
#define USBHS_HSTIER_DMA__Pos                 _UINT32_(25)                                         /* (USBHS_HSTIER Position) DMA Channel 6 Interrupt Enable */
#define USBHS_HSTIER_DMA__Msk                 (_UINT32_(0x7F) << USBHS_HSTIER_DMA__Pos)            /* (USBHS_HSTIER Mask) DMA_ */
#define USBHS_HSTIER_DMA_(value)              (USBHS_HSTIER_DMA__Msk & (_UINT32_(value) << USBHS_HSTIER_DMA__Pos)) 

/* -------- USBHS_HSTPIP : (USBHS Offset: 0x41C) (R/W 32) Host Pipe Register -------- */
#define USBHS_HSTPIP_PEN0_Pos                 _UINT32_(0)                                          /* (USBHS_HSTPIP) Pipe 0 Enable Position */
#define USBHS_HSTPIP_PEN0_Msk                 (_UINT32_(0x1) << USBHS_HSTPIP_PEN0_Pos)             /* (USBHS_HSTPIP) Pipe 0 Enable Mask */
#define USBHS_HSTPIP_PEN0(value)              (USBHS_HSTPIP_PEN0_Msk & (_UINT32_(value) << USBHS_HSTPIP_PEN0_Pos)) /* Assigment of value for PEN0 in the USBHS_HSTPIP register */
#define USBHS_HSTPIP_PEN1_Pos                 _UINT32_(1)                                          /* (USBHS_HSTPIP) Pipe 1 Enable Position */
#define USBHS_HSTPIP_PEN1_Msk                 (_UINT32_(0x1) << USBHS_HSTPIP_PEN1_Pos)             /* (USBHS_HSTPIP) Pipe 1 Enable Mask */
#define USBHS_HSTPIP_PEN1(value)              (USBHS_HSTPIP_PEN1_Msk & (_UINT32_(value) << USBHS_HSTPIP_PEN1_Pos)) /* Assigment of value for PEN1 in the USBHS_HSTPIP register */
#define USBHS_HSTPIP_PEN2_Pos                 _UINT32_(2)                                          /* (USBHS_HSTPIP) Pipe 2 Enable Position */
#define USBHS_HSTPIP_PEN2_Msk                 (_UINT32_(0x1) << USBHS_HSTPIP_PEN2_Pos)             /* (USBHS_HSTPIP) Pipe 2 Enable Mask */
#define USBHS_HSTPIP_PEN2(value)              (USBHS_HSTPIP_PEN2_Msk & (_UINT32_(value) << USBHS_HSTPIP_PEN2_Pos)) /* Assigment of value for PEN2 in the USBHS_HSTPIP register */
#define USBHS_HSTPIP_PEN3_Pos                 _UINT32_(3)                                          /* (USBHS_HSTPIP) Pipe 3 Enable Position */
#define USBHS_HSTPIP_PEN3_Msk                 (_UINT32_(0x1) << USBHS_HSTPIP_PEN3_Pos)             /* (USBHS_HSTPIP) Pipe 3 Enable Mask */
#define USBHS_HSTPIP_PEN3(value)              (USBHS_HSTPIP_PEN3_Msk & (_UINT32_(value) << USBHS_HSTPIP_PEN3_Pos)) /* Assigment of value for PEN3 in the USBHS_HSTPIP register */
#define USBHS_HSTPIP_PEN4_Pos                 _UINT32_(4)                                          /* (USBHS_HSTPIP) Pipe 4 Enable Position */
#define USBHS_HSTPIP_PEN4_Msk                 (_UINT32_(0x1) << USBHS_HSTPIP_PEN4_Pos)             /* (USBHS_HSTPIP) Pipe 4 Enable Mask */
#define USBHS_HSTPIP_PEN4(value)              (USBHS_HSTPIP_PEN4_Msk & (_UINT32_(value) << USBHS_HSTPIP_PEN4_Pos)) /* Assigment of value for PEN4 in the USBHS_HSTPIP register */
#define USBHS_HSTPIP_PEN5_Pos                 _UINT32_(5)                                          /* (USBHS_HSTPIP) Pipe 5 Enable Position */
#define USBHS_HSTPIP_PEN5_Msk                 (_UINT32_(0x1) << USBHS_HSTPIP_PEN5_Pos)             /* (USBHS_HSTPIP) Pipe 5 Enable Mask */
#define USBHS_HSTPIP_PEN5(value)              (USBHS_HSTPIP_PEN5_Msk & (_UINT32_(value) << USBHS_HSTPIP_PEN5_Pos)) /* Assigment of value for PEN5 in the USBHS_HSTPIP register */
#define USBHS_HSTPIP_PEN6_Pos                 _UINT32_(6)                                          /* (USBHS_HSTPIP) Pipe 6 Enable Position */
#define USBHS_HSTPIP_PEN6_Msk                 (_UINT32_(0x1) << USBHS_HSTPIP_PEN6_Pos)             /* (USBHS_HSTPIP) Pipe 6 Enable Mask */
#define USBHS_HSTPIP_PEN6(value)              (USBHS_HSTPIP_PEN6_Msk & (_UINT32_(value) << USBHS_HSTPIP_PEN6_Pos)) /* Assigment of value for PEN6 in the USBHS_HSTPIP register */
#define USBHS_HSTPIP_PEN7_Pos                 _UINT32_(7)                                          /* (USBHS_HSTPIP) Pipe 7 Enable Position */
#define USBHS_HSTPIP_PEN7_Msk                 (_UINT32_(0x1) << USBHS_HSTPIP_PEN7_Pos)             /* (USBHS_HSTPIP) Pipe 7 Enable Mask */
#define USBHS_HSTPIP_PEN7(value)              (USBHS_HSTPIP_PEN7_Msk & (_UINT32_(value) << USBHS_HSTPIP_PEN7_Pos)) /* Assigment of value for PEN7 in the USBHS_HSTPIP register */
#define USBHS_HSTPIP_PEN8_Pos                 _UINT32_(8)                                          /* (USBHS_HSTPIP) Pipe 8 Enable Position */
#define USBHS_HSTPIP_PEN8_Msk                 (_UINT32_(0x1) << USBHS_HSTPIP_PEN8_Pos)             /* (USBHS_HSTPIP) Pipe 8 Enable Mask */
#define USBHS_HSTPIP_PEN8(value)              (USBHS_HSTPIP_PEN8_Msk & (_UINT32_(value) << USBHS_HSTPIP_PEN8_Pos)) /* Assigment of value for PEN8 in the USBHS_HSTPIP register */
#define USBHS_HSTPIP_PRST0_Pos                _UINT32_(16)                                         /* (USBHS_HSTPIP) Pipe 0 Reset Position */
#define USBHS_HSTPIP_PRST0_Msk                (_UINT32_(0x1) << USBHS_HSTPIP_PRST0_Pos)            /* (USBHS_HSTPIP) Pipe 0 Reset Mask */
#define USBHS_HSTPIP_PRST0(value)             (USBHS_HSTPIP_PRST0_Msk & (_UINT32_(value) << USBHS_HSTPIP_PRST0_Pos)) /* Assigment of value for PRST0 in the USBHS_HSTPIP register */
#define USBHS_HSTPIP_PRST1_Pos                _UINT32_(17)                                         /* (USBHS_HSTPIP) Pipe 1 Reset Position */
#define USBHS_HSTPIP_PRST1_Msk                (_UINT32_(0x1) << USBHS_HSTPIP_PRST1_Pos)            /* (USBHS_HSTPIP) Pipe 1 Reset Mask */
#define USBHS_HSTPIP_PRST1(value)             (USBHS_HSTPIP_PRST1_Msk & (_UINT32_(value) << USBHS_HSTPIP_PRST1_Pos)) /* Assigment of value for PRST1 in the USBHS_HSTPIP register */
#define USBHS_HSTPIP_PRST2_Pos                _UINT32_(18)                                         /* (USBHS_HSTPIP) Pipe 2 Reset Position */
#define USBHS_HSTPIP_PRST2_Msk                (_UINT32_(0x1) << USBHS_HSTPIP_PRST2_Pos)            /* (USBHS_HSTPIP) Pipe 2 Reset Mask */
#define USBHS_HSTPIP_PRST2(value)             (USBHS_HSTPIP_PRST2_Msk & (_UINT32_(value) << USBHS_HSTPIP_PRST2_Pos)) /* Assigment of value for PRST2 in the USBHS_HSTPIP register */
#define USBHS_HSTPIP_PRST3_Pos                _UINT32_(19)                                         /* (USBHS_HSTPIP) Pipe 3 Reset Position */
#define USBHS_HSTPIP_PRST3_Msk                (_UINT32_(0x1) << USBHS_HSTPIP_PRST3_Pos)            /* (USBHS_HSTPIP) Pipe 3 Reset Mask */
#define USBHS_HSTPIP_PRST3(value)             (USBHS_HSTPIP_PRST3_Msk & (_UINT32_(value) << USBHS_HSTPIP_PRST3_Pos)) /* Assigment of value for PRST3 in the USBHS_HSTPIP register */
#define USBHS_HSTPIP_PRST4_Pos                _UINT32_(20)                                         /* (USBHS_HSTPIP) Pipe 4 Reset Position */
#define USBHS_HSTPIP_PRST4_Msk                (_UINT32_(0x1) << USBHS_HSTPIP_PRST4_Pos)            /* (USBHS_HSTPIP) Pipe 4 Reset Mask */
#define USBHS_HSTPIP_PRST4(value)             (USBHS_HSTPIP_PRST4_Msk & (_UINT32_(value) << USBHS_HSTPIP_PRST4_Pos)) /* Assigment of value for PRST4 in the USBHS_HSTPIP register */
#define USBHS_HSTPIP_PRST5_Pos                _UINT32_(21)                                         /* (USBHS_HSTPIP) Pipe 5 Reset Position */
#define USBHS_HSTPIP_PRST5_Msk                (_UINT32_(0x1) << USBHS_HSTPIP_PRST5_Pos)            /* (USBHS_HSTPIP) Pipe 5 Reset Mask */
#define USBHS_HSTPIP_PRST5(value)             (USBHS_HSTPIP_PRST5_Msk & (_UINT32_(value) << USBHS_HSTPIP_PRST5_Pos)) /* Assigment of value for PRST5 in the USBHS_HSTPIP register */
#define USBHS_HSTPIP_PRST6_Pos                _UINT32_(22)                                         /* (USBHS_HSTPIP) Pipe 6 Reset Position */
#define USBHS_HSTPIP_PRST6_Msk                (_UINT32_(0x1) << USBHS_HSTPIP_PRST6_Pos)            /* (USBHS_HSTPIP) Pipe 6 Reset Mask */
#define USBHS_HSTPIP_PRST6(value)             (USBHS_HSTPIP_PRST6_Msk & (_UINT32_(value) << USBHS_HSTPIP_PRST6_Pos)) /* Assigment of value for PRST6 in the USBHS_HSTPIP register */
#define USBHS_HSTPIP_PRST7_Pos                _UINT32_(23)                                         /* (USBHS_HSTPIP) Pipe 7 Reset Position */
#define USBHS_HSTPIP_PRST7_Msk                (_UINT32_(0x1) << USBHS_HSTPIP_PRST7_Pos)            /* (USBHS_HSTPIP) Pipe 7 Reset Mask */
#define USBHS_HSTPIP_PRST7(value)             (USBHS_HSTPIP_PRST7_Msk & (_UINT32_(value) << USBHS_HSTPIP_PRST7_Pos)) /* Assigment of value for PRST7 in the USBHS_HSTPIP register */
#define USBHS_HSTPIP_PRST8_Pos                _UINT32_(24)                                         /* (USBHS_HSTPIP) Pipe 8 Reset Position */
#define USBHS_HSTPIP_PRST8_Msk                (_UINT32_(0x1) << USBHS_HSTPIP_PRST8_Pos)            /* (USBHS_HSTPIP) Pipe 8 Reset Mask */
#define USBHS_HSTPIP_PRST8(value)             (USBHS_HSTPIP_PRST8_Msk & (_UINT32_(value) << USBHS_HSTPIP_PRST8_Pos)) /* Assigment of value for PRST8 in the USBHS_HSTPIP register */
#define USBHS_HSTPIP_Msk                      _UINT32_(0x01FF01FF)                                 /* (USBHS_HSTPIP) Register Mask  */

#define USBHS_HSTPIP_PEN_Pos                  _UINT32_(0)                                          /* (USBHS_HSTPIP Position) Pipe x Enable */
#define USBHS_HSTPIP_PEN_Msk                  (_UINT32_(0x1FF) << USBHS_HSTPIP_PEN_Pos)            /* (USBHS_HSTPIP Mask) PEN */
#define USBHS_HSTPIP_PEN(value)               (USBHS_HSTPIP_PEN_Msk & (_UINT32_(value) << USBHS_HSTPIP_PEN_Pos)) 
#define USBHS_HSTPIP_PRST_Pos                 _UINT32_(16)                                         /* (USBHS_HSTPIP Position) Pipe 8 Reset */
#define USBHS_HSTPIP_PRST_Msk                 (_UINT32_(0x1FF) << USBHS_HSTPIP_PRST_Pos)           /* (USBHS_HSTPIP Mask) PRST */
#define USBHS_HSTPIP_PRST(value)              (USBHS_HSTPIP_PRST_Msk & (_UINT32_(value) << USBHS_HSTPIP_PRST_Pos)) 

/* -------- USBHS_HSTFNUM : (USBHS Offset: 0x420) (R/W 32) Host Frame Number Register -------- */
#define USBHS_HSTFNUM_MFNUM_Pos               _UINT32_(0)                                          /* (USBHS_HSTFNUM) Micro Frame Number Position */
#define USBHS_HSTFNUM_MFNUM_Msk               (_UINT32_(0x7) << USBHS_HSTFNUM_MFNUM_Pos)           /* (USBHS_HSTFNUM) Micro Frame Number Mask */
#define USBHS_HSTFNUM_MFNUM(value)            (USBHS_HSTFNUM_MFNUM_Msk & (_UINT32_(value) << USBHS_HSTFNUM_MFNUM_Pos)) /* Assigment of value for MFNUM in the USBHS_HSTFNUM register */
#define USBHS_HSTFNUM_FNUM_Pos                _UINT32_(3)                                          /* (USBHS_HSTFNUM) Frame Number Position */
#define USBHS_HSTFNUM_FNUM_Msk                (_UINT32_(0x7FF) << USBHS_HSTFNUM_FNUM_Pos)          /* (USBHS_HSTFNUM) Frame Number Mask */
#define USBHS_HSTFNUM_FNUM(value)             (USBHS_HSTFNUM_FNUM_Msk & (_UINT32_(value) << USBHS_HSTFNUM_FNUM_Pos)) /* Assigment of value for FNUM in the USBHS_HSTFNUM register */
#define USBHS_HSTFNUM_FLENHIGH_Pos            _UINT32_(16)                                         /* (USBHS_HSTFNUM) Frame Length Position */
#define USBHS_HSTFNUM_FLENHIGH_Msk            (_UINT32_(0xFF) << USBHS_HSTFNUM_FLENHIGH_Pos)       /* (USBHS_HSTFNUM) Frame Length Mask */
#define USBHS_HSTFNUM_FLENHIGH(value)         (USBHS_HSTFNUM_FLENHIGH_Msk & (_UINT32_(value) << USBHS_HSTFNUM_FLENHIGH_Pos)) /* Assigment of value for FLENHIGH in the USBHS_HSTFNUM register */
#define USBHS_HSTFNUM_Msk                     _UINT32_(0x00FF3FFF)                                 /* (USBHS_HSTFNUM) Register Mask  */


