Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/usbhs.h
/* -------- USBHS_HSTADDR1 : (USBHS Offset: 0x424) (R/W 32) Host Address 1 Register -------- */
#define USBHS_HSTADDR1_HSTADDRP0_Pos          _UINT32_(0)                                          /* (USBHS_HSTADDR1) USB Host Address Position */
#define USBHS_HSTADDR1_HSTADDRP0_Msk          (_UINT32_(0x7F) << USBHS_HSTADDR1_HSTADDRP0_Pos)     /* (USBHS_HSTADDR1) USB Host Address Mask */
#define USBHS_HSTADDR1_HSTADDRP0(value)       (USBHS_HSTADDR1_HSTADDRP0_Msk & (_UINT32_(value) << USBHS_HSTADDR1_HSTADDRP0_Pos)) /* Assigment of value for HSTADDRP0 in the USBHS_HSTADDR1 register */
#define USBHS_HSTADDR1_HSTADDRP1_Pos          _UINT32_(8)                                          /* (USBHS_HSTADDR1) USB Host Address Position */
#define USBHS_HSTADDR1_HSTADDRP1_Msk          (_UINT32_(0x7F) << USBHS_HSTADDR1_HSTADDRP1_Pos)     /* (USBHS_HSTADDR1) USB Host Address Mask */
#define USBHS_HSTADDR1_HSTADDRP1(value)       (USBHS_HSTADDR1_HSTADDRP1_Msk & (_UINT32_(value) << USBHS_HSTADDR1_HSTADDRP1_Pos)) /* Assigment of value for HSTADDRP1 in the USBHS_HSTADDR1 register */
#define USBHS_HSTADDR1_HSTADDRP2_Pos          _UINT32_(16)                                         /* (USBHS_HSTADDR1) USB Host Address Position */
#define USBHS_HSTADDR1_HSTADDRP2_Msk          (_UINT32_(0x7F) << USBHS_HSTADDR1_HSTADDRP2_Pos)     /* (USBHS_HSTADDR1) USB Host Address Mask */
#define USBHS_HSTADDR1_HSTADDRP2(value)       (USBHS_HSTADDR1_HSTADDRP2_Msk & (_UINT32_(value) << USBHS_HSTADDR1_HSTADDRP2_Pos)) /* Assigment of value for HSTADDRP2 in the USBHS_HSTADDR1 register */
#define USBHS_HSTADDR1_HSTADDRP3_Pos          _UINT32_(24)                                         /* (USBHS_HSTADDR1) USB Host Address Position */
#define USBHS_HSTADDR1_HSTADDRP3_Msk          (_UINT32_(0x7F) << USBHS_HSTADDR1_HSTADDRP3_Pos)     /* (USBHS_HSTADDR1) USB Host Address Mask */
#define USBHS_HSTADDR1_HSTADDRP3(value)       (USBHS_HSTADDR1_HSTADDRP3_Msk & (_UINT32_(value) << USBHS_HSTADDR1_HSTADDRP3_Pos)) /* Assigment of value for HSTADDRP3 in the USBHS_HSTADDR1 register */
#define USBHS_HSTADDR1_Msk                    _UINT32_(0x7F7F7F7F)                                 /* (USBHS_HSTADDR1) Register Mask  */


/* -------- USBHS_HSTADDR2 : (USBHS Offset: 0x428) (R/W 32) Host Address 2 Register -------- */
#define USBHS_HSTADDR2_HSTADDRP4_Pos          _UINT32_(0)                                          /* (USBHS_HSTADDR2) USB Host Address Position */
#define USBHS_HSTADDR2_HSTADDRP4_Msk          (_UINT32_(0x7F) << USBHS_HSTADDR2_HSTADDRP4_Pos)     /* (USBHS_HSTADDR2) USB Host Address Mask */
#define USBHS_HSTADDR2_HSTADDRP4(value)       (USBHS_HSTADDR2_HSTADDRP4_Msk & (_UINT32_(value) << USBHS_HSTADDR2_HSTADDRP4_Pos)) /* Assigment of value for HSTADDRP4 in the USBHS_HSTADDR2 register */
#define USBHS_HSTADDR2_HSTADDRP5_Pos          _UINT32_(8)                                          /* (USBHS_HSTADDR2) USB Host Address Position */
#define USBHS_HSTADDR2_HSTADDRP5_Msk          (_UINT32_(0x7F) << USBHS_HSTADDR2_HSTADDRP5_Pos)     /* (USBHS_HSTADDR2) USB Host Address Mask */
#define USBHS_HSTADDR2_HSTADDRP5(value)       (USBHS_HSTADDR2_HSTADDRP5_Msk & (_UINT32_(value) << USBHS_HSTADDR2_HSTADDRP5_Pos)) /* Assigment of value for HSTADDRP5 in the USBHS_HSTADDR2 register */
#define USBHS_HSTADDR2_HSTADDRP6_Pos          _UINT32_(16)                                         /* (USBHS_HSTADDR2) USB Host Address Position */
#define USBHS_HSTADDR2_HSTADDRP6_Msk          (_UINT32_(0x7F) << USBHS_HSTADDR2_HSTADDRP6_Pos)     /* (USBHS_HSTADDR2) USB Host Address Mask */
#define USBHS_HSTADDR2_HSTADDRP6(value)       (USBHS_HSTADDR2_HSTADDRP6_Msk & (_UINT32_(value) << USBHS_HSTADDR2_HSTADDRP6_Pos)) /* Assigment of value for HSTADDRP6 in the USBHS_HSTADDR2 register */
#define USBHS_HSTADDR2_HSTADDRP7_Pos          _UINT32_(24)                                         /* (USBHS_HSTADDR2) USB Host Address Position */
#define USBHS_HSTADDR2_HSTADDRP7_Msk          (_UINT32_(0x7F) << USBHS_HSTADDR2_HSTADDRP7_Pos)     /* (USBHS_HSTADDR2) USB Host Address Mask */
#define USBHS_HSTADDR2_HSTADDRP7(value)       (USBHS_HSTADDR2_HSTADDRP7_Msk & (_UINT32_(value) << USBHS_HSTADDR2_HSTADDRP7_Pos)) /* Assigment of value for HSTADDRP7 in the USBHS_HSTADDR2 register */
#define USBHS_HSTADDR2_Msk                    _UINT32_(0x7F7F7F7F)                                 /* (USBHS_HSTADDR2) Register Mask  */


/* -------- USBHS_HSTADDR3 : (USBHS Offset: 0x42C) (R/W 32) Host Address 3 Register -------- */
#define USBHS_HSTADDR3_HSTADDRP8_Pos          _UINT32_(0)                                          /* (USBHS_HSTADDR3) USB Host Address Position */
#define USBHS_HSTADDR3_HSTADDRP8_Msk          (_UINT32_(0x7F) << USBHS_HSTADDR3_HSTADDRP8_Pos)     /* (USBHS_HSTADDR3) USB Host Address Mask */
#define USBHS_HSTADDR3_HSTADDRP8(value)       (USBHS_HSTADDR3_HSTADDRP8_Msk & (_UINT32_(value) << USBHS_HSTADDR3_HSTADDRP8_Pos)) /* Assigment of value for HSTADDRP8 in the USBHS_HSTADDR3 register */
#define USBHS_HSTADDR3_HSTADDRP9_Pos          _UINT32_(8)                                          /* (USBHS_HSTADDR3) USB Host Address Position */
#define USBHS_HSTADDR3_HSTADDRP9_Msk          (_UINT32_(0x7F) << USBHS_HSTADDR3_HSTADDRP9_Pos)     /* (USBHS_HSTADDR3) USB Host Address Mask */
#define USBHS_HSTADDR3_HSTADDRP9(value)       (USBHS_HSTADDR3_HSTADDRP9_Msk & (_UINT32_(value) << USBHS_HSTADDR3_HSTADDRP9_Pos)) /* Assigment of value for HSTADDRP9 in the USBHS_HSTADDR3 register */
#define USBHS_HSTADDR3_Msk                    _UINT32_(0x00007F7F)                                 /* (USBHS_HSTADDR3) Register Mask  */


/* -------- USBHS_HSTPIPCFG : (USBHS Offset: 0x500) (R/W 32) Host Pipe Configuration Register -------- */
#define USBHS_HSTPIPCFG_ALLOC_Pos             _UINT32_(1)                                          /* (USBHS_HSTPIPCFG) Pipe Memory Allocate Position */
#define USBHS_HSTPIPCFG_ALLOC_Msk             (_UINT32_(0x1) << USBHS_HSTPIPCFG_ALLOC_Pos)         /* (USBHS_HSTPIPCFG) Pipe Memory Allocate Mask */
#define USBHS_HSTPIPCFG_ALLOC(value)          (USBHS_HSTPIPCFG_ALLOC_Msk & (_UINT32_(value) << USBHS_HSTPIPCFG_ALLOC_Pos)) /* Assigment of value for ALLOC in the USBHS_HSTPIPCFG register */
#define USBHS_HSTPIPCFG_PBK_Pos               _UINT32_(2)                                          /* (USBHS_HSTPIPCFG) Pipe Banks Position */
#define USBHS_HSTPIPCFG_PBK_Msk               (_UINT32_(0x3) << USBHS_HSTPIPCFG_PBK_Pos)           /* (USBHS_HSTPIPCFG) Pipe Banks Mask */
#define USBHS_HSTPIPCFG_PBK(value)            (USBHS_HSTPIPCFG_PBK_Msk & (_UINT32_(value) << USBHS_HSTPIPCFG_PBK_Pos)) /* Assigment of value for PBK in the USBHS_HSTPIPCFG register */
#define   USBHS_HSTPIPCFG_PBK_1_BANK_Val      _UINT32_(0x0)                                        /* (USBHS_HSTPIPCFG) Single-bank pipe  */
#define   USBHS_HSTPIPCFG_PBK_2_BANK_Val      _UINT32_(0x1)                                        /* (USBHS_HSTPIPCFG) Double-bank pipe  */
#define   USBHS_HSTPIPCFG_PBK_3_BANK_Val      _UINT32_(0x2)                                        /* (USBHS_HSTPIPCFG) Triple-bank pipe  */
#define USBHS_HSTPIPCFG_PBK_1_BANK            (USBHS_HSTPIPCFG_PBK_1_BANK_Val << USBHS_HSTPIPCFG_PBK_Pos) /* (USBHS_HSTPIPCFG) Single-bank pipe Position  */
#define USBHS_HSTPIPCFG_PBK_2_BANK            (USBHS_HSTPIPCFG_PBK_2_BANK_Val << USBHS_HSTPIPCFG_PBK_Pos) /* (USBHS_HSTPIPCFG) Double-bank pipe Position  */
#define USBHS_HSTPIPCFG_PBK_3_BANK            (USBHS_HSTPIPCFG_PBK_3_BANK_Val << USBHS_HSTPIPCFG_PBK_Pos) /* (USBHS_HSTPIPCFG) Triple-bank pipe Position  */
#define USBHS_HSTPIPCFG_PSIZE_Pos             _UINT32_(4)                                          /* (USBHS_HSTPIPCFG) Pipe Size Position */
#define USBHS_HSTPIPCFG_PSIZE_Msk             (_UINT32_(0x7) << USBHS_HSTPIPCFG_PSIZE_Pos)         /* (USBHS_HSTPIPCFG) Pipe Size Mask */
#define USBHS_HSTPIPCFG_PSIZE(value)          (USBHS_HSTPIPCFG_PSIZE_Msk & (_UINT32_(value) << USBHS_HSTPIPCFG_PSIZE_Pos)) /* Assigment of value for PSIZE in the USBHS_HSTPIPCFG register */
#define   USBHS_HSTPIPCFG_PSIZE_8_BYTE_Val    _UINT32_(0x0)                                        /* (USBHS_HSTPIPCFG) 8 bytes  */
#define   USBHS_HSTPIPCFG_PSIZE_16_BYTE_Val   _UINT32_(0x1)                                        /* (USBHS_HSTPIPCFG) 16 bytes  */
#define   USBHS_HSTPIPCFG_PSIZE_32_BYTE_Val   _UINT32_(0x2)                                        /* (USBHS_HSTPIPCFG) 32 bytes  */
#define   USBHS_HSTPIPCFG_PSIZE_64_BYTE_Val   _UINT32_(0x3)                                        /* (USBHS_HSTPIPCFG) 64 bytes  */
#define   USBHS_HSTPIPCFG_PSIZE_128_BYTE_Val  _UINT32_(0x4)                                        /* (USBHS_HSTPIPCFG) 128 bytes  */
#define   USBHS_HSTPIPCFG_PSIZE_256_BYTE_Val  _UINT32_(0x5)                                        /* (USBHS_HSTPIPCFG) 256 bytes  */
#define   USBHS_HSTPIPCFG_PSIZE_512_BYTE_Val  _UINT32_(0x6)                                        /* (USBHS_HSTPIPCFG) 512 bytes  */
#define   USBHS_HSTPIPCFG_PSIZE_1024_BYTE_Val _UINT32_(0x7)                                        /* (USBHS_HSTPIPCFG) 1024 bytes  */
#define USBHS_HSTPIPCFG_PSIZE_8_BYTE          (USBHS_HSTPIPCFG_PSIZE_8_BYTE_Val << USBHS_HSTPIPCFG_PSIZE_Pos) /* (USBHS_HSTPIPCFG) 8 bytes Position  */
#define USBHS_HSTPIPCFG_PSIZE_16_BYTE         (USBHS_HSTPIPCFG_PSIZE_16_BYTE_Val << USBHS_HSTPIPCFG_PSIZE_Pos) /* (USBHS_HSTPIPCFG) 16 bytes Position  */
#define USBHS_HSTPIPCFG_PSIZE_32_BYTE         (USBHS_HSTPIPCFG_PSIZE_32_BYTE_Val << USBHS_HSTPIPCFG_PSIZE_Pos) /* (USBHS_HSTPIPCFG) 32 bytes Position  */
#define USBHS_HSTPIPCFG_PSIZE_64_BYTE         (USBHS_HSTPIPCFG_PSIZE_64_BYTE_Val << USBHS_HSTPIPCFG_PSIZE_Pos) /* (USBHS_HSTPIPCFG) 64 bytes Position  */
#define USBHS_HSTPIPCFG_PSIZE_128_BYTE        (USBHS_HSTPIPCFG_PSIZE_128_BYTE_Val << USBHS_HSTPIPCFG_PSIZE_Pos) /* (USBHS_HSTPIPCFG) 128 bytes Position  */
#define USBHS_HSTPIPCFG_PSIZE_256_BYTE        (USBHS_HSTPIPCFG_PSIZE_256_BYTE_Val << USBHS_HSTPIPCFG_PSIZE_Pos) /* (USBHS_HSTPIPCFG) 256 bytes Position  */
#define USBHS_HSTPIPCFG_PSIZE_512_BYTE        (USBHS_HSTPIPCFG_PSIZE_512_BYTE_Val << USBHS_HSTPIPCFG_PSIZE_Pos) /* (USBHS_HSTPIPCFG) 512 bytes Position  */
#define USBHS_HSTPIPCFG_PSIZE_1024_BYTE       (USBHS_HSTPIPCFG_PSIZE_1024_BYTE_Val << USBHS_HSTPIPCFG_PSIZE_Pos) /* (USBHS_HSTPIPCFG) 1024 bytes Position  */
#define USBHS_HSTPIPCFG_PTOKEN_Pos            _UINT32_(8)                                          /* (USBHS_HSTPIPCFG) Pipe Token Position */
#define USBHS_HSTPIPCFG_PTOKEN_Msk            (_UINT32_(0x3) << USBHS_HSTPIPCFG_PTOKEN_Pos)        /* (USBHS_HSTPIPCFG) Pipe Token Mask */
#define USBHS_HSTPIPCFG_PTOKEN(value)         (USBHS_HSTPIPCFG_PTOKEN_Msk & (_UINT32_(value) << USBHS_HSTPIPCFG_PTOKEN_Pos)) /* Assigment of value for PTOKEN in the USBHS_HSTPIPCFG register */
#define   USBHS_HSTPIPCFG_PTOKEN_SETUP_Val    _UINT32_(0x0)                                        /* (USBHS_HSTPIPCFG) SETUP  */
#define   USBHS_HSTPIPCFG_PTOKEN_IN_Val       _UINT32_(0x1)                                        /* (USBHS_HSTPIPCFG) IN  */
#define   USBHS_HSTPIPCFG_PTOKEN_OUT_Val      _UINT32_(0x2)                                        /* (USBHS_HSTPIPCFG) OUT  */
#define USBHS_HSTPIPCFG_PTOKEN_SETUP          (USBHS_HSTPIPCFG_PTOKEN_SETUP_Val << USBHS_HSTPIPCFG_PTOKEN_Pos) /* (USBHS_HSTPIPCFG) SETUP Position  */
#define USBHS_HSTPIPCFG_PTOKEN_IN             (USBHS_HSTPIPCFG_PTOKEN_IN_Val << USBHS_HSTPIPCFG_PTOKEN_Pos) /* (USBHS_HSTPIPCFG) IN Position  */
#define USBHS_HSTPIPCFG_PTOKEN_OUT            (USBHS_HSTPIPCFG_PTOKEN_OUT_Val << USBHS_HSTPIPCFG_PTOKEN_Pos) /* (USBHS_HSTPIPCFG) OUT Position  */
#define USBHS_HSTPIPCFG_AUTOSW_Pos            _UINT32_(10)                                         /* (USBHS_HSTPIPCFG) Automatic Switch Position */
#define USBHS_HSTPIPCFG_AUTOSW_Msk            (_UINT32_(0x1) << USBHS_HSTPIPCFG_AUTOSW_Pos)        /* (USBHS_HSTPIPCFG) Automatic Switch Mask */
#define USBHS_HSTPIPCFG_AUTOSW(value)         (USBHS_HSTPIPCFG_AUTOSW_Msk & (_UINT32_(value) << USBHS_HSTPIPCFG_AUTOSW_Pos)) /* Assigment of value for AUTOSW in the USBHS_HSTPIPCFG register */
#define USBHS_HSTPIPCFG_PTYPE_Pos             _UINT32_(12)                                         /* (USBHS_HSTPIPCFG) Pipe Type Position */
#define USBHS_HSTPIPCFG_PTYPE_Msk             (_UINT32_(0x3) << USBHS_HSTPIPCFG_PTYPE_Pos)         /* (USBHS_HSTPIPCFG) Pipe Type Mask */
#define USBHS_HSTPIPCFG_PTYPE(value)          (USBHS_HSTPIPCFG_PTYPE_Msk & (_UINT32_(value) << USBHS_HSTPIPCFG_PTYPE_Pos)) /* Assigment of value for PTYPE in the USBHS_HSTPIPCFG register */
#define   USBHS_HSTPIPCFG_PTYPE_CTRL_Val      _UINT32_(0x0)                                        /* (USBHS_HSTPIPCFG) Control  */
#define   USBHS_HSTPIPCFG_PTYPE_ISO_Val       _UINT32_(0x1)                                        /* (USBHS_HSTPIPCFG) Isochronous  */
#define   USBHS_HSTPIPCFG_PTYPE_BLK_Val       _UINT32_(0x2)                                        /* (USBHS_HSTPIPCFG) Bulk  */
#define   USBHS_HSTPIPCFG_PTYPE_INTRPT_Val    _UINT32_(0x3)                                        /* (USBHS_HSTPIPCFG) Interrupt  */
#define USBHS_HSTPIPCFG_PTYPE_CTRL            (USBHS_HSTPIPCFG_PTYPE_CTRL_Val << USBHS_HSTPIPCFG_PTYPE_Pos) /* (USBHS_HSTPIPCFG) Control Position  */
#define USBHS_HSTPIPCFG_PTYPE_ISO             (USBHS_HSTPIPCFG_PTYPE_ISO_Val << USBHS_HSTPIPCFG_PTYPE_Pos) /* (USBHS_HSTPIPCFG) Isochronous Position  */
#define USBHS_HSTPIPCFG_PTYPE_BLK             (USBHS_HSTPIPCFG_PTYPE_BLK_Val << USBHS_HSTPIPCFG_PTYPE_Pos) /* (USBHS_HSTPIPCFG) Bulk Position  */
#define USBHS_HSTPIPCFG_PTYPE_INTRPT          (USBHS_HSTPIPCFG_PTYPE_INTRPT_Val << USBHS_HSTPIPCFG_PTYPE_Pos) /* (USBHS_HSTPIPCFG) Interrupt Position  */
#define USBHS_HSTPIPCFG_PEPNUM_Pos            _UINT32_(16)                                         /* (USBHS_HSTPIPCFG) Pipe Endpoint Number Position */
#define USBHS_HSTPIPCFG_PEPNUM_Msk            (_UINT32_(0xF) << USBHS_HSTPIPCFG_PEPNUM_Pos)        /* (USBHS_HSTPIPCFG) Pipe Endpoint Number Mask */
#define USBHS_HSTPIPCFG_PEPNUM(value)         (USBHS_HSTPIPCFG_PEPNUM_Msk & (_UINT32_(value) << USBHS_HSTPIPCFG_PEPNUM_Pos)) /* Assigment of value for PEPNUM in the USBHS_HSTPIPCFG register */
#define USBHS_HSTPIPCFG_INTFRQ_Pos            _UINT32_(24)                                         /* (USBHS_HSTPIPCFG) Pipe Interrupt Request Frequency Position */
#define USBHS_HSTPIPCFG_INTFRQ_Msk            (_UINT32_(0xFF) << USBHS_HSTPIPCFG_INTFRQ_Pos)       /* (USBHS_HSTPIPCFG) Pipe Interrupt Request Frequency Mask */
#define USBHS_HSTPIPCFG_INTFRQ(value)         (USBHS_HSTPIPCFG_INTFRQ_Msk & (_UINT32_(value) << USBHS_HSTPIPCFG_INTFRQ_Pos)) /* Assigment of value for INTFRQ in the USBHS_HSTPIPCFG register */
#define USBHS_HSTPIPCFG_Msk                   _UINT32_(0xFF0F377E)                                 /* (USBHS_HSTPIPCFG) Register Mask  */

/* CTRL_BULK mode */
#define USBHS_HSTPIPCFG_CTRL_BULK_PINGEN_Pos  _UINT32_(20)                                         /* (USBHS_HSTPIPCFG) Ping Enable Position */
#define USBHS_HSTPIPCFG_CTRL_BULK_PINGEN_Msk  (_UINT32_(0x1) << USBHS_HSTPIPCFG_CTRL_BULK_PINGEN_Pos) /* (USBHS_HSTPIPCFG) Ping Enable Mask */
#define USBHS_HSTPIPCFG_CTRL_BULK_PINGEN(value) (USBHS_HSTPIPCFG_CTRL_BULK_PINGEN_Msk & (_UINT32_(value) << USBHS_HSTPIPCFG_CTRL_BULK_PINGEN_Pos))
#define USBHS_HSTPIPCFG_CTRL_BULK_BINTERVAL_Pos _UINT32_(24)                                         /* (USBHS_HSTPIPCFG) bInterval Parameter for the Bulk-Out/Ping Transaction Position */
#define USBHS_HSTPIPCFG_CTRL_BULK_BINTERVAL_Msk (_UINT32_(0xFF) << USBHS_HSTPIPCFG_CTRL_BULK_BINTERVAL_Pos) /* (USBHS_HSTPIPCFG) bInterval Parameter for the Bulk-Out/Ping Transaction Mask */
#define USBHS_HSTPIPCFG_CTRL_BULK_BINTERVAL(value) (USBHS_HSTPIPCFG_CTRL_BULK_BINTERVAL_Msk & (_UINT32_(value) << USBHS_HSTPIPCFG_CTRL_BULK_BINTERVAL_Pos))
#define USBHS_HSTPIPCFG_CTRL_BULK_Msk         _UINT32_(0xFF100000)                                  /* (USBHS_HSTPIPCFG_CTRL_BULK) Register Mask  */


