Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/usbhs.h
/* -------- USBHS_HSTPIPISR : (USBHS Offset: 0x530) ( R/ 32) Host Pipe Status Register -------- */
#define USBHS_HSTPIPISR_RXINI_Pos             _UINT32_(0)                                          /* (USBHS_HSTPIPISR) Received IN Data Interrupt Position */
#define USBHS_HSTPIPISR_RXINI_Msk             (_UINT32_(0x1) << USBHS_HSTPIPISR_RXINI_Pos)         /* (USBHS_HSTPIPISR) Received IN Data Interrupt Mask */
#define USBHS_HSTPIPISR_RXINI(value)          (USBHS_HSTPIPISR_RXINI_Msk & (_UINT32_(value) << USBHS_HSTPIPISR_RXINI_Pos)) /* Assigment of value for RXINI in the USBHS_HSTPIPISR register */
#define USBHS_HSTPIPISR_TXOUTI_Pos            _UINT32_(1)                                          /* (USBHS_HSTPIPISR) Transmitted OUT Data Interrupt Position */
#define USBHS_HSTPIPISR_TXOUTI_Msk            (_UINT32_(0x1) << USBHS_HSTPIPISR_TXOUTI_Pos)        /* (USBHS_HSTPIPISR) Transmitted OUT Data Interrupt Mask */
#define USBHS_HSTPIPISR_TXOUTI(value)         (USBHS_HSTPIPISR_TXOUTI_Msk & (_UINT32_(value) << USBHS_HSTPIPISR_TXOUTI_Pos)) /* Assigment of value for TXOUTI in the USBHS_HSTPIPISR register */
#define USBHS_HSTPIPISR_PERRI_Pos             _UINT32_(3)                                          /* (USBHS_HSTPIPISR) Pipe Error Interrupt Position */
#define USBHS_HSTPIPISR_PERRI_Msk             (_UINT32_(0x1) << USBHS_HSTPIPISR_PERRI_Pos)         /* (USBHS_HSTPIPISR) Pipe Error Interrupt Mask */
#define USBHS_HSTPIPISR_PERRI(value)          (USBHS_HSTPIPISR_PERRI_Msk & (_UINT32_(value) << USBHS_HSTPIPISR_PERRI_Pos)) /* Assigment of value for PERRI in the USBHS_HSTPIPISR register */
#define USBHS_HSTPIPISR_NAKEDI_Pos            _UINT32_(4)                                          /* (USBHS_HSTPIPISR) NAKed Interrupt Position */
#define USBHS_HSTPIPISR_NAKEDI_Msk            (_UINT32_(0x1) << USBHS_HSTPIPISR_NAKEDI_Pos)        /* (USBHS_HSTPIPISR) NAKed Interrupt Mask */
#define USBHS_HSTPIPISR_NAKEDI(value)         (USBHS_HSTPIPISR_NAKEDI_Msk & (_UINT32_(value) << USBHS_HSTPIPISR_NAKEDI_Pos)) /* Assigment of value for NAKEDI in the USBHS_HSTPIPISR register */
#define USBHS_HSTPIPISR_OVERFI_Pos            _UINT32_(5)                                          /* (USBHS_HSTPIPISR) Overflow Interrupt Position */
#define USBHS_HSTPIPISR_OVERFI_Msk            (_UINT32_(0x1) << USBHS_HSTPIPISR_OVERFI_Pos)        /* (USBHS_HSTPIPISR) Overflow Interrupt Mask */
#define USBHS_HSTPIPISR_OVERFI(value)         (USBHS_HSTPIPISR_OVERFI_Msk & (_UINT32_(value) << USBHS_HSTPIPISR_OVERFI_Pos)) /* Assigment of value for OVERFI in the USBHS_HSTPIPISR register */
#define USBHS_HSTPIPISR_SHORTPACKETI_Pos      _UINT32_(7)                                          /* (USBHS_HSTPIPISR) Short Packet Interrupt Position */
#define USBHS_HSTPIPISR_SHORTPACKETI_Msk      (_UINT32_(0x1) << USBHS_HSTPIPISR_SHORTPACKETI_Pos)  /* (USBHS_HSTPIPISR) Short Packet Interrupt Mask */
#define USBHS_HSTPIPISR_SHORTPACKETI(value)   (USBHS_HSTPIPISR_SHORTPACKETI_Msk & (_UINT32_(value) << USBHS_HSTPIPISR_SHORTPACKETI_Pos)) /* Assigment of value for SHORTPACKETI in the USBHS_HSTPIPISR register */
#define USBHS_HSTPIPISR_DTSEQ_Pos             _UINT32_(8)                                          /* (USBHS_HSTPIPISR) Data Toggle Sequence Position */
#define USBHS_HSTPIPISR_DTSEQ_Msk             (_UINT32_(0x3) << USBHS_HSTPIPISR_DTSEQ_Pos)         /* (USBHS_HSTPIPISR) Data Toggle Sequence Mask */
#define USBHS_HSTPIPISR_DTSEQ(value)          (USBHS_HSTPIPISR_DTSEQ_Msk & (_UINT32_(value) << USBHS_HSTPIPISR_DTSEQ_Pos)) /* Assigment of value for DTSEQ in the USBHS_HSTPIPISR register */
#define   USBHS_HSTPIPISR_DTSEQ_DATA0_Val     _UINT32_(0x0)                                        /* (USBHS_HSTPIPISR) Data0 toggle sequence  */
#define   USBHS_HSTPIPISR_DTSEQ_DATA1_Val     _UINT32_(0x1)                                        /* (USBHS_HSTPIPISR) Data1 toggle sequence  */
#define USBHS_HSTPIPISR_DTSEQ_DATA0           (USBHS_HSTPIPISR_DTSEQ_DATA0_Val << USBHS_HSTPIPISR_DTSEQ_Pos) /* (USBHS_HSTPIPISR) Data0 toggle sequence Position  */
#define USBHS_HSTPIPISR_DTSEQ_DATA1           (USBHS_HSTPIPISR_DTSEQ_DATA1_Val << USBHS_HSTPIPISR_DTSEQ_Pos) /* (USBHS_HSTPIPISR) Data1 toggle sequence Position  */
#define USBHS_HSTPIPISR_NBUSYBK_Pos           _UINT32_(12)                                         /* (USBHS_HSTPIPISR) Number of Busy Banks Position */
#define USBHS_HSTPIPISR_NBUSYBK_Msk           (_UINT32_(0x3) << USBHS_HSTPIPISR_NBUSYBK_Pos)       /* (USBHS_HSTPIPISR) Number of Busy Banks Mask */
#define USBHS_HSTPIPISR_NBUSYBK(value)        (USBHS_HSTPIPISR_NBUSYBK_Msk & (_UINT32_(value) << USBHS_HSTPIPISR_NBUSYBK_Pos)) /* Assigment of value for NBUSYBK in the USBHS_HSTPIPISR register */
#define   USBHS_HSTPIPISR_NBUSYBK_0_BUSY_Val  _UINT32_(0x0)                                        /* (USBHS_HSTPIPISR) 0 busy bank (all banks free)  */
#define   USBHS_HSTPIPISR_NBUSYBK_1_BUSY_Val  _UINT32_(0x1)                                        /* (USBHS_HSTPIPISR) 1 busy bank  */
#define   USBHS_HSTPIPISR_NBUSYBK_2_BUSY_Val  _UINT32_(0x2)                                        /* (USBHS_HSTPIPISR) 2 busy banks  */
#define   USBHS_HSTPIPISR_NBUSYBK_3_BUSY_Val  _UINT32_(0x3)                                        /* (USBHS_HSTPIPISR) 3 busy banks  */
#define USBHS_HSTPIPISR_NBUSYBK_0_BUSY        (USBHS_HSTPIPISR_NBUSYBK_0_BUSY_Val << USBHS_HSTPIPISR_NBUSYBK_Pos) /* (USBHS_HSTPIPISR) 0 busy bank (all banks free) Position  */
#define USBHS_HSTPIPISR_NBUSYBK_1_BUSY        (USBHS_HSTPIPISR_NBUSYBK_1_BUSY_Val << USBHS_HSTPIPISR_NBUSYBK_Pos) /* (USBHS_HSTPIPISR) 1 busy bank Position  */
#define USBHS_HSTPIPISR_NBUSYBK_2_BUSY        (USBHS_HSTPIPISR_NBUSYBK_2_BUSY_Val << USBHS_HSTPIPISR_NBUSYBK_Pos) /* (USBHS_HSTPIPISR) 2 busy banks Position  */
#define USBHS_HSTPIPISR_NBUSYBK_3_BUSY        (USBHS_HSTPIPISR_NBUSYBK_3_BUSY_Val << USBHS_HSTPIPISR_NBUSYBK_Pos) /* (USBHS_HSTPIPISR) 3 busy banks Position  */
#define USBHS_HSTPIPISR_CURRBK_Pos            _UINT32_(14)                                         /* (USBHS_HSTPIPISR) Current Bank Position */
#define USBHS_HSTPIPISR_CURRBK_Msk            (_UINT32_(0x3) << USBHS_HSTPIPISR_CURRBK_Pos)        /* (USBHS_HSTPIPISR) Current Bank Mask */
#define USBHS_HSTPIPISR_CURRBK(value)         (USBHS_HSTPIPISR_CURRBK_Msk & (_UINT32_(value) << USBHS_HSTPIPISR_CURRBK_Pos)) /* Assigment of value for CURRBK in the USBHS_HSTPIPISR register */
#define   USBHS_HSTPIPISR_CURRBK_BANK0_Val    _UINT32_(0x0)                                        /* (USBHS_HSTPIPISR) Current bank is bank0  */
#define   USBHS_HSTPIPISR_CURRBK_BANK1_Val    _UINT32_(0x1)                                        /* (USBHS_HSTPIPISR) Current bank is bank1  */
#define   USBHS_HSTPIPISR_CURRBK_BANK2_Val    _UINT32_(0x2)                                        /* (USBHS_HSTPIPISR) Current bank is bank2  */
#define USBHS_HSTPIPISR_CURRBK_BANK0          (USBHS_HSTPIPISR_CURRBK_BANK0_Val << USBHS_HSTPIPISR_CURRBK_Pos) /* (USBHS_HSTPIPISR) Current bank is bank0 Position  */
#define USBHS_HSTPIPISR_CURRBK_BANK1          (USBHS_HSTPIPISR_CURRBK_BANK1_Val << USBHS_HSTPIPISR_CURRBK_Pos) /* (USBHS_HSTPIPISR) Current bank is bank1 Position  */
#define USBHS_HSTPIPISR_CURRBK_BANK2          (USBHS_HSTPIPISR_CURRBK_BANK2_Val << USBHS_HSTPIPISR_CURRBK_Pos) /* (USBHS_HSTPIPISR) Current bank is bank2 Position  */
#define USBHS_HSTPIPISR_RWALL_Pos             _UINT32_(16)                                         /* (USBHS_HSTPIPISR) Read/Write Allowed Position */
#define USBHS_HSTPIPISR_RWALL_Msk             (_UINT32_(0x1) << USBHS_HSTPIPISR_RWALL_Pos)         /* (USBHS_HSTPIPISR) Read/Write Allowed Mask */
#define USBHS_HSTPIPISR_RWALL(value)          (USBHS_HSTPIPISR_RWALL_Msk & (_UINT32_(value) << USBHS_HSTPIPISR_RWALL_Pos)) /* Assigment of value for RWALL in the USBHS_HSTPIPISR register */
#define USBHS_HSTPIPISR_CFGOK_Pos             _UINT32_(18)                                         /* (USBHS_HSTPIPISR) Configuration OK Status Position */
#define USBHS_HSTPIPISR_CFGOK_Msk             (_UINT32_(0x1) << USBHS_HSTPIPISR_CFGOK_Pos)         /* (USBHS_HSTPIPISR) Configuration OK Status Mask */
#define USBHS_HSTPIPISR_CFGOK(value)          (USBHS_HSTPIPISR_CFGOK_Msk & (_UINT32_(value) << USBHS_HSTPIPISR_CFGOK_Pos)) /* Assigment of value for CFGOK in the USBHS_HSTPIPISR register */
#define USBHS_HSTPIPISR_PBYCT_Pos             _UINT32_(20)                                         /* (USBHS_HSTPIPISR) Pipe Byte Count Position */
#define USBHS_HSTPIPISR_PBYCT_Msk             (_UINT32_(0x7FF) << USBHS_HSTPIPISR_PBYCT_Pos)       /* (USBHS_HSTPIPISR) Pipe Byte Count Mask */
#define USBHS_HSTPIPISR_PBYCT(value)          (USBHS_HSTPIPISR_PBYCT_Msk & (_UINT32_(value) << USBHS_HSTPIPISR_PBYCT_Pos)) /* Assigment of value for PBYCT in the USBHS_HSTPIPISR register */
#define USBHS_HSTPIPISR_Msk                   _UINT32_(0x7FF5F3BB)                                 /* (USBHS_HSTPIPISR) Register Mask  */

/* CTRL mode */
#define USBHS_HSTPIPISR_CTRL_TXSTPI_Pos       _UINT32_(2)                                          /* (USBHS_HSTPIPISR) Transmitted SETUP Interrupt Position */
#define USBHS_HSTPIPISR_CTRL_TXSTPI_Msk       (_UINT32_(0x1) << USBHS_HSTPIPISR_CTRL_TXSTPI_Pos)   /* (USBHS_HSTPIPISR) Transmitted SETUP Interrupt Mask */
#define USBHS_HSTPIPISR_CTRL_TXSTPI(value)    (USBHS_HSTPIPISR_CTRL_TXSTPI_Msk & (_UINT32_(value) << USBHS_HSTPIPISR_CTRL_TXSTPI_Pos))
#define USBHS_HSTPIPISR_CTRL_RXSTALLDI_Pos    _UINT32_(6)                                          /* (USBHS_HSTPIPISR) Received STALLed Interrupt Position */
#define USBHS_HSTPIPISR_CTRL_RXSTALLDI_Msk    (_UINT32_(0x1) << USBHS_HSTPIPISR_CTRL_RXSTALLDI_Pos) /* (USBHS_HSTPIPISR) Received STALLed Interrupt Mask */
#define USBHS_HSTPIPISR_CTRL_RXSTALLDI(value) (USBHS_HSTPIPISR_CTRL_RXSTALLDI_Msk & (_UINT32_(value) << USBHS_HSTPIPISR_CTRL_RXSTALLDI_Pos))
#define USBHS_HSTPIPISR_CTRL_Msk              _UINT32_(0x00000044)                                  /* (USBHS_HSTPIPISR_CTRL) Register Mask  */

