Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/usbhs.h
/* ISO mode */
#define USBHS_HSTPIPISR_ISO_UNDERFI_Pos       _UINT32_(2)                                          /* (USBHS_HSTPIPISR) Underflow Interrupt Position */
#define USBHS_HSTPIPISR_ISO_UNDERFI_Msk       (_UINT32_(0x1) << USBHS_HSTPIPISR_ISO_UNDERFI_Pos)   /* (USBHS_HSTPIPISR) Underflow Interrupt Mask */
#define USBHS_HSTPIPISR_ISO_UNDERFI(value)    (USBHS_HSTPIPISR_ISO_UNDERFI_Msk & (_UINT32_(value) << USBHS_HSTPIPISR_ISO_UNDERFI_Pos))
#define USBHS_HSTPIPISR_ISO_CRCERRI_Pos       _UINT32_(6)                                          /* (USBHS_HSTPIPISR) CRC Error Interrupt Position */
#define USBHS_HSTPIPISR_ISO_CRCERRI_Msk       (_UINT32_(0x1) << USBHS_HSTPIPISR_ISO_CRCERRI_Pos)   /* (USBHS_HSTPIPISR) CRC Error Interrupt Mask */
#define USBHS_HSTPIPISR_ISO_CRCERRI(value)    (USBHS_HSTPIPISR_ISO_CRCERRI_Msk & (_UINT32_(value) << USBHS_HSTPIPISR_ISO_CRCERRI_Pos))
#define USBHS_HSTPIPISR_ISO_Msk               _UINT32_(0x00000044)                                  /* (USBHS_HSTPIPISR_ISO) Register Mask  */

/* BLK mode */
#define USBHS_HSTPIPISR_BLK_TXSTPI_Pos        _UINT32_(2)                                          /* (USBHS_HSTPIPISR) Transmitted SETUP Interrupt Position */
#define USBHS_HSTPIPISR_BLK_TXSTPI_Msk        (_UINT32_(0x1) << USBHS_HSTPIPISR_BLK_TXSTPI_Pos)    /* (USBHS_HSTPIPISR) Transmitted SETUP Interrupt Mask */
#define USBHS_HSTPIPISR_BLK_TXSTPI(value)     (USBHS_HSTPIPISR_BLK_TXSTPI_Msk & (_UINT32_(value) << USBHS_HSTPIPISR_BLK_TXSTPI_Pos))
#define USBHS_HSTPIPISR_BLK_RXSTALLDI_Pos     _UINT32_(6)                                          /* (USBHS_HSTPIPISR) Received STALLed Interrupt Position */
#define USBHS_HSTPIPISR_BLK_RXSTALLDI_Msk     (_UINT32_(0x1) << USBHS_HSTPIPISR_BLK_RXSTALLDI_Pos) /* (USBHS_HSTPIPISR) Received STALLed Interrupt Mask */
#define USBHS_HSTPIPISR_BLK_RXSTALLDI(value)  (USBHS_HSTPIPISR_BLK_RXSTALLDI_Msk & (_UINT32_(value) << USBHS_HSTPIPISR_BLK_RXSTALLDI_Pos))
#define USBHS_HSTPIPISR_BLK_Msk               _UINT32_(0x00000044)                                  /* (USBHS_HSTPIPISR_BLK) Register Mask  */

/* INTRPT mode */
#define USBHS_HSTPIPISR_INTRPT_UNDERFI_Pos    _UINT32_(2)                                          /* (USBHS_HSTPIPISR) Underflow Interrupt Position */
#define USBHS_HSTPIPISR_INTRPT_UNDERFI_Msk    (_UINT32_(0x1) << USBHS_HSTPIPISR_INTRPT_UNDERFI_Pos) /* (USBHS_HSTPIPISR) Underflow Interrupt Mask */
#define USBHS_HSTPIPISR_INTRPT_UNDERFI(value) (USBHS_HSTPIPISR_INTRPT_UNDERFI_Msk & (_UINT32_(value) << USBHS_HSTPIPISR_INTRPT_UNDERFI_Pos))
#define USBHS_HSTPIPISR_INTRPT_RXSTALLDI_Pos  _UINT32_(6)                                          /* (USBHS_HSTPIPISR) Received STALLed Interrupt Position */
#define USBHS_HSTPIPISR_INTRPT_RXSTALLDI_Msk  (_UINT32_(0x1) << USBHS_HSTPIPISR_INTRPT_RXSTALLDI_Pos) /* (USBHS_HSTPIPISR) Received STALLed Interrupt Mask */
#define USBHS_HSTPIPISR_INTRPT_RXSTALLDI(value) (USBHS_HSTPIPISR_INTRPT_RXSTALLDI_Msk & (_UINT32_(value) << USBHS_HSTPIPISR_INTRPT_RXSTALLDI_Pos))
#define USBHS_HSTPIPISR_INTRPT_Msk            _UINT32_(0x00000044)                                  /* (USBHS_HSTPIPISR_INTRPT) Register Mask  */


/* -------- USBHS_HSTPIPICR : (USBHS Offset: 0x560) ( /W 32) Host Pipe Clear Register -------- */
#define USBHS_HSTPIPICR_RXINIC_Pos            _UINT32_(0)                                          /* (USBHS_HSTPIPICR) Received IN Data Interrupt Clear Position */
#define USBHS_HSTPIPICR_RXINIC_Msk            (_UINT32_(0x1) << USBHS_HSTPIPICR_RXINIC_Pos)        /* (USBHS_HSTPIPICR) Received IN Data Interrupt Clear Mask */
#define USBHS_HSTPIPICR_RXINIC(value)         (USBHS_HSTPIPICR_RXINIC_Msk & (_UINT32_(value) << USBHS_HSTPIPICR_RXINIC_Pos)) /* Assigment of value for RXINIC in the USBHS_HSTPIPICR register */
#define USBHS_HSTPIPICR_TXOUTIC_Pos           _UINT32_(1)                                          /* (USBHS_HSTPIPICR) Transmitted OUT Data Interrupt Clear Position */
#define USBHS_HSTPIPICR_TXOUTIC_Msk           (_UINT32_(0x1) << USBHS_HSTPIPICR_TXOUTIC_Pos)       /* (USBHS_HSTPIPICR) Transmitted OUT Data Interrupt Clear Mask */
#define USBHS_HSTPIPICR_TXOUTIC(value)        (USBHS_HSTPIPICR_TXOUTIC_Msk & (_UINT32_(value) << USBHS_HSTPIPICR_TXOUTIC_Pos)) /* Assigment of value for TXOUTIC in the USBHS_HSTPIPICR register */
#define USBHS_HSTPIPICR_NAKEDIC_Pos           _UINT32_(4)                                          /* (USBHS_HSTPIPICR) NAKed Interrupt Clear Position */
#define USBHS_HSTPIPICR_NAKEDIC_Msk           (_UINT32_(0x1) << USBHS_HSTPIPICR_NAKEDIC_Pos)       /* (USBHS_HSTPIPICR) NAKed Interrupt Clear Mask */
#define USBHS_HSTPIPICR_NAKEDIC(value)        (USBHS_HSTPIPICR_NAKEDIC_Msk & (_UINT32_(value) << USBHS_HSTPIPICR_NAKEDIC_Pos)) /* Assigment of value for NAKEDIC in the USBHS_HSTPIPICR register */
#define USBHS_HSTPIPICR_OVERFIC_Pos           _UINT32_(5)                                          /* (USBHS_HSTPIPICR) Overflow Interrupt Clear Position */
#define USBHS_HSTPIPICR_OVERFIC_Msk           (_UINT32_(0x1) << USBHS_HSTPIPICR_OVERFIC_Pos)       /* (USBHS_HSTPIPICR) Overflow Interrupt Clear Mask */
#define USBHS_HSTPIPICR_OVERFIC(value)        (USBHS_HSTPIPICR_OVERFIC_Msk & (_UINT32_(value) << USBHS_HSTPIPICR_OVERFIC_Pos)) /* Assigment of value for OVERFIC in the USBHS_HSTPIPICR register */
#define USBHS_HSTPIPICR_SHORTPACKETIC_Pos     _UINT32_(7)                                          /* (USBHS_HSTPIPICR) Short Packet Interrupt Clear Position */
#define USBHS_HSTPIPICR_SHORTPACKETIC_Msk     (_UINT32_(0x1) << USBHS_HSTPIPICR_SHORTPACKETIC_Pos) /* (USBHS_HSTPIPICR) Short Packet Interrupt Clear Mask */
#define USBHS_HSTPIPICR_SHORTPACKETIC(value)  (USBHS_HSTPIPICR_SHORTPACKETIC_Msk & (_UINT32_(value) << USBHS_HSTPIPICR_SHORTPACKETIC_Pos)) /* Assigment of value for SHORTPACKETIC in the USBHS_HSTPIPICR register */
#define USBHS_HSTPIPICR_Msk                   _UINT32_(0x000000B3)                                 /* (USBHS_HSTPIPICR) Register Mask  */

/* CTRL mode */
#define USBHS_HSTPIPICR_CTRL_TXSTPIC_Pos      _UINT32_(2)                                          /* (USBHS_HSTPIPICR) Transmitted SETUP Interrupt Clear Position */
#define USBHS_HSTPIPICR_CTRL_TXSTPIC_Msk      (_UINT32_(0x1) << USBHS_HSTPIPICR_CTRL_TXSTPIC_Pos)  /* (USBHS_HSTPIPICR) Transmitted SETUP Interrupt Clear Mask */
#define USBHS_HSTPIPICR_CTRL_TXSTPIC(value)   (USBHS_HSTPIPICR_CTRL_TXSTPIC_Msk & (_UINT32_(value) << USBHS_HSTPIPICR_CTRL_TXSTPIC_Pos))
#define USBHS_HSTPIPICR_CTRL_RXSTALLDIC_Pos   _UINT32_(6)                                          /* (USBHS_HSTPIPICR) Received STALLed Interrupt Clear Position */
#define USBHS_HSTPIPICR_CTRL_RXSTALLDIC_Msk   (_UINT32_(0x1) << USBHS_HSTPIPICR_CTRL_RXSTALLDIC_Pos) /* (USBHS_HSTPIPICR) Received STALLed Interrupt Clear Mask */
#define USBHS_HSTPIPICR_CTRL_RXSTALLDIC(value) (USBHS_HSTPIPICR_CTRL_RXSTALLDIC_Msk & (_UINT32_(value) << USBHS_HSTPIPICR_CTRL_RXSTALLDIC_Pos))
#define USBHS_HSTPIPICR_CTRL_Msk              _UINT32_(0x00000044)                                  /* (USBHS_HSTPIPICR_CTRL) Register Mask  */

