Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/usbhs.h
/* ISO mode */
#define USBHS_HSTPIPICR_ISO_UNDERFIC_Pos      _UINT32_(2)                                          /* (USBHS_HSTPIPICR) Underflow Interrupt Clear Position */
#define USBHS_HSTPIPICR_ISO_UNDERFIC_Msk      (_UINT32_(0x1) << USBHS_HSTPIPICR_ISO_UNDERFIC_Pos)  /* (USBHS_HSTPIPICR) Underflow Interrupt Clear Mask */
#define USBHS_HSTPIPICR_ISO_UNDERFIC(value)   (USBHS_HSTPIPICR_ISO_UNDERFIC_Msk & (_UINT32_(value) << USBHS_HSTPIPICR_ISO_UNDERFIC_Pos))
#define USBHS_HSTPIPICR_ISO_CRCERRIC_Pos      _UINT32_(6)                                          /* (USBHS_HSTPIPICR) CRC Error Interrupt Clear Position */
#define USBHS_HSTPIPICR_ISO_CRCERRIC_Msk      (_UINT32_(0x1) << USBHS_HSTPIPICR_ISO_CRCERRIC_Pos)  /* (USBHS_HSTPIPICR) CRC Error Interrupt Clear Mask */
#define USBHS_HSTPIPICR_ISO_CRCERRIC(value)   (USBHS_HSTPIPICR_ISO_CRCERRIC_Msk & (_UINT32_(value) << USBHS_HSTPIPICR_ISO_CRCERRIC_Pos))
#define USBHS_HSTPIPICR_ISO_Msk               _UINT32_(0x00000044)                                  /* (USBHS_HSTPIPICR_ISO) Register Mask  */

/* BLK mode */
#define USBHS_HSTPIPICR_BLK_TXSTPIC_Pos       _UINT32_(2)                                          /* (USBHS_HSTPIPICR) Transmitted SETUP Interrupt Clear Position */
#define USBHS_HSTPIPICR_BLK_TXSTPIC_Msk       (_UINT32_(0x1) << USBHS_HSTPIPICR_BLK_TXSTPIC_Pos)   /* (USBHS_HSTPIPICR) Transmitted SETUP Interrupt Clear Mask */
#define USBHS_HSTPIPICR_BLK_TXSTPIC(value)    (USBHS_HSTPIPICR_BLK_TXSTPIC_Msk & (_UINT32_(value) << USBHS_HSTPIPICR_BLK_TXSTPIC_Pos))
#define USBHS_HSTPIPICR_BLK_RXSTALLDIC_Pos    _UINT32_(6)                                          /* (USBHS_HSTPIPICR) Received STALLed Interrupt Clear Position */
#define USBHS_HSTPIPICR_BLK_RXSTALLDIC_Msk    (_UINT32_(0x1) << USBHS_HSTPIPICR_BLK_RXSTALLDIC_Pos) /* (USBHS_HSTPIPICR) Received STALLed Interrupt Clear Mask */
#define USBHS_HSTPIPICR_BLK_RXSTALLDIC(value) (USBHS_HSTPIPICR_BLK_RXSTALLDIC_Msk & (_UINT32_(value) << USBHS_HSTPIPICR_BLK_RXSTALLDIC_Pos))
#define USBHS_HSTPIPICR_BLK_Msk               _UINT32_(0x00000044)                                  /* (USBHS_HSTPIPICR_BLK) Register Mask  */

/* INTRPT mode */
#define USBHS_HSTPIPICR_INTRPT_UNDERFIC_Pos   _UINT32_(2)                                          /* (USBHS_HSTPIPICR) Underflow Interrupt Clear Position */
#define USBHS_HSTPIPICR_INTRPT_UNDERFIC_Msk   (_UINT32_(0x1) << USBHS_HSTPIPICR_INTRPT_UNDERFIC_Pos) /* (USBHS_HSTPIPICR) Underflow Interrupt Clear Mask */
#define USBHS_HSTPIPICR_INTRPT_UNDERFIC(value) (USBHS_HSTPIPICR_INTRPT_UNDERFIC_Msk & (_UINT32_(value) << USBHS_HSTPIPICR_INTRPT_UNDERFIC_Pos))
#define USBHS_HSTPIPICR_INTRPT_RXSTALLDIC_Pos _UINT32_(6)                                          /* (USBHS_HSTPIPICR) Received STALLed Interrupt Clear Position */
#define USBHS_HSTPIPICR_INTRPT_RXSTALLDIC_Msk (_UINT32_(0x1) << USBHS_HSTPIPICR_INTRPT_RXSTALLDIC_Pos) /* (USBHS_HSTPIPICR) Received STALLed Interrupt Clear Mask */
#define USBHS_HSTPIPICR_INTRPT_RXSTALLDIC(value) (USBHS_HSTPIPICR_INTRPT_RXSTALLDIC_Msk & (_UINT32_(value) << USBHS_HSTPIPICR_INTRPT_RXSTALLDIC_Pos))
#define USBHS_HSTPIPICR_INTRPT_Msk            _UINT32_(0x00000044)                                  /* (USBHS_HSTPIPICR_INTRPT) Register Mask  */


/* -------- USBHS_HSTPIPIFR : (USBHS Offset: 0x590) ( /W 32) Host Pipe Set Register -------- */
#define USBHS_HSTPIPIFR_RXINIS_Pos            _UINT32_(0)                                          /* (USBHS_HSTPIPIFR) Received IN Data Interrupt Set Position */
#define USBHS_HSTPIPIFR_RXINIS_Msk            (_UINT32_(0x1) << USBHS_HSTPIPIFR_RXINIS_Pos)        /* (USBHS_HSTPIPIFR) Received IN Data Interrupt Set Mask */
#define USBHS_HSTPIPIFR_RXINIS(value)         (USBHS_HSTPIPIFR_RXINIS_Msk & (_UINT32_(value) << USBHS_HSTPIPIFR_RXINIS_Pos)) /* Assigment of value for RXINIS in the USBHS_HSTPIPIFR register */
#define USBHS_HSTPIPIFR_TXOUTIS_Pos           _UINT32_(1)                                          /* (USBHS_HSTPIPIFR) Transmitted OUT Data Interrupt Set Position */
#define USBHS_HSTPIPIFR_TXOUTIS_Msk           (_UINT32_(0x1) << USBHS_HSTPIPIFR_TXOUTIS_Pos)       /* (USBHS_HSTPIPIFR) Transmitted OUT Data Interrupt Set Mask */
#define USBHS_HSTPIPIFR_TXOUTIS(value)        (USBHS_HSTPIPIFR_TXOUTIS_Msk & (_UINT32_(value) << USBHS_HSTPIPIFR_TXOUTIS_Pos)) /* Assigment of value for TXOUTIS in the USBHS_HSTPIPIFR register */
#define USBHS_HSTPIPIFR_PERRIS_Pos            _UINT32_(3)                                          /* (USBHS_HSTPIPIFR) Pipe Error Interrupt Set Position */
#define USBHS_HSTPIPIFR_PERRIS_Msk            (_UINT32_(0x1) << USBHS_HSTPIPIFR_PERRIS_Pos)        /* (USBHS_HSTPIPIFR) Pipe Error Interrupt Set Mask */
#define USBHS_HSTPIPIFR_PERRIS(value)         (USBHS_HSTPIPIFR_PERRIS_Msk & (_UINT32_(value) << USBHS_HSTPIPIFR_PERRIS_Pos)) /* Assigment of value for PERRIS in the USBHS_HSTPIPIFR register */
#define USBHS_HSTPIPIFR_NAKEDIS_Pos           _UINT32_(4)                                          /* (USBHS_HSTPIPIFR) NAKed Interrupt Set Position */
#define USBHS_HSTPIPIFR_NAKEDIS_Msk           (_UINT32_(0x1) << USBHS_HSTPIPIFR_NAKEDIS_Pos)       /* (USBHS_HSTPIPIFR) NAKed Interrupt Set Mask */
#define USBHS_HSTPIPIFR_NAKEDIS(value)        (USBHS_HSTPIPIFR_NAKEDIS_Msk & (_UINT32_(value) << USBHS_HSTPIPIFR_NAKEDIS_Pos)) /* Assigment of value for NAKEDIS in the USBHS_HSTPIPIFR register */
#define USBHS_HSTPIPIFR_OVERFIS_Pos           _UINT32_(5)                                          /* (USBHS_HSTPIPIFR) Overflow Interrupt Set Position */
#define USBHS_HSTPIPIFR_OVERFIS_Msk           (_UINT32_(0x1) << USBHS_HSTPIPIFR_OVERFIS_Pos)       /* (USBHS_HSTPIPIFR) Overflow Interrupt Set Mask */
#define USBHS_HSTPIPIFR_OVERFIS(value)        (USBHS_HSTPIPIFR_OVERFIS_Msk & (_UINT32_(value) << USBHS_HSTPIPIFR_OVERFIS_Pos)) /* Assigment of value for OVERFIS in the USBHS_HSTPIPIFR register */
#define USBHS_HSTPIPIFR_SHORTPACKETIS_Pos     _UINT32_(7)                                          /* (USBHS_HSTPIPIFR) Short Packet Interrupt Set Position */
#define USBHS_HSTPIPIFR_SHORTPACKETIS_Msk     (_UINT32_(0x1) << USBHS_HSTPIPIFR_SHORTPACKETIS_Pos) /* (USBHS_HSTPIPIFR) Short Packet Interrupt Set Mask */
#define USBHS_HSTPIPIFR_SHORTPACKETIS(value)  (USBHS_HSTPIPIFR_SHORTPACKETIS_Msk & (_UINT32_(value) << USBHS_HSTPIPIFR_SHORTPACKETIS_Pos)) /* Assigment of value for SHORTPACKETIS in the USBHS_HSTPIPIFR register */
#define USBHS_HSTPIPIFR_NBUSYBKS_Pos          _UINT32_(12)                                         /* (USBHS_HSTPIPIFR) Number of Busy Banks Set Position */
#define USBHS_HSTPIPIFR_NBUSYBKS_Msk          (_UINT32_(0x1) << USBHS_HSTPIPIFR_NBUSYBKS_Pos)      /* (USBHS_HSTPIPIFR) Number of Busy Banks Set Mask */
#define USBHS_HSTPIPIFR_NBUSYBKS(value)       (USBHS_HSTPIPIFR_NBUSYBKS_Msk & (_UINT32_(value) << USBHS_HSTPIPIFR_NBUSYBKS_Pos)) /* Assigment of value for NBUSYBKS in the USBHS_HSTPIPIFR register */
#define USBHS_HSTPIPIFR_Msk                   _UINT32_(0x000010BB)                                 /* (USBHS_HSTPIPIFR) Register Mask  */

/* CTRL mode */
#define USBHS_HSTPIPIFR_CTRL_TXSTPIS_Pos      _UINT32_(2)                                          /* (USBHS_HSTPIPIFR) Transmitted SETUP Interrupt Set Position */
#define USBHS_HSTPIPIFR_CTRL_TXSTPIS_Msk      (_UINT32_(0x1) << USBHS_HSTPIPIFR_CTRL_TXSTPIS_Pos)  /* (USBHS_HSTPIPIFR) Transmitted SETUP Interrupt Set Mask */
#define USBHS_HSTPIPIFR_CTRL_TXSTPIS(value)   (USBHS_HSTPIPIFR_CTRL_TXSTPIS_Msk & (_UINT32_(value) << USBHS_HSTPIPIFR_CTRL_TXSTPIS_Pos))
#define USBHS_HSTPIPIFR_CTRL_RXSTALLDIS_Pos   _UINT32_(6)                                          /* (USBHS_HSTPIPIFR) Received STALLed Interrupt Set Position */
#define USBHS_HSTPIPIFR_CTRL_RXSTALLDIS_Msk   (_UINT32_(0x1) << USBHS_HSTPIPIFR_CTRL_RXSTALLDIS_Pos) /* (USBHS_HSTPIPIFR) Received STALLed Interrupt Set Mask */
#define USBHS_HSTPIPIFR_CTRL_RXSTALLDIS(value) (USBHS_HSTPIPIFR_CTRL_RXSTALLDIS_Msk & (_UINT32_(value) << USBHS_HSTPIPIFR_CTRL_RXSTALLDIS_Pos))
#define USBHS_HSTPIPIFR_CTRL_Msk              _UINT32_(0x00000044)                                  /* (USBHS_HSTPIPIFR_CTRL) Register Mask  */

