Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/usbhs.h
/* ISO mode */
#define USBHS_HSTPIPIFR_ISO_UNDERFIS_Pos      _UINT32_(2)                                          /* (USBHS_HSTPIPIFR) Underflow Interrupt Set Position */
#define USBHS_HSTPIPIFR_ISO_UNDERFIS_Msk      (_UINT32_(0x1) << USBHS_HSTPIPIFR_ISO_UNDERFIS_Pos)  /* (USBHS_HSTPIPIFR) Underflow Interrupt Set Mask */
#define USBHS_HSTPIPIFR_ISO_UNDERFIS(value)   (USBHS_HSTPIPIFR_ISO_UNDERFIS_Msk & (_UINT32_(value) << USBHS_HSTPIPIFR_ISO_UNDERFIS_Pos))
#define USBHS_HSTPIPIFR_ISO_CRCERRIS_Pos      _UINT32_(6)                                          /* (USBHS_HSTPIPIFR) CRC Error Interrupt Set Position */
#define USBHS_HSTPIPIFR_ISO_CRCERRIS_Msk      (_UINT32_(0x1) << USBHS_HSTPIPIFR_ISO_CRCERRIS_Pos)  /* (USBHS_HSTPIPIFR) CRC Error Interrupt Set Mask */
#define USBHS_HSTPIPIFR_ISO_CRCERRIS(value)   (USBHS_HSTPIPIFR_ISO_CRCERRIS_Msk & (_UINT32_(value) << USBHS_HSTPIPIFR_ISO_CRCERRIS_Pos))
#define USBHS_HSTPIPIFR_ISO_Msk               _UINT32_(0x00000044)                                  /* (USBHS_HSTPIPIFR_ISO) Register Mask  */

/* BLK mode */
#define USBHS_HSTPIPIFR_BLK_TXSTPIS_Pos       _UINT32_(2)                                          /* (USBHS_HSTPIPIFR) Transmitted SETUP Interrupt Set Position */
#define USBHS_HSTPIPIFR_BLK_TXSTPIS_Msk       (_UINT32_(0x1) << USBHS_HSTPIPIFR_BLK_TXSTPIS_Pos)   /* (USBHS_HSTPIPIFR) Transmitted SETUP Interrupt Set Mask */
#define USBHS_HSTPIPIFR_BLK_TXSTPIS(value)    (USBHS_HSTPIPIFR_BLK_TXSTPIS_Msk & (_UINT32_(value) << USBHS_HSTPIPIFR_BLK_TXSTPIS_Pos))
#define USBHS_HSTPIPIFR_BLK_RXSTALLDIS_Pos    _UINT32_(6)                                          /* (USBHS_HSTPIPIFR) Received STALLed Interrupt Set Position */
#define USBHS_HSTPIPIFR_BLK_RXSTALLDIS_Msk    (_UINT32_(0x1) << USBHS_HSTPIPIFR_BLK_RXSTALLDIS_Pos) /* (USBHS_HSTPIPIFR) Received STALLed Interrupt Set Mask */
#define USBHS_HSTPIPIFR_BLK_RXSTALLDIS(value) (USBHS_HSTPIPIFR_BLK_RXSTALLDIS_Msk & (_UINT32_(value) << USBHS_HSTPIPIFR_BLK_RXSTALLDIS_Pos))
#define USBHS_HSTPIPIFR_BLK_Msk               _UINT32_(0x00000044)                                  /* (USBHS_HSTPIPIFR_BLK) Register Mask  */

/* INTRPT mode */
#define USBHS_HSTPIPIFR_INTRPT_UNDERFIS_Pos   _UINT32_(2)                                          /* (USBHS_HSTPIPIFR) Underflow Interrupt Set Position */
#define USBHS_HSTPIPIFR_INTRPT_UNDERFIS_Msk   (_UINT32_(0x1) << USBHS_HSTPIPIFR_INTRPT_UNDERFIS_Pos) /* (USBHS_HSTPIPIFR) Underflow Interrupt Set Mask */
#define USBHS_HSTPIPIFR_INTRPT_UNDERFIS(value) (USBHS_HSTPIPIFR_INTRPT_UNDERFIS_Msk & (_UINT32_(value) << USBHS_HSTPIPIFR_INTRPT_UNDERFIS_Pos))
#define USBHS_HSTPIPIFR_INTRPT_RXSTALLDIS_Pos _UINT32_(6)                                          /* (USBHS_HSTPIPIFR) Received STALLed Interrupt Set Position */
#define USBHS_HSTPIPIFR_INTRPT_RXSTALLDIS_Msk (_UINT32_(0x1) << USBHS_HSTPIPIFR_INTRPT_RXSTALLDIS_Pos) /* (USBHS_HSTPIPIFR) Received STALLed Interrupt Set Mask */
#define USBHS_HSTPIPIFR_INTRPT_RXSTALLDIS(value) (USBHS_HSTPIPIFR_INTRPT_RXSTALLDIS_Msk & (_UINT32_(value) << USBHS_HSTPIPIFR_INTRPT_RXSTALLDIS_Pos))
#define USBHS_HSTPIPIFR_INTRPT_Msk            _UINT32_(0x00000044)                                  /* (USBHS_HSTPIPIFR_INTRPT) Register Mask  */


/* -------- USBHS_HSTPIPIMR : (USBHS Offset: 0x5C0) ( R/ 32) Host Pipe Mask Register -------- */
#define USBHS_HSTPIPIMR_RXINE_Pos             _UINT32_(0)                                          /* (USBHS_HSTPIPIMR) Received IN Data Interrupt Enable Position */
#define USBHS_HSTPIPIMR_RXINE_Msk             (_UINT32_(0x1) << USBHS_HSTPIPIMR_RXINE_Pos)         /* (USBHS_HSTPIPIMR) Received IN Data Interrupt Enable Mask */
#define USBHS_HSTPIPIMR_RXINE(value)          (USBHS_HSTPIPIMR_RXINE_Msk & (_UINT32_(value) << USBHS_HSTPIPIMR_RXINE_Pos)) /* Assigment of value for RXINE in the USBHS_HSTPIPIMR register */
#define USBHS_HSTPIPIMR_TXOUTE_Pos            _UINT32_(1)                                          /* (USBHS_HSTPIPIMR) Transmitted OUT Data Interrupt Enable Position */
#define USBHS_HSTPIPIMR_TXOUTE_Msk            (_UINT32_(0x1) << USBHS_HSTPIPIMR_TXOUTE_Pos)        /* (USBHS_HSTPIPIMR) Transmitted OUT Data Interrupt Enable Mask */
#define USBHS_HSTPIPIMR_TXOUTE(value)         (USBHS_HSTPIPIMR_TXOUTE_Msk & (_UINT32_(value) << USBHS_HSTPIPIMR_TXOUTE_Pos)) /* Assigment of value for TXOUTE in the USBHS_HSTPIPIMR register */
#define USBHS_HSTPIPIMR_PERRE_Pos             _UINT32_(3)                                          /* (USBHS_HSTPIPIMR) Pipe Error Interrupt Enable Position */
#define USBHS_HSTPIPIMR_PERRE_Msk             (_UINT32_(0x1) << USBHS_HSTPIPIMR_PERRE_Pos)         /* (USBHS_HSTPIPIMR) Pipe Error Interrupt Enable Mask */
#define USBHS_HSTPIPIMR_PERRE(value)          (USBHS_HSTPIPIMR_PERRE_Msk & (_UINT32_(value) << USBHS_HSTPIPIMR_PERRE_Pos)) /* Assigment of value for PERRE in the USBHS_HSTPIPIMR register */
#define USBHS_HSTPIPIMR_NAKEDE_Pos            _UINT32_(4)                                          /* (USBHS_HSTPIPIMR) NAKed Interrupt Enable Position */
#define USBHS_HSTPIPIMR_NAKEDE_Msk            (_UINT32_(0x1) << USBHS_HSTPIPIMR_NAKEDE_Pos)        /* (USBHS_HSTPIPIMR) NAKed Interrupt Enable Mask */
#define USBHS_HSTPIPIMR_NAKEDE(value)         (USBHS_HSTPIPIMR_NAKEDE_Msk & (_UINT32_(value) << USBHS_HSTPIPIMR_NAKEDE_Pos)) /* Assigment of value for NAKEDE in the USBHS_HSTPIPIMR register */
#define USBHS_HSTPIPIMR_OVERFIE_Pos           _UINT32_(5)                                          /* (USBHS_HSTPIPIMR) Overflow Interrupt Enable Position */
#define USBHS_HSTPIPIMR_OVERFIE_Msk           (_UINT32_(0x1) << USBHS_HSTPIPIMR_OVERFIE_Pos)       /* (USBHS_HSTPIPIMR) Overflow Interrupt Enable Mask */
#define USBHS_HSTPIPIMR_OVERFIE(value)        (USBHS_HSTPIPIMR_OVERFIE_Msk & (_UINT32_(value) << USBHS_HSTPIPIMR_OVERFIE_Pos)) /* Assigment of value for OVERFIE in the USBHS_HSTPIPIMR register */
#define USBHS_HSTPIPIMR_SHORTPACKETIE_Pos     _UINT32_(7)                                          /* (USBHS_HSTPIPIMR) Short Packet Interrupt Enable Position */
#define USBHS_HSTPIPIMR_SHORTPACKETIE_Msk     (_UINT32_(0x1) << USBHS_HSTPIPIMR_SHORTPACKETIE_Pos) /* (USBHS_HSTPIPIMR) Short Packet Interrupt Enable Mask */
#define USBHS_HSTPIPIMR_SHORTPACKETIE(value)  (USBHS_HSTPIPIMR_SHORTPACKETIE_Msk & (_UINT32_(value) << USBHS_HSTPIPIMR_SHORTPACKETIE_Pos)) /* Assigment of value for SHORTPACKETIE in the USBHS_HSTPIPIMR register */
#define USBHS_HSTPIPIMR_NBUSYBKE_Pos          _UINT32_(12)                                         /* (USBHS_HSTPIPIMR) Number of Busy Banks Interrupt Enable Position */
#define USBHS_HSTPIPIMR_NBUSYBKE_Msk          (_UINT32_(0x1) << USBHS_HSTPIPIMR_NBUSYBKE_Pos)      /* (USBHS_HSTPIPIMR) Number of Busy Banks Interrupt Enable Mask */
#define USBHS_HSTPIPIMR_NBUSYBKE(value)       (USBHS_HSTPIPIMR_NBUSYBKE_Msk & (_UINT32_(value) << USBHS_HSTPIPIMR_NBUSYBKE_Pos)) /* Assigment of value for NBUSYBKE in the USBHS_HSTPIPIMR register */
#define USBHS_HSTPIPIMR_FIFOCON_Pos           _UINT32_(14)                                         /* (USBHS_HSTPIPIMR) FIFO Control Position */
#define USBHS_HSTPIPIMR_FIFOCON_Msk           (_UINT32_(0x1) << USBHS_HSTPIPIMR_FIFOCON_Pos)       /* (USBHS_HSTPIPIMR) FIFO Control Mask */
#define USBHS_HSTPIPIMR_FIFOCON(value)        (USBHS_HSTPIPIMR_FIFOCON_Msk & (_UINT32_(value) << USBHS_HSTPIPIMR_FIFOCON_Pos)) /* Assigment of value for FIFOCON in the USBHS_HSTPIPIMR register */
#define USBHS_HSTPIPIMR_PDISHDMA_Pos          _UINT32_(16)                                         /* (USBHS_HSTPIPIMR) Pipe Interrupts Disable HDMA Request Enable Position */
#define USBHS_HSTPIPIMR_PDISHDMA_Msk          (_UINT32_(0x1) << USBHS_HSTPIPIMR_PDISHDMA_Pos)      /* (USBHS_HSTPIPIMR) Pipe Interrupts Disable HDMA Request Enable Mask */
#define USBHS_HSTPIPIMR_PDISHDMA(value)       (USBHS_HSTPIPIMR_PDISHDMA_Msk & (_UINT32_(value) << USBHS_HSTPIPIMR_PDISHDMA_Pos)) /* Assigment of value for PDISHDMA in the USBHS_HSTPIPIMR register */
#define USBHS_HSTPIPIMR_PFREEZE_Pos           _UINT32_(17)                                         /* (USBHS_HSTPIPIMR) Pipe Freeze Position */
#define USBHS_HSTPIPIMR_PFREEZE_Msk           (_UINT32_(0x1) << USBHS_HSTPIPIMR_PFREEZE_Pos)       /* (USBHS_HSTPIPIMR) Pipe Freeze Mask */
#define USBHS_HSTPIPIMR_PFREEZE(value)        (USBHS_HSTPIPIMR_PFREEZE_Msk & (_UINT32_(value) << USBHS_HSTPIPIMR_PFREEZE_Pos)) /* Assigment of value for PFREEZE in the USBHS_HSTPIPIMR register */
#define USBHS_HSTPIPIMR_RSTDT_Pos             _UINT32_(18)                                         /* (USBHS_HSTPIPIMR) Reset Data Toggle Position */
#define USBHS_HSTPIPIMR_RSTDT_Msk             (_UINT32_(0x1) << USBHS_HSTPIPIMR_RSTDT_Pos)         /* (USBHS_HSTPIPIMR) Reset Data Toggle Mask */
#define USBHS_HSTPIPIMR_RSTDT(value)          (USBHS_HSTPIPIMR_RSTDT_Msk & (_UINT32_(value) << USBHS_HSTPIPIMR_RSTDT_Pos)) /* Assigment of value for RSTDT in the USBHS_HSTPIPIMR register */
#define USBHS_HSTPIPIMR_Msk                   _UINT32_(0x000750BB)                                 /* (USBHS_HSTPIPIMR) Register Mask  */

/* CTRL mode */
#define USBHS_HSTPIPIMR_CTRL_TXSTPE_Pos       _UINT32_(2)                                          /* (USBHS_HSTPIPIMR) Transmitted SETUP Interrupt Enable Position */
#define USBHS_HSTPIPIMR_CTRL_TXSTPE_Msk       (_UINT32_(0x1) << USBHS_HSTPIPIMR_CTRL_TXSTPE_Pos)   /* (USBHS_HSTPIPIMR) Transmitted SETUP Interrupt Enable Mask */
#define USBHS_HSTPIPIMR_CTRL_TXSTPE(value)    (USBHS_HSTPIPIMR_CTRL_TXSTPE_Msk & (_UINT32_(value) << USBHS_HSTPIPIMR_CTRL_TXSTPE_Pos))
#define USBHS_HSTPIPIMR_CTRL_RXSTALLDE_Pos    _UINT32_(6)                                          /* (USBHS_HSTPIPIMR) Received STALLed Interrupt Enable Position */
#define USBHS_HSTPIPIMR_CTRL_RXSTALLDE_Msk    (_UINT32_(0x1) << USBHS_HSTPIPIMR_CTRL_RXSTALLDE_Pos) /* (USBHS_HSTPIPIMR) Received STALLed Interrupt Enable Mask */
#define USBHS_HSTPIPIMR_CTRL_RXSTALLDE(value) (USBHS_HSTPIPIMR_CTRL_RXSTALLDE_Msk & (_UINT32_(value) << USBHS_HSTPIPIMR_CTRL_RXSTALLDE_Pos))
#define USBHS_HSTPIPIMR_CTRL_Msk              _UINT32_(0x00000044)                                  /* (USBHS_HSTPIPIMR_CTRL) Register Mask  */

