Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/usbhs.h
/* ISO mode */
#define USBHS_HSTPIPIMR_ISO_UNDERFIE_Pos      _UINT32_(2)                                          /* (USBHS_HSTPIPIMR) Underflow Interrupt Enable Position */
#define USBHS_HSTPIPIMR_ISO_UNDERFIE_Msk      (_UINT32_(0x1) << USBHS_HSTPIPIMR_ISO_UNDERFIE_Pos)  /* (USBHS_HSTPIPIMR) Underflow Interrupt Enable Mask */
#define USBHS_HSTPIPIMR_ISO_UNDERFIE(value)   (USBHS_HSTPIPIMR_ISO_UNDERFIE_Msk & (_UINT32_(value) << USBHS_HSTPIPIMR_ISO_UNDERFIE_Pos))
#define USBHS_HSTPIPIMR_ISO_CRCERRE_Pos       _UINT32_(6)                                          /* (USBHS_HSTPIPIMR) CRC Error Interrupt Enable Position */
#define USBHS_HSTPIPIMR_ISO_CRCERRE_Msk       (_UINT32_(0x1) << USBHS_HSTPIPIMR_ISO_CRCERRE_Pos)   /* (USBHS_HSTPIPIMR) CRC Error Interrupt Enable Mask */
#define USBHS_HSTPIPIMR_ISO_CRCERRE(value)    (USBHS_HSTPIPIMR_ISO_CRCERRE_Msk & (_UINT32_(value) << USBHS_HSTPIPIMR_ISO_CRCERRE_Pos))
#define USBHS_HSTPIPIMR_ISO_Msk               _UINT32_(0x00000044)                                  /* (USBHS_HSTPIPIMR_ISO) Register Mask  */

/* BLK mode */
#define USBHS_HSTPIPIMR_BLK_TXSTPE_Pos        _UINT32_(2)                                          /* (USBHS_HSTPIPIMR) Transmitted SETUP Interrupt Enable Position */
#define USBHS_HSTPIPIMR_BLK_TXSTPE_Msk        (_UINT32_(0x1) << USBHS_HSTPIPIMR_BLK_TXSTPE_Pos)    /* (USBHS_HSTPIPIMR) Transmitted SETUP Interrupt Enable Mask */
#define USBHS_HSTPIPIMR_BLK_TXSTPE(value)     (USBHS_HSTPIPIMR_BLK_TXSTPE_Msk & (_UINT32_(value) << USBHS_HSTPIPIMR_BLK_TXSTPE_Pos))
#define USBHS_HSTPIPIMR_BLK_RXSTALLDE_Pos     _UINT32_(6)                                          /* (USBHS_HSTPIPIMR) Received STALLed Interrupt Enable Position */
#define USBHS_HSTPIPIMR_BLK_RXSTALLDE_Msk     (_UINT32_(0x1) << USBHS_HSTPIPIMR_BLK_RXSTALLDE_Pos) /* (USBHS_HSTPIPIMR) Received STALLed Interrupt Enable Mask */
#define USBHS_HSTPIPIMR_BLK_RXSTALLDE(value)  (USBHS_HSTPIPIMR_BLK_RXSTALLDE_Msk & (_UINT32_(value) << USBHS_HSTPIPIMR_BLK_RXSTALLDE_Pos))
#define USBHS_HSTPIPIMR_BLK_Msk               _UINT32_(0x00000044)                                  /* (USBHS_HSTPIPIMR_BLK) Register Mask  */

/* INTRPT mode */
#define USBHS_HSTPIPIMR_INTRPT_UNDERFIE_Pos   _UINT32_(2)                                          /* (USBHS_HSTPIPIMR) Underflow Interrupt Enable Position */
#define USBHS_HSTPIPIMR_INTRPT_UNDERFIE_Msk   (_UINT32_(0x1) << USBHS_HSTPIPIMR_INTRPT_UNDERFIE_Pos) /* (USBHS_HSTPIPIMR) Underflow Interrupt Enable Mask */
#define USBHS_HSTPIPIMR_INTRPT_UNDERFIE(value) (USBHS_HSTPIPIMR_INTRPT_UNDERFIE_Msk & (_UINT32_(value) << USBHS_HSTPIPIMR_INTRPT_UNDERFIE_Pos))
#define USBHS_HSTPIPIMR_INTRPT_RXSTALLDE_Pos  _UINT32_(6)                                          /* (USBHS_HSTPIPIMR) Received STALLed Interrupt Enable Position */
#define USBHS_HSTPIPIMR_INTRPT_RXSTALLDE_Msk  (_UINT32_(0x1) << USBHS_HSTPIPIMR_INTRPT_RXSTALLDE_Pos) /* (USBHS_HSTPIPIMR) Received STALLed Interrupt Enable Mask */
#define USBHS_HSTPIPIMR_INTRPT_RXSTALLDE(value) (USBHS_HSTPIPIMR_INTRPT_RXSTALLDE_Msk & (_UINT32_(value) << USBHS_HSTPIPIMR_INTRPT_RXSTALLDE_Pos))
#define USBHS_HSTPIPIMR_INTRPT_Msk            _UINT32_(0x00000044)                                  /* (USBHS_HSTPIPIMR_INTRPT) Register Mask  */


/* -------- USBHS_HSTPIPIER : (USBHS Offset: 0x5F0) ( /W 32) Host Pipe Enable Register -------- */
#define USBHS_HSTPIPIER_RXINES_Pos            _UINT32_(0)                                          /* (USBHS_HSTPIPIER) Received IN Data Interrupt Enable Position */
#define USBHS_HSTPIPIER_RXINES_Msk            (_UINT32_(0x1) << USBHS_HSTPIPIER_RXINES_Pos)        /* (USBHS_HSTPIPIER) Received IN Data Interrupt Enable Mask */
#define USBHS_HSTPIPIER_RXINES(value)         (USBHS_HSTPIPIER_RXINES_Msk & (_UINT32_(value) << USBHS_HSTPIPIER_RXINES_Pos)) /* Assigment of value for RXINES in the USBHS_HSTPIPIER register */
#define USBHS_HSTPIPIER_TXOUTES_Pos           _UINT32_(1)                                          /* (USBHS_HSTPIPIER) Transmitted OUT Data Interrupt Enable Position */
#define USBHS_HSTPIPIER_TXOUTES_Msk           (_UINT32_(0x1) << USBHS_HSTPIPIER_TXOUTES_Pos)       /* (USBHS_HSTPIPIER) Transmitted OUT Data Interrupt Enable Mask */
#define USBHS_HSTPIPIER_TXOUTES(value)        (USBHS_HSTPIPIER_TXOUTES_Msk & (_UINT32_(value) << USBHS_HSTPIPIER_TXOUTES_Pos)) /* Assigment of value for TXOUTES in the USBHS_HSTPIPIER register */
#define USBHS_HSTPIPIER_PERRES_Pos            _UINT32_(3)                                          /* (USBHS_HSTPIPIER) Pipe Error Interrupt Enable Position */
#define USBHS_HSTPIPIER_PERRES_Msk            (_UINT32_(0x1) << USBHS_HSTPIPIER_PERRES_Pos)        /* (USBHS_HSTPIPIER) Pipe Error Interrupt Enable Mask */
#define USBHS_HSTPIPIER_PERRES(value)         (USBHS_HSTPIPIER_PERRES_Msk & (_UINT32_(value) << USBHS_HSTPIPIER_PERRES_Pos)) /* Assigment of value for PERRES in the USBHS_HSTPIPIER register */
#define USBHS_HSTPIPIER_NAKEDES_Pos           _UINT32_(4)                                          /* (USBHS_HSTPIPIER) NAKed Interrupt Enable Position */
#define USBHS_HSTPIPIER_NAKEDES_Msk           (_UINT32_(0x1) << USBHS_HSTPIPIER_NAKEDES_Pos)       /* (USBHS_HSTPIPIER) NAKed Interrupt Enable Mask */
#define USBHS_HSTPIPIER_NAKEDES(value)        (USBHS_HSTPIPIER_NAKEDES_Msk & (_UINT32_(value) << USBHS_HSTPIPIER_NAKEDES_Pos)) /* Assigment of value for NAKEDES in the USBHS_HSTPIPIER register */
#define USBHS_HSTPIPIER_OVERFIES_Pos          _UINT32_(5)                                          /* (USBHS_HSTPIPIER) Overflow Interrupt Enable Position */
#define USBHS_HSTPIPIER_OVERFIES_Msk          (_UINT32_(0x1) << USBHS_HSTPIPIER_OVERFIES_Pos)      /* (USBHS_HSTPIPIER) Overflow Interrupt Enable Mask */
#define USBHS_HSTPIPIER_OVERFIES(value)       (USBHS_HSTPIPIER_OVERFIES_Msk & (_UINT32_(value) << USBHS_HSTPIPIER_OVERFIES_Pos)) /* Assigment of value for OVERFIES in the USBHS_HSTPIPIER register */
#define USBHS_HSTPIPIER_SHORTPACKETIES_Pos    _UINT32_(7)                                          /* (USBHS_HSTPIPIER) Short Packet Interrupt Enable Position */
#define USBHS_HSTPIPIER_SHORTPACKETIES_Msk    (_UINT32_(0x1) << USBHS_HSTPIPIER_SHORTPACKETIES_Pos) /* (USBHS_HSTPIPIER) Short Packet Interrupt Enable Mask */
#define USBHS_HSTPIPIER_SHORTPACKETIES(value) (USBHS_HSTPIPIER_SHORTPACKETIES_Msk & (_UINT32_(value) << USBHS_HSTPIPIER_SHORTPACKETIES_Pos)) /* Assigment of value for SHORTPACKETIES in the USBHS_HSTPIPIER register */
#define USBHS_HSTPIPIER_NBUSYBKES_Pos         _UINT32_(12)                                         /* (USBHS_HSTPIPIER) Number of Busy Banks Enable Position */
#define USBHS_HSTPIPIER_NBUSYBKES_Msk         (_UINT32_(0x1) << USBHS_HSTPIPIER_NBUSYBKES_Pos)     /* (USBHS_HSTPIPIER) Number of Busy Banks Enable Mask */
#define USBHS_HSTPIPIER_NBUSYBKES(value)      (USBHS_HSTPIPIER_NBUSYBKES_Msk & (_UINT32_(value) << USBHS_HSTPIPIER_NBUSYBKES_Pos)) /* Assigment of value for NBUSYBKES in the USBHS_HSTPIPIER register */
#define USBHS_HSTPIPIER_PDISHDMAS_Pos         _UINT32_(16)                                         /* (USBHS_HSTPIPIER) Pipe Interrupts Disable HDMA Request Enable Position */
#define USBHS_HSTPIPIER_PDISHDMAS_Msk         (_UINT32_(0x1) << USBHS_HSTPIPIER_PDISHDMAS_Pos)     /* (USBHS_HSTPIPIER) Pipe Interrupts Disable HDMA Request Enable Mask */
#define USBHS_HSTPIPIER_PDISHDMAS(value)      (USBHS_HSTPIPIER_PDISHDMAS_Msk & (_UINT32_(value) << USBHS_HSTPIPIER_PDISHDMAS_Pos)) /* Assigment of value for PDISHDMAS in the USBHS_HSTPIPIER register */
#define USBHS_HSTPIPIER_PFREEZES_Pos          _UINT32_(17)                                         /* (USBHS_HSTPIPIER) Pipe Freeze Enable Position */
#define USBHS_HSTPIPIER_PFREEZES_Msk          (_UINT32_(0x1) << USBHS_HSTPIPIER_PFREEZES_Pos)      /* (USBHS_HSTPIPIER) Pipe Freeze Enable Mask */
#define USBHS_HSTPIPIER_PFREEZES(value)       (USBHS_HSTPIPIER_PFREEZES_Msk & (_UINT32_(value) << USBHS_HSTPIPIER_PFREEZES_Pos)) /* Assigment of value for PFREEZES in the USBHS_HSTPIPIER register */
#define USBHS_HSTPIPIER_RSTDTS_Pos            _UINT32_(18)                                         /* (USBHS_HSTPIPIER) Reset Data Toggle Enable Position */
#define USBHS_HSTPIPIER_RSTDTS_Msk            (_UINT32_(0x1) << USBHS_HSTPIPIER_RSTDTS_Pos)        /* (USBHS_HSTPIPIER) Reset Data Toggle Enable Mask */
#define USBHS_HSTPIPIER_RSTDTS(value)         (USBHS_HSTPIPIER_RSTDTS_Msk & (_UINT32_(value) << USBHS_HSTPIPIER_RSTDTS_Pos)) /* Assigment of value for RSTDTS in the USBHS_HSTPIPIER register */
#define USBHS_HSTPIPIER_Msk                   _UINT32_(0x000710BB)                                 /* (USBHS_HSTPIPIER) Register Mask  */

/* CTRL mode */
#define USBHS_HSTPIPIER_CTRL_TXSTPES_Pos      _UINT32_(2)                                          /* (USBHS_HSTPIPIER) Transmitted SETUP Interrupt Enable Position */
#define USBHS_HSTPIPIER_CTRL_TXSTPES_Msk      (_UINT32_(0x1) << USBHS_HSTPIPIER_CTRL_TXSTPES_Pos)  /* (USBHS_HSTPIPIER) Transmitted SETUP Interrupt Enable Mask */
#define USBHS_HSTPIPIER_CTRL_TXSTPES(value)   (USBHS_HSTPIPIER_CTRL_TXSTPES_Msk & (_UINT32_(value) << USBHS_HSTPIPIER_CTRL_TXSTPES_Pos))
#define USBHS_HSTPIPIER_CTRL_RXSTALLDES_Pos   _UINT32_(6)                                          /* (USBHS_HSTPIPIER) Received STALLed Interrupt Enable Position */
#define USBHS_HSTPIPIER_CTRL_RXSTALLDES_Msk   (_UINT32_(0x1) << USBHS_HSTPIPIER_CTRL_RXSTALLDES_Pos) /* (USBHS_HSTPIPIER) Received STALLed Interrupt Enable Mask */
#define USBHS_HSTPIPIER_CTRL_RXSTALLDES(value) (USBHS_HSTPIPIER_CTRL_RXSTALLDES_Msk & (_UINT32_(value) << USBHS_HSTPIPIER_CTRL_RXSTALLDES_Pos))
#define USBHS_HSTPIPIER_CTRL_Msk              _UINT32_(0x00000044)                                  /* (USBHS_HSTPIPIER_CTRL) Register Mask  */

