Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/usbhs.h
/* ISO mode */
#define USBHS_HSTPIPIER_ISO_UNDERFIES_Pos     _UINT32_(2)                                          /* (USBHS_HSTPIPIER) Underflow Interrupt Enable Position */
#define USBHS_HSTPIPIER_ISO_UNDERFIES_Msk     (_UINT32_(0x1) << USBHS_HSTPIPIER_ISO_UNDERFIES_Pos) /* (USBHS_HSTPIPIER) Underflow Interrupt Enable Mask */
#define USBHS_HSTPIPIER_ISO_UNDERFIES(value)  (USBHS_HSTPIPIER_ISO_UNDERFIES_Msk & (_UINT32_(value) << USBHS_HSTPIPIER_ISO_UNDERFIES_Pos))
#define USBHS_HSTPIPIER_ISO_CRCERRES_Pos      _UINT32_(6)                                          /* (USBHS_HSTPIPIER) CRC Error Interrupt Enable Position */
#define USBHS_HSTPIPIER_ISO_CRCERRES_Msk      (_UINT32_(0x1) << USBHS_HSTPIPIER_ISO_CRCERRES_Pos)  /* (USBHS_HSTPIPIER) CRC Error Interrupt Enable Mask */
#define USBHS_HSTPIPIER_ISO_CRCERRES(value)   (USBHS_HSTPIPIER_ISO_CRCERRES_Msk & (_UINT32_(value) << USBHS_HSTPIPIER_ISO_CRCERRES_Pos))
#define USBHS_HSTPIPIER_ISO_Msk               _UINT32_(0x00000044)                                  /* (USBHS_HSTPIPIER_ISO) Register Mask  */

/* BLK mode */
#define USBHS_HSTPIPIER_BLK_TXSTPES_Pos       _UINT32_(2)                                          /* (USBHS_HSTPIPIER) Transmitted SETUP Interrupt Enable Position */
#define USBHS_HSTPIPIER_BLK_TXSTPES_Msk       (_UINT32_(0x1) << USBHS_HSTPIPIER_BLK_TXSTPES_Pos)   /* (USBHS_HSTPIPIER) Transmitted SETUP Interrupt Enable Mask */
#define USBHS_HSTPIPIER_BLK_TXSTPES(value)    (USBHS_HSTPIPIER_BLK_TXSTPES_Msk & (_UINT32_(value) << USBHS_HSTPIPIER_BLK_TXSTPES_Pos))
#define USBHS_HSTPIPIER_BLK_RXSTALLDES_Pos    _UINT32_(6)                                          /* (USBHS_HSTPIPIER) Received STALLed Interrupt Enable Position */
#define USBHS_HSTPIPIER_BLK_RXSTALLDES_Msk    (_UINT32_(0x1) << USBHS_HSTPIPIER_BLK_RXSTALLDES_Pos) /* (USBHS_HSTPIPIER) Received STALLed Interrupt Enable Mask */
#define USBHS_HSTPIPIER_BLK_RXSTALLDES(value) (USBHS_HSTPIPIER_BLK_RXSTALLDES_Msk & (_UINT32_(value) << USBHS_HSTPIPIER_BLK_RXSTALLDES_Pos))
#define USBHS_HSTPIPIER_BLK_Msk               _UINT32_(0x00000044)                                  /* (USBHS_HSTPIPIER_BLK) Register Mask  */

/* INTRPT mode */
#define USBHS_HSTPIPIER_INTRPT_UNDERFIES_Pos  _UINT32_(2)                                          /* (USBHS_HSTPIPIER) Underflow Interrupt Enable Position */
#define USBHS_HSTPIPIER_INTRPT_UNDERFIES_Msk  (_UINT32_(0x1) << USBHS_HSTPIPIER_INTRPT_UNDERFIES_Pos) /* (USBHS_HSTPIPIER) Underflow Interrupt Enable Mask */
#define USBHS_HSTPIPIER_INTRPT_UNDERFIES(value) (USBHS_HSTPIPIER_INTRPT_UNDERFIES_Msk & (_UINT32_(value) << USBHS_HSTPIPIER_INTRPT_UNDERFIES_Pos))
#define USBHS_HSTPIPIER_INTRPT_RXSTALLDES_Pos _UINT32_(6)                                          /* (USBHS_HSTPIPIER) Received STALLed Interrupt Enable Position */
#define USBHS_HSTPIPIER_INTRPT_RXSTALLDES_Msk (_UINT32_(0x1) << USBHS_HSTPIPIER_INTRPT_RXSTALLDES_Pos) /* (USBHS_HSTPIPIER) Received STALLed Interrupt Enable Mask */
#define USBHS_HSTPIPIER_INTRPT_RXSTALLDES(value) (USBHS_HSTPIPIER_INTRPT_RXSTALLDES_Msk & (_UINT32_(value) << USBHS_HSTPIPIER_INTRPT_RXSTALLDES_Pos))
#define USBHS_HSTPIPIER_INTRPT_Msk            _UINT32_(0x00000044)                                  /* (USBHS_HSTPIPIER_INTRPT) Register Mask  */


/* -------- USBHS_HSTPIPIDR : (USBHS Offset: 0x620) ( /W 32) Host Pipe Disable Register -------- */
#define USBHS_HSTPIPIDR_RXINEC_Pos            _UINT32_(0)                                          /* (USBHS_HSTPIPIDR) Received IN Data Interrupt Disable Position */
#define USBHS_HSTPIPIDR_RXINEC_Msk            (_UINT32_(0x1) << USBHS_HSTPIPIDR_RXINEC_Pos)        /* (USBHS_HSTPIPIDR) Received IN Data Interrupt Disable Mask */
#define USBHS_HSTPIPIDR_RXINEC(value)         (USBHS_HSTPIPIDR_RXINEC_Msk & (_UINT32_(value) << USBHS_HSTPIPIDR_RXINEC_Pos)) /* Assigment of value for RXINEC in the USBHS_HSTPIPIDR register */
#define USBHS_HSTPIPIDR_TXOUTEC_Pos           _UINT32_(1)                                          /* (USBHS_HSTPIPIDR) Transmitted OUT Data Interrupt Disable Position */
#define USBHS_HSTPIPIDR_TXOUTEC_Msk           (_UINT32_(0x1) << USBHS_HSTPIPIDR_TXOUTEC_Pos)       /* (USBHS_HSTPIPIDR) Transmitted OUT Data Interrupt Disable Mask */
#define USBHS_HSTPIPIDR_TXOUTEC(value)        (USBHS_HSTPIPIDR_TXOUTEC_Msk & (_UINT32_(value) << USBHS_HSTPIPIDR_TXOUTEC_Pos)) /* Assigment of value for TXOUTEC in the USBHS_HSTPIPIDR register */
#define USBHS_HSTPIPIDR_PERREC_Pos            _UINT32_(3)                                          /* (USBHS_HSTPIPIDR) Pipe Error Interrupt Disable Position */
#define USBHS_HSTPIPIDR_PERREC_Msk            (_UINT32_(0x1) << USBHS_HSTPIPIDR_PERREC_Pos)        /* (USBHS_HSTPIPIDR) Pipe Error Interrupt Disable Mask */
#define USBHS_HSTPIPIDR_PERREC(value)         (USBHS_HSTPIPIDR_PERREC_Msk & (_UINT32_(value) << USBHS_HSTPIPIDR_PERREC_Pos)) /* Assigment of value for PERREC in the USBHS_HSTPIPIDR register */
#define USBHS_HSTPIPIDR_NAKEDEC_Pos           _UINT32_(4)                                          /* (USBHS_HSTPIPIDR) NAKed Interrupt Disable Position */
#define USBHS_HSTPIPIDR_NAKEDEC_Msk           (_UINT32_(0x1) << USBHS_HSTPIPIDR_NAKEDEC_Pos)       /* (USBHS_HSTPIPIDR) NAKed Interrupt Disable Mask */
#define USBHS_HSTPIPIDR_NAKEDEC(value)        (USBHS_HSTPIPIDR_NAKEDEC_Msk & (_UINT32_(value) << USBHS_HSTPIPIDR_NAKEDEC_Pos)) /* Assigment of value for NAKEDEC in the USBHS_HSTPIPIDR register */
#define USBHS_HSTPIPIDR_OVERFIEC_Pos          _UINT32_(5)                                          /* (USBHS_HSTPIPIDR) Overflow Interrupt Disable Position */
#define USBHS_HSTPIPIDR_OVERFIEC_Msk          (_UINT32_(0x1) << USBHS_HSTPIPIDR_OVERFIEC_Pos)      /* (USBHS_HSTPIPIDR) Overflow Interrupt Disable Mask */
#define USBHS_HSTPIPIDR_OVERFIEC(value)       (USBHS_HSTPIPIDR_OVERFIEC_Msk & (_UINT32_(value) << USBHS_HSTPIPIDR_OVERFIEC_Pos)) /* Assigment of value for OVERFIEC in the USBHS_HSTPIPIDR register */
#define USBHS_HSTPIPIDR_SHORTPACKETIEC_Pos    _UINT32_(7)                                          /* (USBHS_HSTPIPIDR) Short Packet Interrupt Disable Position */
#define USBHS_HSTPIPIDR_SHORTPACKETIEC_Msk    (_UINT32_(0x1) << USBHS_HSTPIPIDR_SHORTPACKETIEC_Pos) /* (USBHS_HSTPIPIDR) Short Packet Interrupt Disable Mask */
#define USBHS_HSTPIPIDR_SHORTPACKETIEC(value) (USBHS_HSTPIPIDR_SHORTPACKETIEC_Msk & (_UINT32_(value) << USBHS_HSTPIPIDR_SHORTPACKETIEC_Pos)) /* Assigment of value for SHORTPACKETIEC in the USBHS_HSTPIPIDR register */
#define USBHS_HSTPIPIDR_NBUSYBKEC_Pos         _UINT32_(12)                                         /* (USBHS_HSTPIPIDR) Number of Busy Banks Disable Position */
#define USBHS_HSTPIPIDR_NBUSYBKEC_Msk         (_UINT32_(0x1) << USBHS_HSTPIPIDR_NBUSYBKEC_Pos)     /* (USBHS_HSTPIPIDR) Number of Busy Banks Disable Mask */
#define USBHS_HSTPIPIDR_NBUSYBKEC(value)      (USBHS_HSTPIPIDR_NBUSYBKEC_Msk & (_UINT32_(value) << USBHS_HSTPIPIDR_NBUSYBKEC_Pos)) /* Assigment of value for NBUSYBKEC in the USBHS_HSTPIPIDR register */
#define USBHS_HSTPIPIDR_FIFOCONC_Pos          _UINT32_(14)                                         /* (USBHS_HSTPIPIDR) FIFO Control Disable Position */
#define USBHS_HSTPIPIDR_FIFOCONC_Msk          (_UINT32_(0x1) << USBHS_HSTPIPIDR_FIFOCONC_Pos)      /* (USBHS_HSTPIPIDR) FIFO Control Disable Mask */
#define USBHS_HSTPIPIDR_FIFOCONC(value)       (USBHS_HSTPIPIDR_FIFOCONC_Msk & (_UINT32_(value) << USBHS_HSTPIPIDR_FIFOCONC_Pos)) /* Assigment of value for FIFOCONC in the USBHS_HSTPIPIDR register */
#define USBHS_HSTPIPIDR_PDISHDMAC_Pos         _UINT32_(16)                                         /* (USBHS_HSTPIPIDR) Pipe Interrupts Disable HDMA Request Disable Position */
#define USBHS_HSTPIPIDR_PDISHDMAC_Msk         (_UINT32_(0x1) << USBHS_HSTPIPIDR_PDISHDMAC_Pos)     /* (USBHS_HSTPIPIDR) Pipe Interrupts Disable HDMA Request Disable Mask */
#define USBHS_HSTPIPIDR_PDISHDMAC(value)      (USBHS_HSTPIPIDR_PDISHDMAC_Msk & (_UINT32_(value) << USBHS_HSTPIPIDR_PDISHDMAC_Pos)) /* Assigment of value for PDISHDMAC in the USBHS_HSTPIPIDR register */
#define USBHS_HSTPIPIDR_PFREEZEC_Pos          _UINT32_(17)                                         /* (USBHS_HSTPIPIDR) Pipe Freeze Disable Position */
#define USBHS_HSTPIPIDR_PFREEZEC_Msk          (_UINT32_(0x1) << USBHS_HSTPIPIDR_PFREEZEC_Pos)      /* (USBHS_HSTPIPIDR) Pipe Freeze Disable Mask */
#define USBHS_HSTPIPIDR_PFREEZEC(value)       (USBHS_HSTPIPIDR_PFREEZEC_Msk & (_UINT32_(value) << USBHS_HSTPIPIDR_PFREEZEC_Pos)) /* Assigment of value for PFREEZEC in the USBHS_HSTPIPIDR register */
#define USBHS_HSTPIPIDR_Msk                   _UINT32_(0x000350BB)                                 /* (USBHS_HSTPIPIDR) Register Mask  */

/* CTRL mode */
#define USBHS_HSTPIPIDR_CTRL_TXSTPEC_Pos      _UINT32_(2)                                          /* (USBHS_HSTPIPIDR) Transmitted SETUP Interrupt Disable Position */
#define USBHS_HSTPIPIDR_CTRL_TXSTPEC_Msk      (_UINT32_(0x1) << USBHS_HSTPIPIDR_CTRL_TXSTPEC_Pos)  /* (USBHS_HSTPIPIDR) Transmitted SETUP Interrupt Disable Mask */
#define USBHS_HSTPIPIDR_CTRL_TXSTPEC(value)   (USBHS_HSTPIPIDR_CTRL_TXSTPEC_Msk & (_UINT32_(value) << USBHS_HSTPIPIDR_CTRL_TXSTPEC_Pos))
#define USBHS_HSTPIPIDR_CTRL_RXSTALLDEC_Pos   _UINT32_(6)                                          /* (USBHS_HSTPIPIDR) Received STALLed Interrupt Disable Position */
#define USBHS_HSTPIPIDR_CTRL_RXSTALLDEC_Msk   (_UINT32_(0x1) << USBHS_HSTPIPIDR_CTRL_RXSTALLDEC_Pos) /* (USBHS_HSTPIPIDR) Received STALLed Interrupt Disable Mask */
#define USBHS_HSTPIPIDR_CTRL_RXSTALLDEC(value) (USBHS_HSTPIPIDR_CTRL_RXSTALLDEC_Msk & (_UINT32_(value) << USBHS_HSTPIPIDR_CTRL_RXSTALLDEC_Pos))
#define USBHS_HSTPIPIDR_CTRL_Msk              _UINT32_(0x00000044)                                  /* (USBHS_HSTPIPIDR_CTRL) Register Mask  */

