Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/usbhs.h
/* ISO mode */
#define USBHS_HSTPIPIDR_ISO_UNDERFIEC_Pos     _UINT32_(2)                                          /* (USBHS_HSTPIPIDR) Underflow Interrupt Disable Position */
#define USBHS_HSTPIPIDR_ISO_UNDERFIEC_Msk     (_UINT32_(0x1) << USBHS_HSTPIPIDR_ISO_UNDERFIEC_Pos) /* (USBHS_HSTPIPIDR) Underflow Interrupt Disable Mask */
#define USBHS_HSTPIPIDR_ISO_UNDERFIEC(value)  (USBHS_HSTPIPIDR_ISO_UNDERFIEC_Msk & (_UINT32_(value) << USBHS_HSTPIPIDR_ISO_UNDERFIEC_Pos))
#define USBHS_HSTPIPIDR_ISO_CRCERREC_Pos      _UINT32_(6)                                          /* (USBHS_HSTPIPIDR) CRC Error Interrupt Disable Position */
#define USBHS_HSTPIPIDR_ISO_CRCERREC_Msk      (_UINT32_(0x1) << USBHS_HSTPIPIDR_ISO_CRCERREC_Pos)  /* (USBHS_HSTPIPIDR) CRC Error Interrupt Disable Mask */
#define USBHS_HSTPIPIDR_ISO_CRCERREC(value)   (USBHS_HSTPIPIDR_ISO_CRCERREC_Msk & (_UINT32_(value) << USBHS_HSTPIPIDR_ISO_CRCERREC_Pos))
#define USBHS_HSTPIPIDR_ISO_Msk               _UINT32_(0x00000044)                                  /* (USBHS_HSTPIPIDR_ISO) Register Mask  */

/* BLK mode */
#define USBHS_HSTPIPIDR_BLK_TXSTPEC_Pos       _UINT32_(2)                                          /* (USBHS_HSTPIPIDR) Transmitted SETUP Interrupt Disable Position */
#define USBHS_HSTPIPIDR_BLK_TXSTPEC_Msk       (_UINT32_(0x1) << USBHS_HSTPIPIDR_BLK_TXSTPEC_Pos)   /* (USBHS_HSTPIPIDR) Transmitted SETUP Interrupt Disable Mask */
#define USBHS_HSTPIPIDR_BLK_TXSTPEC(value)    (USBHS_HSTPIPIDR_BLK_TXSTPEC_Msk & (_UINT32_(value) << USBHS_HSTPIPIDR_BLK_TXSTPEC_Pos))
#define USBHS_HSTPIPIDR_BLK_RXSTALLDEC_Pos    _UINT32_(6)                                          /* (USBHS_HSTPIPIDR) Received STALLed Interrupt Disable Position */
#define USBHS_HSTPIPIDR_BLK_RXSTALLDEC_Msk    (_UINT32_(0x1) << USBHS_HSTPIPIDR_BLK_RXSTALLDEC_Pos) /* (USBHS_HSTPIPIDR) Received STALLed Interrupt Disable Mask */
#define USBHS_HSTPIPIDR_BLK_RXSTALLDEC(value) (USBHS_HSTPIPIDR_BLK_RXSTALLDEC_Msk & (_UINT32_(value) << USBHS_HSTPIPIDR_BLK_RXSTALLDEC_Pos))
#define USBHS_HSTPIPIDR_BLK_Msk               _UINT32_(0x00000044)                                  /* (USBHS_HSTPIPIDR_BLK) Register Mask  */

/* INTRPT mode */
#define USBHS_HSTPIPIDR_INTRPT_UNDERFIEC_Pos  _UINT32_(2)                                          /* (USBHS_HSTPIPIDR) Underflow Interrupt Disable Position */
#define USBHS_HSTPIPIDR_INTRPT_UNDERFIEC_Msk  (_UINT32_(0x1) << USBHS_HSTPIPIDR_INTRPT_UNDERFIEC_Pos) /* (USBHS_HSTPIPIDR) Underflow Interrupt Disable Mask */
#define USBHS_HSTPIPIDR_INTRPT_UNDERFIEC(value) (USBHS_HSTPIPIDR_INTRPT_UNDERFIEC_Msk & (_UINT32_(value) << USBHS_HSTPIPIDR_INTRPT_UNDERFIEC_Pos))
#define USBHS_HSTPIPIDR_INTRPT_RXSTALLDEC_Pos _UINT32_(6)                                          /* (USBHS_HSTPIPIDR) Received STALLed Interrupt Disable Position */
#define USBHS_HSTPIPIDR_INTRPT_RXSTALLDEC_Msk (_UINT32_(0x1) << USBHS_HSTPIPIDR_INTRPT_RXSTALLDEC_Pos) /* (USBHS_HSTPIPIDR) Received STALLed Interrupt Disable Mask */
#define USBHS_HSTPIPIDR_INTRPT_RXSTALLDEC(value) (USBHS_HSTPIPIDR_INTRPT_RXSTALLDEC_Msk & (_UINT32_(value) << USBHS_HSTPIPIDR_INTRPT_RXSTALLDEC_Pos))
#define USBHS_HSTPIPIDR_INTRPT_Msk            _UINT32_(0x00000044)                                  /* (USBHS_HSTPIPIDR_INTRPT) Register Mask  */


/* -------- USBHS_HSTPIPINRQ : (USBHS Offset: 0x650) (R/W 32) Host Pipe IN Request Register -------- */
#define USBHS_HSTPIPINRQ_INRQ_Pos             _UINT32_(0)                                          /* (USBHS_HSTPIPINRQ) IN Request Number before Freeze Position */
#define USBHS_HSTPIPINRQ_INRQ_Msk             (_UINT32_(0xFF) << USBHS_HSTPIPINRQ_INRQ_Pos)        /* (USBHS_HSTPIPINRQ) IN Request Number before Freeze Mask */
#define USBHS_HSTPIPINRQ_INRQ(value)          (USBHS_HSTPIPINRQ_INRQ_Msk & (_UINT32_(value) << USBHS_HSTPIPINRQ_INRQ_Pos)) /* Assigment of value for INRQ in the USBHS_HSTPIPINRQ register */
#define USBHS_HSTPIPINRQ_INMODE_Pos           _UINT32_(8)                                          /* (USBHS_HSTPIPINRQ) IN Request Mode Position */
#define USBHS_HSTPIPINRQ_INMODE_Msk           (_UINT32_(0x1) << USBHS_HSTPIPINRQ_INMODE_Pos)       /* (USBHS_HSTPIPINRQ) IN Request Mode Mask */
#define USBHS_HSTPIPINRQ_INMODE(value)        (USBHS_HSTPIPINRQ_INMODE_Msk & (_UINT32_(value) << USBHS_HSTPIPINRQ_INMODE_Pos)) /* Assigment of value for INMODE in the USBHS_HSTPIPINRQ register */
#define USBHS_HSTPIPINRQ_Msk                  _UINT32_(0x000001FF)                                 /* (USBHS_HSTPIPINRQ) Register Mask  */


/* -------- USBHS_HSTPIPERR : (USBHS Offset: 0x680) (R/W 32) Host Pipe Error Register -------- */
#define USBHS_HSTPIPERR_DATATGL_Pos           _UINT32_(0)                                          /* (USBHS_HSTPIPERR) Data Toggle Error Position */
#define USBHS_HSTPIPERR_DATATGL_Msk           (_UINT32_(0x1) << USBHS_HSTPIPERR_DATATGL_Pos)       /* (USBHS_HSTPIPERR) Data Toggle Error Mask */
#define USBHS_HSTPIPERR_DATATGL(value)        (USBHS_HSTPIPERR_DATATGL_Msk & (_UINT32_(value) << USBHS_HSTPIPERR_DATATGL_Pos)) /* Assigment of value for DATATGL in the USBHS_HSTPIPERR register */
#define USBHS_HSTPIPERR_DATAPID_Pos           _UINT32_(1)                                          /* (USBHS_HSTPIPERR) Data PID Error Position */
#define USBHS_HSTPIPERR_DATAPID_Msk           (_UINT32_(0x1) << USBHS_HSTPIPERR_DATAPID_Pos)       /* (USBHS_HSTPIPERR) Data PID Error Mask */
#define USBHS_HSTPIPERR_DATAPID(value)        (USBHS_HSTPIPERR_DATAPID_Msk & (_UINT32_(value) << USBHS_HSTPIPERR_DATAPID_Pos)) /* Assigment of value for DATAPID in the USBHS_HSTPIPERR register */
#define USBHS_HSTPIPERR_PID_Pos               _UINT32_(2)                                          /* (USBHS_HSTPIPERR) Data PID Error Position */
#define USBHS_HSTPIPERR_PID_Msk               (_UINT32_(0x1) << USBHS_HSTPIPERR_PID_Pos)           /* (USBHS_HSTPIPERR) Data PID Error Mask */
#define USBHS_HSTPIPERR_PID(value)            (USBHS_HSTPIPERR_PID_Msk & (_UINT32_(value) << USBHS_HSTPIPERR_PID_Pos)) /* Assigment of value for PID in the USBHS_HSTPIPERR register */
#define USBHS_HSTPIPERR_TIMEOUT_Pos           _UINT32_(3)                                          /* (USBHS_HSTPIPERR) Time-Out Error Position */
#define USBHS_HSTPIPERR_TIMEOUT_Msk           (_UINT32_(0x1) << USBHS_HSTPIPERR_TIMEOUT_Pos)       /* (USBHS_HSTPIPERR) Time-Out Error Mask */
#define USBHS_HSTPIPERR_TIMEOUT(value)        (USBHS_HSTPIPERR_TIMEOUT_Msk & (_UINT32_(value) << USBHS_HSTPIPERR_TIMEOUT_Pos)) /* Assigment of value for TIMEOUT in the USBHS_HSTPIPERR register */
#define USBHS_HSTPIPERR_CRC16_Pos             _UINT32_(4)                                          /* (USBHS_HSTPIPERR) CRC16 Error Position */
#define USBHS_HSTPIPERR_CRC16_Msk             (_UINT32_(0x1) << USBHS_HSTPIPERR_CRC16_Pos)         /* (USBHS_HSTPIPERR) CRC16 Error Mask */
#define USBHS_HSTPIPERR_CRC16(value)          (USBHS_HSTPIPERR_CRC16_Msk & (_UINT32_(value) << USBHS_HSTPIPERR_CRC16_Pos)) /* Assigment of value for CRC16 in the USBHS_HSTPIPERR register */
#define USBHS_HSTPIPERR_COUNTER_Pos           _UINT32_(5)                                          /* (USBHS_HSTPIPERR) Error Counter Position */
#define USBHS_HSTPIPERR_COUNTER_Msk           (_UINT32_(0x3) << USBHS_HSTPIPERR_COUNTER_Pos)       /* (USBHS_HSTPIPERR) Error Counter Mask */
#define USBHS_HSTPIPERR_COUNTER(value)        (USBHS_HSTPIPERR_COUNTER_Msk & (_UINT32_(value) << USBHS_HSTPIPERR_COUNTER_Pos)) /* Assigment of value for COUNTER in the USBHS_HSTPIPERR register */
#define USBHS_HSTPIPERR_Msk                   _UINT32_(0x0000007F)                                 /* (USBHS_HSTPIPERR) Register Mask  */

