Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/usbhs.h
#define USBHS_HSTPIPERR_CRC_Pos               _UINT32_(4)                                          /* (USBHS_HSTPIPERR Position) CRCx6 Error */
#define USBHS_HSTPIPERR_CRC_Msk               (_UINT32_(0x1) << USBHS_HSTPIPERR_CRC_Pos)           /* (USBHS_HSTPIPERR Mask) CRC */
#define USBHS_HSTPIPERR_CRC(value)            (USBHS_HSTPIPERR_CRC_Msk & (_UINT32_(value) << USBHS_HSTPIPERR_CRC_Pos)) 

/* -------- USBHS_CTRL : (USBHS Offset: 0x800) (R/W 32) General Control Register -------- */
#define USBHS_CTRL_RDERRE_Pos                 _UINT32_(4)                                          /* (USBHS_CTRL) Remote Device Connection Error Interrupt Enable Position */
#define USBHS_CTRL_RDERRE_Msk                 (_UINT32_(0x1) << USBHS_CTRL_RDERRE_Pos)             /* (USBHS_CTRL) Remote Device Connection Error Interrupt Enable Mask */
#define USBHS_CTRL_RDERRE(value)              (USBHS_CTRL_RDERRE_Msk & (_UINT32_(value) << USBHS_CTRL_RDERRE_Pos)) /* Assigment of value for RDERRE in the USBHS_CTRL register */
#define USBHS_CTRL_VBUSHWC_Pos                _UINT32_(8)                                          /* (USBHS_CTRL) VBUS Hardware Control Position */
#define USBHS_CTRL_VBUSHWC_Msk                (_UINT32_(0x1) << USBHS_CTRL_VBUSHWC_Pos)            /* (USBHS_CTRL) VBUS Hardware Control Mask */
#define USBHS_CTRL_VBUSHWC(value)             (USBHS_CTRL_VBUSHWC_Msk & (_UINT32_(value) << USBHS_CTRL_VBUSHWC_Pos)) /* Assigment of value for VBUSHWC in the USBHS_CTRL register */
#define USBHS_CTRL_FRZCLK_Pos                 _UINT32_(14)                                         /* (USBHS_CTRL) Freeze USB Clock Position */
#define USBHS_CTRL_FRZCLK_Msk                 (_UINT32_(0x1) << USBHS_CTRL_FRZCLK_Pos)             /* (USBHS_CTRL) Freeze USB Clock Mask */
#define USBHS_CTRL_FRZCLK(value)              (USBHS_CTRL_FRZCLK_Msk & (_UINT32_(value) << USBHS_CTRL_FRZCLK_Pos)) /* Assigment of value for FRZCLK in the USBHS_CTRL register */
#define USBHS_CTRL_USBE_Pos                   _UINT32_(15)                                         /* (USBHS_CTRL) USBHS Enable Position */
#define USBHS_CTRL_USBE_Msk                   (_UINT32_(0x1) << USBHS_CTRL_USBE_Pos)               /* (USBHS_CTRL) USBHS Enable Mask */
#define USBHS_CTRL_USBE(value)                (USBHS_CTRL_USBE_Msk & (_UINT32_(value) << USBHS_CTRL_USBE_Pos)) /* Assigment of value for USBE in the USBHS_CTRL register */
#define USBHS_CTRL_UID_Pos                    _UINT32_(24)                                         /* (USBHS_CTRL) UID Pin Enable Position */
#define USBHS_CTRL_UID_Msk                    (_UINT32_(0x1) << USBHS_CTRL_UID_Pos)                /* (USBHS_CTRL) UID Pin Enable Mask */
#define USBHS_CTRL_UID(value)                 (USBHS_CTRL_UID_Msk & (_UINT32_(value) << USBHS_CTRL_UID_Pos)) /* Assigment of value for UID in the USBHS_CTRL register */
#define USBHS_CTRL_UIMOD_Pos                  _UINT32_(25)                                         /* (USBHS_CTRL) USBHS Mode Position */
#define USBHS_CTRL_UIMOD_Msk                  (_UINT32_(0x1) << USBHS_CTRL_UIMOD_Pos)              /* (USBHS_CTRL) USBHS Mode Mask */
#define USBHS_CTRL_UIMOD(value)               (USBHS_CTRL_UIMOD_Msk & (_UINT32_(value) << USBHS_CTRL_UIMOD_Pos)) /* Assigment of value for UIMOD in the USBHS_CTRL register */
#define   USBHS_CTRL_UIMOD_HOST_Val           _UINT32_(0x0)                                        /* (USBHS_CTRL) The module is in USB Host mode.  */
#define   USBHS_CTRL_UIMOD_DEVICE_Val         _UINT32_(0x1)                                        /* (USBHS_CTRL) The module is in USB Device mode.  */
#define USBHS_CTRL_UIMOD_HOST                 (USBHS_CTRL_UIMOD_HOST_Val << USBHS_CTRL_UIMOD_Pos)  /* (USBHS_CTRL) The module is in USB Host mode. Position  */
#define USBHS_CTRL_UIMOD_DEVICE               (USBHS_CTRL_UIMOD_DEVICE_Val << USBHS_CTRL_UIMOD_Pos) /* (USBHS_CTRL) The module is in USB Device mode. Position  */
#define USBHS_CTRL_Msk                        _UINT32_(0x0300C110)                                 /* (USBHS_CTRL) Register Mask  */


/* -------- USBHS_SR : (USBHS Offset: 0x804) ( R/ 32) General Status Register -------- */
#define USBHS_SR_RDERRI_Pos                   _UINT32_(4)                                          /* (USBHS_SR) Remote Device Connection Error Interrupt (Host mode only) Position */
#define USBHS_SR_RDERRI_Msk                   (_UINT32_(0x1) << USBHS_SR_RDERRI_Pos)               /* (USBHS_SR) Remote Device Connection Error Interrupt (Host mode only) Mask */
#define USBHS_SR_RDERRI(value)                (USBHS_SR_RDERRI_Msk & (_UINT32_(value) << USBHS_SR_RDERRI_Pos)) /* Assigment of value for RDERRI in the USBHS_SR register */
#define USBHS_SR_SPEED_Pos                    _UINT32_(12)                                         /* (USBHS_SR) Speed Status (Device mode only) Position */
#define USBHS_SR_SPEED_Msk                    (_UINT32_(0x3) << USBHS_SR_SPEED_Pos)                /* (USBHS_SR) Speed Status (Device mode only) Mask */
#define USBHS_SR_SPEED(value)                 (USBHS_SR_SPEED_Msk & (_UINT32_(value) << USBHS_SR_SPEED_Pos)) /* Assigment of value for SPEED in the USBHS_SR register */
#define   USBHS_SR_SPEED_FULL_SPEED_Val       _UINT32_(0x0)                                        /* (USBHS_SR) Full-Speed mode  */
#define   USBHS_SR_SPEED_HIGH_SPEED_Val       _UINT32_(0x1)                                        /* (USBHS_SR) High-Speed mode  */
#define   USBHS_SR_SPEED_LOW_SPEED_Val        _UINT32_(0x2)                                        /* (USBHS_SR) Low-Speed mode  */
#define USBHS_SR_SPEED_FULL_SPEED             (USBHS_SR_SPEED_FULL_SPEED_Val << USBHS_SR_SPEED_Pos) /* (USBHS_SR) Full-Speed mode Position  */
#define USBHS_SR_SPEED_HIGH_SPEED             (USBHS_SR_SPEED_HIGH_SPEED_Val << USBHS_SR_SPEED_Pos) /* (USBHS_SR) High-Speed mode Position  */
#define USBHS_SR_SPEED_LOW_SPEED              (USBHS_SR_SPEED_LOW_SPEED_Val << USBHS_SR_SPEED_Pos) /* (USBHS_SR) Low-Speed mode Position  */
#define USBHS_SR_CLKUSABLE_Pos                _UINT32_(14)                                         /* (USBHS_SR) UTMI Clock Usable Position */
#define USBHS_SR_CLKUSABLE_Msk                (_UINT32_(0x1) << USBHS_SR_CLKUSABLE_Pos)            /* (USBHS_SR) UTMI Clock Usable Mask */
#define USBHS_SR_CLKUSABLE(value)             (USBHS_SR_CLKUSABLE_Msk & (_UINT32_(value) << USBHS_SR_CLKUSABLE_Pos)) /* Assigment of value for CLKUSABLE in the USBHS_SR register */
#define USBHS_SR_Msk                          _UINT32_(0x00007010)                                 /* (USBHS_SR) Register Mask  */


/* -------- USBHS_SCR : (USBHS Offset: 0x808) ( /W 32) General Status Clear Register -------- */
#define USBHS_SCR_RDERRIC_Pos                 _UINT32_(4)                                          /* (USBHS_SCR) Remote Device Connection Error Interrupt Clear Position */
#define USBHS_SCR_RDERRIC_Msk                 (_UINT32_(0x1) << USBHS_SCR_RDERRIC_Pos)             /* (USBHS_SCR) Remote Device Connection Error Interrupt Clear Mask */
#define USBHS_SCR_RDERRIC(value)              (USBHS_SCR_RDERRIC_Msk & (_UINT32_(value) << USBHS_SCR_RDERRIC_Pos)) /* Assigment of value for RDERRIC in the USBHS_SCR register */
#define USBHS_SCR_Msk                         _UINT32_(0x00000010)                                 /* (USBHS_SCR) Register Mask  */


/* -------- USBHS_SFR : (USBHS Offset: 0x80C) ( /W 32) General Status Set Register -------- */
#define USBHS_SFR_RDERRIS_Pos                 _UINT32_(4)                                          /* (USBHS_SFR) Remote Device Connection Error Interrupt Set Position */
#define USBHS_SFR_RDERRIS_Msk                 (_UINT32_(0x1) << USBHS_SFR_RDERRIS_Pos)             /* (USBHS_SFR) Remote Device Connection Error Interrupt Set Mask */
#define USBHS_SFR_RDERRIS(value)              (USBHS_SFR_RDERRIS_Msk & (_UINT32_(value) << USBHS_SFR_RDERRIS_Pos)) /* Assigment of value for RDERRIS in the USBHS_SFR register */
#define USBHS_SFR_VBUSRQS_Pos                 _UINT32_(9)                                          /* (USBHS_SFR) VBUS Request Set Position */
#define USBHS_SFR_VBUSRQS_Msk                 (_UINT32_(0x1) << USBHS_SFR_VBUSRQS_Pos)             /* (USBHS_SFR) VBUS Request Set Mask */
#define USBHS_SFR_VBUSRQS(value)              (USBHS_SFR_VBUSRQS_Msk & (_UINT32_(value) << USBHS_SFR_VBUSRQS_Pos)) /* Assigment of value for VBUSRQS in the USBHS_SFR register */
#define USBHS_SFR_Msk                         _UINT32_(0x00000210)                                 /* (USBHS_SFR) Register Mask  */


